[
  {
    "name": "PT Sunline Technology Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524040/hacktiv8/career/pt-sunline-technology-indonesia-thch8l078n.jpg",
    "location": "Wisma Nugra Santana Lantai 11, Jalan Jend. Sudirman Kav 7-8, Kelurahan Karet Tengsin, Kecamatan Tanah Abang, Jakarta Pusat",
    "email": "info@sunline-i.com",
    "description": "Sunline: Empowering Banks and Financial Institutions to Transform and Grow. Established in 2002, Sunline is a leading global provider of banking software and technology services. We are committed to empowering our customers to transform and grow with innovative solutions. With over 7,000 employees, of which more than 90% are technical professionals, we have served over 800 customers in banking and finance worldwide. Our comprehensive suite of solutions includes core banking, digital banking, foreign exchange and treasury, and big data. We are proud to have won numerous awards for our innovation and growth, including the Global IDC Fintech Rankings 2023 & 2022 Top 100 Fintech and Top Emerging Fintech, the 2021 International Finance Awards Fastest Growing Fintech Company, and the Global Brands Award Most Innovative Fintech Company.",
    "createdAt": "2024-06-21T09:15:23.486000Z",
    "updatedAt": "2024-06-24T03:30:27.260000Z"
  },
  {
    "name": "Pt. Inovasi Anak Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524041/hacktiv8/career/pt.-inovasi-anak-indonesia-ser4242gbh.png",
    "location": "Jakarta, Indonesia",
    "email": "info@parkee.app",
    "description": "PARKEE aim to give users a faster, convenient, and seamless parking process by using Technology. We are currently live in 200+ Parking Location throughout Indonesia. Responsibilities: Automating tasks to streamline operations processes. Handling server incidents promptly and efficiently. Maintaining on-premise servers to ensure optimal performance and reliability. Acting as the first-tier support for server-related issues. Automating linear ticketing based on alerting systems. Requirements: Bachelor's degree (S1) or Diploma (D3) in Computer Science, Information Technology, or related fields. Proficiency in Linux system administration. Strong programming skills in Python, Bash scripting, and Java Spring Boot. Experience with automation tools such as Ansible. Ability to work in shifting schedules, including middle and night shifts. Strong problem-solving skills and attention to detail. Ability to work effectively both independently and in a team environment. Prior experience or internships in a related field would be a plus.",
    "createdAt": "2020-10-12T01:01:30.470000Z",
    "updatedAt": "2023-08-10T10:08:30.514000Z"
  },
  {
    "name": "PT. Global Infotech Solutions",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524042/hacktiv8/career/pt.-global-infotech-solutions-0hgkqpenwwc.png",
    "location": "Prince Center Building, 11th floor, Jl. Jenderal Sudirman No.Kav. 3-4, Karet Tengsin, Kecamatan Tanah Abang, Kota Jakarta Pusat, Daerah Khusus Ibukota Jakarta 10220",
    "email": "info@global-infotech.co.id",
    "description": "PT Global Infotech Solution is IBM Power Linux solution provider, as a Master Dealer for Indonesia area we are providing supports to all our partners and customers. With the experience of our team member, we are confidence that we can give you excellent supports. PT Global Infotech Solution is an IT solution company, headquarter in Jakarta, Indonesia. Established in 2015, we have spent the last 3 years building a portfolio of best hardware, software and networking system. Our focus is on helping and supporting our customers in managing our IT operations, ensuring optimal performance and effectiveness in day-to-day routines so that or customers can focus on their core business. At PT Global Infotech Solutions our comprehensive technological solutions help industries leading companies and individuals achieve greater success. Our platform has a wide range of features that were created with an aim to help you live differently. In order to empower our users to do better, PT Global Infotech Solutions is continually building upon its technology, so stay in touch to learn about upgrades and other changes. For a free demo, contact us today. PT Global Infotech Solutions has been awarded with excellence for outstanding achievement and services from IBM, SUSE, TmaxSoft and Ruckus as their true recognitions of our excellent work in Indonesia. We have been recognized as an early player in IBM Linux, and serve a wide range of customers in a variety of vertical markets, including manufacturing, telecommunication, banking, financial services, insurance, hospitality, education, and more.",
    "createdAt": "2019-10-31T04:04:43.047000Z",
    "updatedAt": "2024-08-06T08:57:24.078000Z"
  },
  {
    "name": "Kulina",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524042/hacktiv8/career/kulina-a1q4nlzjprm.png",
    "location": "Gedung Kulina Lt. 3, Jalan Tulodong Atas No. 28, Senayan, Kebayoran Baru, Jakarta Selatan, DKI Jakarta 12190, Indonesia",
    "email": "info@kulina.id",
    "description": "Sejak didirikan tahun 2015, Kulina memiliki kantor di 2 kota dan membuat kami terbiasa berkolaborasi secara remote. Ketika pandemi terjadi, kami dengan mudah beradaptasi menjadi organisasi yang sepenuhnya remote dan WFA (Work from Anywhere). Hanya sebagian kecil dari pekerjaan yang harus dilakukan di kantor atau di studio, sebagian besar bisa dilakukan secara remote dengan efisien dan efektif. Sekarang kami memutuskan untuk melanjutkan metode ini walaupun setelah pandemi selesai.",
    "createdAt": "2021-05-01T03:20:49.019000Z",
    "updatedAt": "2024-08-06T02:12:29.009000Z"
  },
  {
    "name": "SINAR SAKTI INTERNASIONAL",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524043/hacktiv8/career/sinar-sakti-internasional-4q6ln31rtzm.jpg",
    "location": "Menara Standard Chartered Lt 9, Jl Dr Prof Satrio, Setiabudi",
    "email": "info@sinasaktiinternasional.com",
    "description": "Sinar Sakti internasional merupakan perusahaann industri yang menciptakan produk dalam negeri karya anak bangsa. This is a full-time on-site role for a Back End Developer located in East Jakarta. As a Back End Developer, you will be responsible for the day-to-day tasks associated with back-end web development and software development. You will work closely with the front-end development team to ensure seamless integration and optimal performance of web applications.Qualifications Back-End Web Development, Software Development, and Object-Oriented Programming (OOP) skills, Front-End Development and Programming skills, Excellent problem-solving and analytical skills, Strong understanding of database management systems, Experience working with API integration, Knowledge of security and data protection best practices, Experience with version control systems (e.g., Git), Ability to collaborate and work effectively in a team environment, Excellent written and verbal communication skills, Bachelor's degree in Computer Science, Software Engineering, or a related field, Relevant certifications, such as AWS Certified Developer, are a plus.",
    "createdAt": "2023-10-16T03:13:09.470000Z",
    "updatedAt": "2023-11-08T03:08:40.990000Z"
  },
  {
    "name": "Sanskara Sanjaya Abadi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524044/hacktiv8/career/sanskara-sanjaya-abadi-cod4q8jz8fb.png",
    "location": "Jakarta, Indonesia",
    "email": "info@sanskara.co.id",
    "description": "Our client is looking for someone to fill the Java Developer role with the details below:\n\nRequirements:\n- Bachelor's degree in Computer Science, Engineering, or related field.\n- Have 1-3 years of experience as a Python Developer.\n- Strong understanding of Python programming language and frameworks.\n- Experience with web frameworks such as Django or Flask.\n- Familiarity with front-end technologies (HTML, CSS, JavaScript).\n- Knowledge of database systems (SQL, NoSQL).\n- Experience with version control systems (Git).\n- Understanding of software development methodologies (Agile, Scrum).\n\nResponsibilities:\n- Develop and maintain Python applications and systems.\n- Collaborate with cross-functional teams to define project requirements.\n- Create technical specifications and design documents.\n- Write clean, maintainable, and efficient code.\n- Perform code reviews and provide constructive feedback.\n- Test and debug applications to ensure optimal performance.\n- Deploy applications to production environments.\n- Monitor and maintain applications post-deployment.\n- Stay up-to-date with the latest industry trends and technologies.",
    "createdAt": "2023-02-17T01:08:45.254000Z",
    "updatedAt": "2023-02-20T04:40:59.319000Z"
  },
  {
    "name": "PT Jaya Mulia Permata",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524045/hacktiv8/career/pt-jaya-mulia-permata-vfklza2fald.jpg",
    "location": "Jl. Bukit Duri Plaza No.17, RT.1/RW.4, Kp. Melayu, Kecamatan Jatinegara, Kota Jakarta Timur, Daerah Khusus Ibukota Jakarta 13320",
    "email": "info@jayamuliapermata.id",
    "description": "PT Jaya Mulia Permata adalah mitra distributor Perhiasan Emas terkemuka di Indonesia yang menyediakan layanan terintegrasi untuk Toko Perhiasan, memiliki berbagai macam desain Perhiasan Emas, kemudahan transaksi, serta memiliki pelayanan yang berfokus pada pelanggan dengan integritas dan profesional. Visi kami adalah “Menjadi distributor perhiasan terkemuka di Indonesia dengan merek produk dan kualitas layanan terbaik”. Misi kami adalah \"Mendistribusikan Produk Perhiasan secara cepat dan lengkap melalui pengembangan sistem bisnis yang menyinergikan pelayanan pelanggan baik secara offline maupun online dan SDM yang memiliki jiwa melayani, profesional, dan kompeten\". Nilai-nilai Perusahaan Kami yaitu Jalani Bersama. Memfokuskan Pelayanan ke Pelanggan. Pengetahuan yang Selalu Terbarukan. Saat ini, kami bermitra dengan manufaktur perhiasan terbesar di Indonesia seperti UBS, MT Jewelry, YT Jewelry, King Halim Jewelry, Lestari Gold, Lotus Gold, HWT Gold dan SBU Gold. Kami memiliki pelanggan sebanyak 2.300 toko perhiasan dan emas di seluruh Indonesia. Kami juga memberikan kemudahan kepada pelanggan kami di seluruh Indonesia melalui aplikasi JMP Digital dan E-Commerce. Melalui teknologi kami telah berhasil menjangkau lebih banyak pelanggan di seluruh Indonesia.",
    "createdAt": "2023-09-11T09:03:56.235000Z",
    "updatedAt": "2023-09-18T03:15:26.390000Z"
  },
  {
    "name": "Rakamin",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524045/hacktiv8/career/rakamin-5wsdkqbic9a.png",
    "location": "Jakarta, Indonesia",
    "email": "info@rakamin.com",
    "description": "Rakamin is #1 integrated talent management platform on hiring, assessment and employee upskilling that meet the high standards of top companies. Our innovative approach ensures that your organization attracts, develops, and retains the best talent, driving long-term success and growth. Kualifikasi: 1. Memiliki pengalaman sebagai RPA Developer minimal 1 tahun 2. Terbiasa menggunakan tools UiPath 3. Terbiasa mengelola aktivitas SIT dan UAT 4. Dalam SDLC Bank Mandiri (lebih diutamakan) 5. UiPath Certified (lebih diutamakan)",
    "createdAt": "2020-08-19T09:47:18.790000Z",
    "updatedAt": "2024-08-01T09:54:43.393000Z"
  },
  {
    "name": "PT. Solusi Tiga Bersama",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524046/hacktiv8/career/pt.-solusi-tiga-bersama-pcghf0bmvca.png",
    "location": "Gedung Masindo, Jl. Mampang Prpt. Raya No.73.A Lt 3, RT.1/RW.2, Tegal Parang, Kec. Mampang Prpt., Kota Jakarta Selatan, Daerah Khusus Ibukota Jakarta 12790",
    "email": "info@tigabersama.co.id",
    "description": "Solusi Tiga Bersama (STB) adalah sebuah perusahaan yang bergerak dalam bidang penyediaan jasa teknologi keuangan, pembuatas aplikasi, distributor perangkat teknologi informasi, serta perdagangan umum. STB merupakan solusi bagi seluruh perusahaan yang membutuhkan sistem dengan budget yang terbatas. Kami bertujuan untuk memberikan pelayanan nomor satu, dengan tetap menjunjung tinggi mutu. Dalam mencapai tujuan tersebut, kami didukung oleh sumber daya yang profesional, juga berkualitas. Hal ini guna menjaga kepuasan pelanggan yang sudah mempercayakan kami dalam membantu usahanya.",
    "createdAt": "2024-07-19T11:15:02.377000Z",
    "updatedAt": "2024-08-07T09:53:06.244000Z"
  },
  {
    "name": "Rewash.id",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524047/hacktiv8/career/rewash.id-qkvrbuw24kc.png",
    "location": "Jl. Pangeran antasari, cilandak barat",
    "email": "info@rewash.id",
    "description": "Perusahaan franchaise laundry berbasis teknologi. Requirements: - 2+ years of experience in mobile app development either using Flutter - 2+ years of experience in Python development, with proficiency in frameworks like FastAPI. - Experience with asynchronous processing, multithreading, and concurrent programming techniques. - Proficiency in cryptography principles, including encryption/decryption, hash functions, and digital signatures. - Familiarity with Json Web Tokens (JWT) for authentication and authorization. - Extensive experience with MySQL database design and optimization - 2+ years of experience with message brokering systems, preferably using RabbitMQ or Pub/Sub. - Hands-on experience with GitHub Actions or other CI/CD tools. Qualifications: - We expect you to hold a Bachelor's degree in Computer Science, Mathematics, or another engineering or science field from a reputable university. However, if your degree is from a different field but you're confident in your skills, we still encourage you to apply. - Have at least one portfolio of application development that has been published on the web, Playstore, or AppStore.",
    "createdAt": "2024-04-29T09:00:17.953000Z",
    "updatedAt": "2024-05-07T02:27:07.216000Z"
  },
  {
    "name": "PT Sigma Global Teknologi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524057/hacktiv8/career/pt-sigma-global-teknologi-40gosu85816.png",
    "location": "Sona Topas Tower Lt. 12, Jl. Jend. Sudirman, RT.4/RW.2, Kuningan, Kota Jakarta Selatan, Daerah Khusus Ibukota Jakarta 12920",
    "email": "info@sigma-tech.co.id",
    "description": "SIGMATECH is the enterprise technology partner of choice for software development, delivering a broad range of web, mobile, and desktop controls coupled with a service-oriented approach throughout the entire application life cycle. SIGMATECH consists of highly skilled developers specializing in agile development methodology, focusing on Mobile & Web Solution, IT Services and business enterprise, utilizing modern programming languages as our platform. SIGMATECH has established itself as the trusted partner for use in mission-critical applications and service clientele from global insurance companies, government agencies and large consumer product manufacturers. Our Vision: To be the most reputable and dependable growth solution partner both for IT Professional Talents and Client's Businesses worldwide. Our Mission: To be the most reputable and dependable growth solution partner both for IT Professional Talents and Client's Businesses worldwide.",
    "createdAt": "2019-07-31T03:00:08.416000Z",
    "updatedAt": "2023-12-06T04:39:39.599000Z"
  },
  {
    "name": "VisionTech Pte. Ltd.",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524058/hacktiv8/career/visiontech-pte.-ltd.-6rp7y7drc1y.png",
    "location": "Jakarta, Indonesia",
    "email": "info@visiongroup.co",
    "description": "VisionTech Pte Ltd is a leading Blockchain Technology Company providing Blockchain-As-A-Service (BAAS) solutions to our clients. We are focused on driving adoption of blockchain to governments, enterprises and the masses by making it better, faster and easier. We have a Vision to integrate disruptive technology into everyday life to create a better us and a better world. And a Mission to help our clients and stakeholders turn their Vision to Reality. Our goal is to be a leading global technology enabler by placing blockchain, artificial intelligence and cybersecurity into all aspects of everyday life to make lives better through impactful technology. Our core sectors of focus are in Commerce, Finance and eGovernment. Our philosophy is to take impactful technology, make it simple, incorporate it into everyday lives. We are expanding our core technologies and offerings to include Artificial Intelligence and Cybersecurity to provide a holistic and integrated ecosystem for the new digital age. By developing good products, executing through a strong team and implementing effective go-to-market, we turn Vision to Reality. We have fast paced and close working environment and we strongly believe in grooming the next generation of leaders through our company. We believe in working hard and play hard as well. We organize monthly activities such as paintball for staff to bond and let loose.",
    "createdAt": "2019-03-11T08:20:33.314000Z",
    "updatedAt": "2024-02-01T05:51:50.427000Z"
  },
  {
    "name": "Lawencon International",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524059/hacktiv8/career/lawencon-international-sdn87tenx1.png",
    "location": "Pakuwon Tower 22nd floor Jl Casablanca Kav 88, Jakarta Selatan DKI Jakarta12870",
    "email": "info@lawencon.com",
    "description": "We are a rapid-growth and highly innovative IT company based in South Jakarta. We are looking for talented and motivated candidates to be part of our team. Our employees are youthfully enthusiastic and highly passionate about advancement in Information Technology. Thus, we invite you to further develop your professional expertise and join us in our path to become the chosen software provider in business enterprise application. Contact us immediately. Develops code and creates customized applications to enhance product based on business needs. Investigates and resolves matters of significance for end-user problems and escalates if necessary. Provides support for business system analysis and process definition to enhance site functionality. Researches new web technologies to provide clients with state of the art web capabilities. Develop documentation throughout the software development life cycle (SDLC). Apply good technical practices and contribute to the application architecture with a focus on scalability, maintainability, security, and performance. Job Requirements: Candidates must possess at least Bachelor's Degree in Engineering (Computer/Telecommunication), Computer Science/Information Technology or equivalent. At least 5 years of working experience in the related field is required for this position. Experience in the field of business intelligence, application development, database development and ETL and/or data analysis domains with extensive SQL knowledge. Required Skill(s): .NET, ASP.NET, VB, C#, SQL Server, JQUERY, MVC, HTML, CSS, Javascript, Bootstrap, Talend, Microsoft SSIS, Entity Framework Core. Experienced in SQL Server/Postgresql and Stored Procedure (SP). Having knowledge of Object Oriented Programming. Preferably have experience in Nhibernate/C# and ASP.NET. Good in communication & interpersonal skills. Willing to be hired as contract based outsourcing. Understand SDLC (waterfall methodology). Knowledge in agile will be advantageous. Proficient in developing applications using Ms .NET Framework, .NET Core (C#). Ability to work with a cross-functional team. Good communication skill. Able to communicate in English. Good issue, task and time management.",
    "createdAt": "2016-12-07T03:25:29.687000Z",
    "updatedAt": "2023-05-22T04:13:55.146000Z"
  },
  {
    "name": "PT Angkasa Defender Indonesia - ASDF.ID",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524060/hacktiv8/career/pt-angkasa-defender-indonesia-asdf.id-hgtc1o5batc.png",
    "location": "The Kensington Office Tower Jl. Boulevard Raya No.1, Kelapa Gading Timur, Kelapa Gading, Jakarta Utara 14240",
    "email": "info@asdf.id",
    "description": "PT Angkasa Defender Indonesia - ASDF.ID, merupakan perusahaan Distributor dan IT Solution yang berfokus untuk memberikan produk dan layanan IT berkualitas untuk para perusahaan rekanan kami. Kami mencari kandidat terbaik untuk mengisi posisi yang dibutuhkan oleh tim dengan tanggung jawab : Membantu membuat dan mengembangkan aplikasi web yang dibutuhkan perusahaan. Kualifikasi : Freshgraduate atau mahasiswa aktif dipersilakan melamar. Terbiasa menggunakan pemrograman Node JS dan Framework Express JS. Memahami Database noSQL MongoDB (Mongose) dan Rest API. Lokasi Magang di area perkantoran Kelapa Gading, Jakarta Utara. Durasi Magang minimal 6 bulan. Benefit : Terlibat langsung dalam projek nyata, Tambahan skill dan pengalaman, Sertifikat Internship, Peluang menjadi karyawan, Uang Saku. Apabila Anda adalah pribadi yang kami butuhkan, silahkan apply lamaran untuk mengikuti tahap tes onlinenya segera.",
    "createdAt": "2023-09-07T08:26:26.126000Z",
    "updatedAt": "2024-05-07T02:28:52.340000Z"
  },
  {
    "name": "AsiaQuest Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524061/hacktiv8/career/asiaquest-indonesia-yi7hmd5uggo.png",
    "location": "Tamansari Parama Boutique Office 10th Floor, Suite A Jl. K.H. Wahid Hasyim No. 84-88 Menteng, Jakarta Pusat, DKI Jakarta, 10340 Indonesia",
    "email": "info@aqi.co.id",
    "description": "AsiaQuest Indonesia is a digital marketing company in Indonesia. We have a wide range of services start from WEB development (WEB page creation) to mobile solution (mobile apps), E-Commerce, WEB system development, SEO, and Internet Marketing. In this position, you will create and maintain CI/CD pipelines, enhance application monitoring, containerize apps, and strengthen cloud-native deployments. Build automation tools, collaborate with teams, participate in delivery, comply with standards, document DevOps, and address production issues. You will also manage and develop team members and support them in applying DevOps principles. Requirements: 5+ years of application deployment and operations experience on cloud platforms (AWS, GCP, Azure, etc.), Experience creating and maintaining CI/CD pipelines, Experience with monitoring tools (Prometheus, Grafana, ELK Stack, etc.), Working experience with container technologies such as Docker, Kubernetes, etc., Experience with scripting languages such as Python, Bash, etc., Experience with infrastructure code (Terraform, CloudFormation, Ansible, etc.), Advanced troubleshooting skills and problem solving abilities, Communication skills to work collaboratively with team members, Project management skills, Excellent documentation skills, Experience in customer proposal/pre-sale, Experience with AI, ML and data lake implementation(optional), Experience in handling cases in English or Japanese.",
    "createdAt": "2020-01-21T02:14:37.116000Z",
    "updatedAt": "2024-02-20T07:29:38.533000Z"
  },
  {
    "name": "Kkuljaem Korean",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524061/hacktiv8/career/kkuljaem-korean-qtka8gpv9te.jpg",
    "location": "Jl. Jendral Gatot Subroto, Ruko Alicante Paramount Serpong Blok D 27 Tangerang, Banten, Indonesia",
    "email": "info@kkuljaemkorean.com",
    "description": "Kkuljaem Korean adalah les Bahasa Korea online yang didirikan oleh Bandung Oppa (Han Jongdae). Kkuljaem Korean sudah memiliki lebih dari 2000 murid semenjak awal berdiri dan sudah meluluskan sekitar 400 murid. Tanggung Jawab: • Mengembangkan dan memelihara aplikasi web. • Merancang, membangun, dan mengoptimalkan kode front-end dan back-end. • Berkolaborasi dengan tim desain untuk mengimplementasikan antarmuka pengguna yang responsif dan intuitif. • Melakukan pengujian dan debugging untuk memastikan kualitas aplikasi. • Mengintegrasikan API dan layanan pihak ketiga. • Memastikan aplikasi yang dibangun sesuai dengan standar keamanan dan performa. • Mengelola database dan melakukan optimasi kueri. • Menyediakan dukungan teknis dan perbaikan bug secara kontinu. • Mengikuti perkembangan teknologi terbaru dan menerapkan praktik terbaik dalam pengembangan. Kualifikasi: • Lulusan S1 di bidang Ilmu Komputer, Teknologi Informasi, atau bidang terkait. • Pengalaman kerja minimal 1-3 tahun sebagai Fullstack Developer. • Kemampuan dalam HTML, CSS, dan framework front-end seperti React, Angular, atau Vue.js. • Pengalaman dengan bahasa pemrograman back-end seperti Node.js, Java, Laravel atau PHP. • Pengetahuan tentang sistem manajemen basis data seperti MySQL, PostgreSQL, OracleDB atau MongoDB. • Pengalaman dengan penggunaan API dan layanan web (RESTful dan/atau GraphQL). • Kemampuan untuk menggunakan alat versi kontrol seperti Git. • Pengalaman dalam pengembangan dan deployment aplikasi di cloud platforms seperti AWS, Google Cloud, atau Azure. • Keterampilan problem-solving yang baik dan kemampuan untuk bekerja secara mandiri maupun dalam tim.",
    "createdAt": "2024-01-16T05:25:06.842000Z",
    "updatedAt": "2024-05-07T02:26:32.387000Z"
  },
  {
    "name": "PT Pasti Makmur Abadi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524062/hacktiv8/career/pt-pasti-makmur-abadi-u4h1btx019.png",
    "location": "SOHO Capital Podomoro City Lantai 25 Unit 2508, Jl. Letjen S Parman Kavling 28, Kel.\tTanjung Duren Selatan, Kec. Grogol\tPetamburan, Kota Adm. Jakarta Barat, Provinsi DKI Jakarta, Kode Pos: 11470",
    "email": "info@pasti-makmur-abadi.id",
    "description": "STARTING WITH OFFERING INTEGRATED PAYMENT SERVICES THAT CHATTERED THE NEEDS TO MAKE MULTI PAYMENT CHANNELS COVERING UTILITY BILLS (ELECTRICITY/PLN, WATER/PDAM, PHONES, PAID TVS), INSURANCE (BPJS), INSTALLMENTS (FROM VARIOUS MULTI FINANCE COMPANIES), E-WALLETS (OVO, GOPAY, DANA, LINKAJA) AS WELL AS TELCO PREPAID TOPUP. EXPANDING INTO TALENT MANAGED SERVICE THAT SPECIALIZED ON IT SECTOR BASED ON OUR TEAM EXPERIENCE IN BUILDING AND MANAGING OUR PLATFORM AS WELL AS SEVERAL IT RELATED PROJECTS THAT WE ARE HANDLING.",
    "createdAt": "2022-11-08T09:16:22.207000Z",
    "updatedAt": "2022-11-17T09:51:29.266000Z"
  },
  {
    "name": "SIMIAN Group",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524063/hacktiv8/career/simian-group-t13q6rmgv6g.jpg",
    "location": "Wisma Geha 1-2nd Floor Jl. Timor No.25",
    "email": "info@simian.co.id",
    "description": "We are a technology group of companies that delivers mission-critical enterprise solutions. With the purpose of empowering progress and unlocking possibilities for our stakeholders—our clients, operational governance, and employees—we aim to create a transformative, data-driven ecosystem that unlocks their full potential. We achieve this by harnessing our expertise in data management, wealth management, and custodian solutions to empower every decision and progress. Powered by our INOV8 culture, we utilize tailored, relevant, and reliable technologies and offer comprehensive services, including consultancy, training, and technology solutions across our areas of expertise. This enables our stakeholders to cultivate an ecosystem of sustainable growth and deliver exceptional value.",
    "createdAt": "2022-12-27T04:20:51.137000Z",
    "updatedAt": "2024-05-17T07:54:44.244000Z"
  },
  {
    "name": "PT. Noesantara Corporation",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524064/hacktiv8/career/pt.-noesantara-corporation-ru2tqmsroa.png",
    "location": "JL. Serayu No. 20 Kelurahan Labuh Baru Timur, Kecamatan Payung Sekaki, Pekanbaru - Riau 28292",
    "email": "info@noesantaracorp.co.id",
    "description": "BUSINESS PRESENTATION\n- DEBT RECOVERY\n- LAW FIRM\n- ADVISORY\n- OUTSOURCHING\n- PROPERTY",
    "createdAt": "2022-06-03T07:59:11.318000Z",
    "updatedAt": "2023-06-20T09:48:53.981000Z"
  },
  {
    "name": "PT Murinda Iron Steel",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524064/hacktiv8/career/pt-murinda-iron-steel-oj7fxrojc1l.png",
    "location": "15 Fl, Permata Kuningan Building, Jalan Kuningan Mulia Kav. 9C, Jakarta 12980, Indonesia",
    "email": "info@murinda.com",
    "description": "The hopes of thousands of people lives within each company. As one of the Indonesia's largest general contractors and steel structure, Murinda has been involved in numerous projects, such as hotel, apartment, office building, hospital and health center, shopping mall and trade center, residential, factory, educational facilities, chemical plant, airport building, terminal and hangar, power plant, industrial plant, bridge, and other commercial building. We share innovative technologies, provide job opportunities, and maintain some of the highest industry standards on earth. PT Murinda Iron Steel is a leader in construction. Its operations in general contractor and steel structure are designed to meet customers' needs. In order to deliver quality and value to customers, it is Murinda tradition to be responsible to approach the bussiness partner. We focus on efficient operations and innovations, as well as skill to sustain competitive advantages through business cycles. Since its establishment on June 28, 1974, the company has succesfully increased its performance. From housing project to high rise building and mall such as WTC Mangga Dua Trade Centre with 235,000 sqm, huge projects like 'Office, Plant, Warehouse and External Works' of Jakarta Greenfield for PT HM Sampoerna Tbk with 580,000 sqm total area, Schlumberger Jakarta Integration Base - Main Building Works with 93,000 sqm total land area and Office Development at SCBD Lot 10, Jakarta with 6 levels basement and 40 stories tower; as well as a factory project as small as 40 tons of steel to the huge industrial plant project as huge as 10,000 tons or more. In 1997, despite the prolonged monetary crisis, Murinda increased its production capacity to 20,000 tons and earned a revenue of 900 billion Rupiahs per year. Not only does our success as a contractor depends on our skill and the delivering of quality, but also on our shared commitment to our business partner. Our strategy is focusing on delivery value with competitive cost operation in order to maintain our positions in quality of projects and long term economic value. We also seek efficiency improvements. For over 40 years in construction service area in Indonesia, Murinda has worked with many foreign contractors, and has received a lot of transfer management. As the motto '…a long tradition of innovative construction ….' Murinda always motivates the employees to be innovative and to continuously provide customers with the same outstanding service.",
    "createdAt": "2019-06-21T07:49:52.907000Z",
    "updatedAt": "2024-04-17T03:47:49.922000Z"
  },
  {
    "name": "Talent Tech",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524065/hacktiv8/career/talent-tech-l18av3q3vx.jpg",
    "location": "Headquarters\nJl. Kuningan Bar. 1 No.26, RT.6/RW.1, Kuningan Bar., Kec. Mampang Prapatan., Kota Jakarta Selatan, Daerah Khusus Ibukota Jakarta 12710, Tifa Building 8th Floor, South Jakarta, DKI Jakarta 12710, ID",
    "email": "info@talent-tech.id",
    "description": "Talent-Tech enables individuals and organizations to thrive in an increasingly digital and technology-driven landscape. Job Descriptions: Membangun perangkat lunak yang kuat dan skalabel dengan membangun fitur baru, debugging, dan mengoptimalkan aplikasi. Menulis kode bersih untuk mengembangkan aplikasi web fungsional. Berkolaborasi dengan pengembang front-end untuk mengintegrasikan elemen yang terlihat oleh pengguna dengan logika sisi server. Mengembangkan dan mengusulkan produk atau fitur baru dengan memantau industri. Bekerja sama dengan desainer, manajer produk, dan administrator sistem untuk mengidentifikasi dan membangun fitur baru. Job Requirements: Pendidikan minimal S1 Ilmu komputer/ Sistem Informasi/ Informasi teknologi. Pengalaman minimal 1 tahun di bidang yang sama. Pengetahuan dan pengalaman yang kuat dalam back-end (Golang, PHP, REst API, etc). Familiaritas dengan database seperti MySQL, SQL, SERVER. Pengalaman dengan Linux/Unix dan manajemen server. Keahlian dalam penggunaan alat manajemen kode seperti Git. Familiar dengan layanan web hosting seperti AWS. Pengetahuan tentang arsitektur MVC.",
    "createdAt": "2024-02-07T10:06:59.561000Z",
    "updatedAt": "2024-05-07T02:25:54.194000Z"
  },
  {
    "name": "PT Anabatic Technologies, Tbk",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524066/hacktiv8/career/pt-anabatic-technologies-tbk-2s1ann8u8w.png",
    "location": "Jl. Scientia Boulevard Summarecon Serpong, Curug Sangereng, Kec. Klp. Dua, Kabupaten Tangerang, Banten 15810",
    "email": "info@anabatic.com",
    "description": "Anabatic Technologies is an IT holding company that delivers solutions through its business pillars separated into three main business lines; Mission Critical Digital Solutions, Digitally Enriched Outsourcing Services, & Cloud & Digital Platform Solution. Job Descriptions: Perform monitoring of ERP data, Develop API (Application Programming Interface), Modify application to support business need. Job Requirements: S1 majoring in Information Technology, Have minimum 1 year experiences in Back-end Developer & Front-end Developer (Fullstack Developer) is a must, Proficient & experienced in using Node JS, Angular, Understand basic flow of ERP will be an advantage, Willing to be placed in South Jakarta.",
    "createdAt": "2023-09-04T08:05:40.806000Z",
    "updatedAt": "2024-05-07T02:27:42.227000Z"
  },
  {
    "name": "Hukumonline.com",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524067/hacktiv8/career/hukumonline.com-xluyro9vnf.jpg",
    "location": "Jl. TB Simatupang No.5, RT.5/RW.7, Ragunan, Kec. Ps. Minggu, Kota Jakarta Selatan, Daerah Khusus Ibukota Jakarta",
    "email": "info@hukumonline.com",
    "description": "Hukumonline.com is a regulatory technology company in Indonesia and provides information and resources on Indonesian law. It is a legal information portal that aims to provide easy access to legal information for the public, lawyers, and legal professionals. We offers a wide range of legal information, including laws and regulations, legal news and analysis, legal cases, legal dictionaries, and other legal resources. It also provides a forum for discussing legal issues and a directory of legal service providers in Indonesia. We are expanding our technology profile by recruiting top talents and embracing new technology stack with the Value of our company is BITE (Balance, Innovation, Teamwork, and Empathy). Our employees are encouraged to be innovative and build their own ideas.",
    "createdAt": "2021-08-05T09:52:29.878000Z",
    "updatedAt": "2023-04-04T07:03:39.402000Z"
  },
  {
    "name": "PT Matrica Consulting Service",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524067/hacktiv8/career/pt-matrica-consulting-service-j656allxf4.png",
    "location": "Satrio Tower, C4, Kuningan, Jl. Prof. DR. Satrio, Jakarta 12950",
    "email": "info@matrica.co.id",
    "description": "Matrica Consulting Services (Matrica) yang didirikan tahun 2005 merupakan perusahaan Manajemen Teknologi Informasi yang mengkhususkan diri pada area IT Strategic Planning, IT Risk, & IT Security. Pesatnya perkembangan teknologi informasi yang berdampak pada pesatnya pertumbuhan pasar, mendorong Matrica untuk mengembangkan portolio bisnis dan keahlian menjadi 3 (tiga) kelompok bidang keahlian (KBK) yaitu: IT Management Consulting, Business Intelligent, Data Warehouse, & Balanced Scorecard, Application Development & Integration.",
    "createdAt": "2019-07-16T11:01:35.514000Z",
    "updatedAt": "2023-09-13T03:38:12.833000Z"
  },
  {
    "name": "PT Euro Management Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524068/hacktiv8/career/pt-euro-management-indonesia-mo4miiaqqk.jpg",
    "location": "Gedung HM Suseno Jl. RP Soeroso No. 6 Menteng - Jakarta Pusat 10310",
    "email": "info@euromanagement.co.id",
    "description": "Euro Management Indonesia adalah suatu lembaga profesional yang bergerak di bidang jasa secara terpadu dan terintegrasi bagi calon mahasiswa-mahasiswa Indonesia yang ingin melanjutkan studinya ke berbagai perguruan tinggi di negara-negara Eropa, khususnya. Oregon Cyber School bekerja sama dengan Euro Management Indonesia berdedikasi untuk memberikan pengalaman belajar yang inovatif dan menarik bagi siswa SMP dan SMA. Kami mencari Instruktur Pengembangan Permainan Software yang bersemangat dan berpengetahuan untuk bergabung dengan tim kami dan menginspirasi generasi pengembang permainan berikutnya. Kriteria: 1. Pria/Wanita, maks 35thn. 2. Background pendidikan S1 Ilmu Komputer, Pengembangan Permainan, Pendidikan, atau bidang terkait diutamakan dari berbagai perguruan tinggi negeri maupun swasta. 3. Memiliki keahlian dalam membuat game dengan MIT Scratch & Unity. 4. Bersedia kerja Partime atau freelance. 5. Pengalaman mengajar min. 1 tahun. 6. Mampu bekerja di dalam team. Jika Anda tertarik untuk bergabung dengan tim kami, silahkan datang langsung dengan membawa CV ke Kantor kami di: Euro Management Indonesia - Rumah Eropa, Jl. Teuku Cik Ditiro No. 61, Menteng, Jakarta Pusat 10310. Batas waktu pendaftaran 25 Juli 2024.",
    "createdAt": "2024-03-18T03:13:27.652000Z",
    "updatedAt": "2024-03-19T03:39:21.398000Z"
  },
  {
    "name": "SpeedHunt",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524069/hacktiv8/career/speedhunt-g7yw2p0896e.jpg",
    "location": "Grand Slipi Tower, Jl. Letjen S. Parman No.24, RT.1/RW.4, Palmerah, Kec. Palmerah, Kota Jakarta Barat, Daerah Khusus Ibukota Jakarta 11480, Indonesia",
    "email": "info@speedhunt.co.id",
    "description": "Discover Top Tier Talent! 1. Develop back-end services (web API, scheduler) accordingly to requirements and technology standard. 2. Deploy tested back-end services and ensure the functionalities work well. 3. Maintain and troubleshoot issues related to back-end services. 4. Monitor and ensure availability of back-end services. 5. Write high-quality, clean and maintainable code and technical documentation. 6. Collaborate with other developers, technical lead, UI/UX designer, QA, product owner, tribe leader and other stakeholders to build applications. Additional expertises need / Kebutuhan keahlian khusus: 1. Strong understanding in J2EE, Spring framework and MVC concept. 2. Strong understanding in REST API and JSON. 3. Good understanding in Java web application deployment and configuration. Experience in Docker, Kubernetes, Microservices architecture is a great plus. 4. Good understanding in database query (preferably PL/SQL). Experience in schema design, query optimization is a great plus. 5. Basic understanding in Agile and Scrum. 6. Self-motivated, can-do attitude and good communication skill.",
    "createdAt": "2024-02-07T02:49:48.351000Z",
    "updatedAt": "2024-05-07T02:29:14.140000Z"
  },
  {
    "name": "Xai Syndicate Internasional",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524069/hacktiv8/career/xai-syndicate-internasional-mcp0az62ze7.jpg",
    "location": "Jl. Ir. H. Juanda No.84, Kota Bandung",
    "email": "contact@xaisyndicate.co.id",
    "description": "Provider that focuses on IT Security services (Cyber Security Risk Assessment, Penetration Testing, Application Assessment, Vulnerability Assessment, Cloud Security), digital media agency and application development (Software). present and stand as a form of dedication of information technology activists to answer the needs and challenges in the era of the global industrial revolution. We are looking for a Full Stack Developer to produce scalable software solutions. You’ll be part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment. As a Full Stack Developer, you should be comfortable around both front-end and back-end coding languages, development frameworks and third-party libraries. If you’re also familiar with Agile methodologies, we’d like to meet you. Responsibilities : YII Framework core system base, you must be strong in PHP v.7x/8x. Work with development teams and product managers to ideate software solutions (It's great if you know about retail apps). Design client-side and server-side architecture. Build the front-end of applications through appealing visual design. Develop and manage well-functioning databases and applications. Write effective APIs. Test software to ensure responsiveness and efficiency. Troubleshoot, debug and upgrade software.",
    "createdAt": "2021-07-11T17:40:42.879000Z",
    "updatedAt": "2021-07-12T09:04:57.732000Z"
  },
  {
    "name": "PT Fan Integrasi Teknologi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524070/hacktiv8/career/pt-fan-integrasi-teknologi-5mx5yxgvfmw.png",
    "location": "Jakarta, Indonesia",
    "email": "info@fanintek.com",
    "description": "PT FAN Integrasi Teknologi berdiri atas dasar pengalaman dan perkembangan Teknologi Informasi. Bertujuan untuk memenuhi permintaan IT yang tidak dapat diberikan oleh perusahaan lain. Memiliki tiga bidang yang di naungi yaitu Aplikasi, Infrastruktur dan Manage Services. The ideal candidate will be responsible for conceptualizing and executing clear, quality code to develop the best software. You will test your code, identify errors, and iterate to ensure quality code. You will also support our customers and partners by troubleshooting any of their software issues. Responsibilities: • Detect and troubleshoot software issues • Write clear quality code for software and applications and perform test reviews • Develop, implement, and test APIs • Provide input on software development projects • Have strong analytical and problem-solving skills • Have a sense of responsibility • Able to learn quickly and thrive in the work environment. Qualifications: • Comfort using programming languages and relational databases • Strong debugging and troubleshooting skills • 3+ years' of development experience • Business Process Finance Company • ITIL 4 • Mastering Linux OS and Windows Server operating systems • Mastering computer networks (TCP/IP, DNS, etc.) • Experience mastering at least one programming language: Bash, Python • Mastering whatap monitoring tools • Have qualified skills for the monitoring application used (whatap, elastic, Dynatrace) in carrying out their job as a monitoring team.",
    "createdAt": "2018-09-21T11:29:26.386000Z",
    "updatedAt": "2023-08-11T08:32:39.350000Z"
  },
  {
    "name": "PT. METROCOM GLOBAL SOLUSI",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524071/hacktiv8/career/pt.-metrocom-global-solusi-uc4ggpxnm4p.jpg",
    "location": "JL,PROF DR SOEPOMO NO.290,TEBET",
    "email": "info@metrocom.co.id",
    "description": "PT. Metrocom Global Solusi, established in July 1998. We have successfully deployed core applications, infrastructure, managed services solutions, and is one of the leading Information Technology solutions companies in Indonesia. •\tProficient Linux command •\tExperienced as Red Hat System Administration •\tHave Red Hat Certified System Administrator (RHCSA) or JBOS certification to be plus •\tUnderstand the concept of microservices •\tHas experience managing docker, kubernetes and Red Hat Openshift •\tExperience using jenkins or ansible becomes an added value •\tGood analytical skills, to identify issues and propose response action •\tHaving personal skills in communication with users to coordinate with related parties related to the problem •\tProvide administrative support on Red Hat OCP, JBOSS, and RHEL including: •\tVerify dashboard operation •\tManage the internal registry •\tManage users, projects, and storage containers •\tMonitoring the health of the monitoring container and logging system •\tLog incident tickets with Red Hat Support and follow up on progress of incident escalation and resolution •\tWork with Level 2 and Level 3 support to communicate progress on issues •\tProvides expertise and assistance with fast troubleshooting with enhanced first-rate system diagnostics. Assist by providing general knowledge transfer and documentation with the installation and configuration of Red Hat technology in scope.",
    "createdAt": "2022-05-25T03:56:34.642000Z",
    "updatedAt": "2024-06-26T06:09:40.226000Z"
  },
  {
    "name": "Pt Mest Indonesiy",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524071/hacktiv8/career/pt-mest-indonesiy-nny26kjm4xa.jpg",
    "location": "Jl. K.H. Mas Mansyur No.121, Gedung Citylofts Sudirman Lt.25, Suite Room 2517. Jakarta Pusat 10220",
    "email": "info@mestindo.com",
    "description": "PT. Mest Indonesiy atau yang lebih dikenal dengan sebutan Mestindo didirikan pada tahun 2009. Perusahaan bergerak di sektor agrikultur seperti pupuk, pestisida, benih, dan alat pertanian. Mestindo memiliki kantor cabang yang tersebar di berbagai wilayah yang potensial untuk menjangkau pelanggan secara langsung. Salah satu produk andalannya di sektor pupuk menggunakan nama LAOYING sebagai merk dagang perusahaan.",
    "createdAt": "2018-08-16T10:34:24.255000Z",
    "updatedAt": "2024-03-21T02:53:26.469000Z"
  },
  {
    "name": "BIT - Barito Technologies Group",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524072/hacktiv8/career/bit-barito-technologies-group-5hq2osm1q4o.jpg",
    "location": "Soho Podomoro City 2610, Jl. S. Parman Kav 28, Jakarta Barat, Jakarta 11470, ID",
    "email": "info@barito.tech",
    "description": "Serving clients since 2014, Barito Technologies has grown from garage operation into embracing Industrial Revolution in Indonesia. Barito Technologies is currently looking for an Associate Backend Developer. Requirements: Knowledge and several years (min. 3 years) of experience in working with Java Springboot. Familiar with scrum and agile. Familiar with docker and microservices. Ability to think analytically and effectively search for information. Problem-solving attitude, proactivity and willingness to implement your own ideas. Being able to quickly learn new coding language or frameworks. Behave well and attitude. Open for insurance industry.",
    "createdAt": "2023-12-07T09:51:57.328000Z",
    "updatedAt": "2024-05-07T02:28:44.032000Z"
  },
  {
    "name": "PT Juke Solusi Teknologi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524073/hacktiv8/career/pt-juke-solusi-teknologi-csrb2iausl.png",
    "location": "Jl. Cemp. Putih Tengah I No.5F, RT.10/RW.5, Cemp. Putih Tim., Kec. Cemp. Putih, Kota Jakarta Pusat, Daerah Khusus Ibukota Jakarta 10510",
    "email": "info@jukesolutions.com",
    "description": "JUK e-Solutions is a leading IT solution provider focusing on Big Data Solutions. We offer integrated solution on Data Analytics, Business Intelligence, Data Infrastructure and Storage Management. Our team of experts will help your organization in providing a robust and scalable foundation for rapid deployment of right-time Analytics and Reporting, while reducing operating Infrastructure costs by ensuring efficient data placement, movement and retention/expiration. The combination of our expertise and our partner technology will enable your organizations to better understand, anticipate and shape business outcomes through the ability to optimize the impact of your Enterprise IT Infrastructures and Services.",
    "createdAt": "2019-06-28T08:46:43.966000Z",
    "updatedAt": "2023-09-06T06:55:22.095000Z"
  },
  {
    "name": "Koperasi Nasari Usaha Mikro Kecil Menengah",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524074/hacktiv8/career/koperasi-nasari-usaha-mikro-kecil-menengah-6mvnfw4mumh.jpg",
    "location": "The Kensington Office Tower Lantai 10 Ruko A, B, & K. Jl. Boulevard Raya No. 1 Kelapa Gading, Jakarta Utara",
    "email": "info@nadi.co.id",
    "description": "Cooperation Company that involve into modern and digital cooperation",
    "createdAt": "2021-08-12T02:30:23.539000Z",
    "updatedAt": "2022-04-18T07:30:46.697000Z"
  },
  {
    "name": "PEHA",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524074/hacktiv8/career/peha-ofvdpbx9jh8.png",
    "location": "Jl. Taman Palem Lestari Blk. C16 No.59",
    "email": "info@peha.com",
    "description": "PEHA adalah sebuah perusahaan yang bergerak di bidang servis digital. Kami memberikan berbagai macam Jasa Digital seperti sosial media, pembuatan aplikasi dan sebagainya. Job Description : - Collaborate with the Marketing/Sales to understand the project requirements, objectives, and client needs - Develop and maintain the responsive website, landing page, web application, and others using HTML, CSS, Javascript, and Vue.js. - Responsible for optimizing website performance and user experience (UX). - Provide troubleshooting and technical support for website-related issues and updates. - Implement tracking tools to monitor traffic, user behavior, and other useful metrics. - Write and maintain software documentation - Plan and report directly to the Manager. Qualifications: - Bachelor's or Master's degree in Computer Science, Engineering, or a related field. - 2+ years of experience as a Frontend Engineer, with a strong focus on web development. - Proficiency in HTML, CSS, JavaScript, TypeScript, and modern frontend frameworks (Angular, Vue.js, etc.). - Deep understanding of RESTful APIs, asynchronous programming, and GraphQL. - Familiar with NPM, CI/CD environment, and container-based platforms (Docker, Kubernetes, etc.). - Good communication skills and ability to explain technical concepts to both tech/non-tech stakeholders.",
    "createdAt": "2024-06-26T18:56:45.755000Z",
    "updatedAt": "2024-07-02T02:53:50.470000Z"
  },
  {
    "name": "PT Inter Sistem Asia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524075/hacktiv8/career/pt-inter-sistem-asia-xjh12yp3tj.png",
    "location": "Arkadia Green Park Estate, Tower F, 6th floor, Jl. TB Simatupang Kav 88, Jakarta",
    "email": "info@i-systemasia.com",
    "description": "iSystem Asia is a Management and Technology Consulting Company, focusing on Customer Relationship Management (CRM), Customer Experience Management (CX) and Business Process Management (BPM). Our services range from training, certification, consulting and system implementation. We are CRM and BPM technology expert helping organizations in a wide range of industries such as telecommunications, banking, finance, aerospace, construction, FMCG, education, and government agency. With a diverse group of passionate and competent people, we bring a unique and global approach to improving business’ efficiencies and simplifying its process.",
    "createdAt": "2023-03-08T04:17:59.547000Z",
    "updatedAt": "2023-03-27T04:49:16.890000Z"
  },
  {
    "name": "PND Ice Machine",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524076/hacktiv8/career/pnd-ice-machine-urvnc6irn0i.jpg",
    "location": "Jln Suryopranoto, Harmoni Plaza Blok A No. 16-17, Petojo Utara, Gambir, Jakarta Pusat",
    "email": "info@pndice.com",
    "description": "PND Ice Machine is the first Ice Machine company in Indonesia, with over 35 years of experience in this industry, providing comprehensive ice factory products and solutions from upstream to downstream. We offer a variety of high-quality ice production machines and customer support services, including machine maintenance and spare parts, to meet the increasing demand for ice in the Indonesian market. Our certified and professional team of technicians is dedicated to delivering quality customer service and the solutions you need. Do you need assistance in realizing your ice factory business? PND Ice Machine is here to partner with you at every step of your business journey. PND ICE, YOUR ICE BUSINESS SOLUTION.",
    "createdAt": "2021-08-31T10:02:31.665000Z",
    "updatedAt": "2024-07-19T03:47:55.030000Z"
  },
  {
    "name": "Youtap Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524076/hacktiv8/career/youtap-indonesia-hfjydji1bks.png",
    "location": "Wisma46",
    "email": "info@youtap.id",
    "description": "Youtap Indonesia menyediakan platform dan solusi digital untuk semua bisnis dan perusahaan. Menghadirkan berbagai transaksi digital terkini kepada mitra kami agar dapat lebih baik melayani konsumen. Kami ingin menjadi yang terbesar di Indonesia untuk jaringan penerimaan transaksi dan juga menjangkau potensi diluar transaksi pembayaran. Kami menawarkan solusi layanan digital terlengkap untuk membantu semua pelaku usaha dalam menjalankan kegiatan usahanya sehari hari.",
    "createdAt": "2020-06-20T17:44:55.046000Z",
    "updatedAt": "2023-02-20T04:11:50.968000Z"
  },
  {
    "name": "Amit Global Solutions",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524077/hacktiv8/career/amit-global-solutions-jn61bj5hozb.png",
    "location": "Menara Karya, 28th Floor Jl. H.R. Rasuna Said Blok X-5 Kav. 1-2, Jakarta 12950 Indonesia",
    "email": "info@amitglobal.com",
    "description": "AGS is a renowned solutions and Services provider that offers a variety of workforce solutions to clients throughout the world. Whether it's a new technology, a growing need for skills, evolving needs from people, or an impending disruption, we're here to help you set yourself apart from the competition and build world-class teams. Our clients in all regions count on us as a reliable business partner owing to our fast turnaround times and high-quality, cost-effective solutions. Placement for Banking Syariah Project at Karet Semanggi, South Jakarta. Responsibilities: Utilize webMethods for application development and maintenance. Understand and implement banking workflow processes. Develop and maintain code using one or more programming languages. Analyze and troubleshoot problems in existing codebases. Create and maintain technical documentation for projects and processes. Design and document workflow processes using flowcharts. Qualifications: Minimum 1-2 years of experience using Java and webMethods. General understanding of banking workflows. Proficiency in one or more programming languages. Ability to analyze problems and read code. Capable of creating technical documentation. Ability to design workflows using flowcharts.",
    "createdAt": "2024-05-21T03:32:39.765000Z",
    "updatedAt": "2024-06-12T08:08:20.588000Z"
  },
  {
    "name": "Pt Boer Technology",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524078/hacktiv8/career/pt-boer-technology-u8whwsadd2.png",
    "location": "Komplek Ruko Pandu Raya No. 14, Ruko Bagian Belakang, Jl. Pandu Raya, RT.001/RW.005, Tegal Gundil, Kec. Bogor Utara, Kota Bogor, Jawa Barat 16152",
    "email": "info@btech.id",
    "description": "Btech was developed from a vision of ICT utilization that efficient and environmental-friendly for companies that have main mission to utilize Linux and FOSS (Free/Open Source Software) as the tools. Established since middle of 2009, Btech always commits to give the best service for customers. Btech has high productivity and innovation since it supported by capable and skillful human resources and reliable work infrastructure. Conducive office location and friendly atmosphere of work also supports Btech to be able to give solution on customer problems. Another strength of Btech is good relation and interaction to other IT communities that have same vision, because Btech believes that together, we do things better. Services provided by Btech include comprehensive cloud system training and integrated cloud system solutions to be implemented in your business environment.",
    "createdAt": "2021-03-03T02:18:05.003000Z",
    "updatedAt": "2023-08-16T09:27:12.519000Z"
  },
  {
    "name": "PT Avows Technologies",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524078/hacktiv8/career/pt-avows-technologies-p30c52u3i7k.png",
    "location": "Menara Rajawal, 24 floor, Mega Kuningan",
    "email": "info@avowstech.com",
    "description": "Founded in 2008, Avows serves global IT companies and the leading software vendors in Communications & Technology, Banking & Financial Services, Insurance, Telecommunications, and Media, Information & Entertainment industries. We build and support applications and platforms for our clients that create competitive advantage and bring true value to the customer.",
    "createdAt": "2019-02-07T00:15:46.128000Z",
    "updatedAt": "2023-07-24T09:54:37.052000Z"
  },
  {
    "name": "PT Evolusi Teknologi Indonesia (Evoteks)",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524079/hacktiv8/career/pt-evolusi-teknologi-indonesia-%28evoteks%29-kblv041twxh.jpg",
    "location": "Jakarta, Indonesia",
    "email": "info@evoteks.co.id",
    "description": "EVOTEKS start its business as an IT and HR consulting service, now we mean to develop our integrated business consulting service. Requirements : Bachelor’s Degree in Computer Science, Informatics System, Information Technology or equivalent. Minimum 2 years working experience in programming. Have a good logic in programming and analytical skill. Web Programming skill(s) : HTML, CSS, PHP, Java, Javascript, Golang. Mobile Programming skill(s) : Android (Kotlin/Java) or iOS (objective-c/Swift). Database and Reporting skill(s) : PL/SQL, SQL Server. Ability to work under pressure. Great attitude, initiative, and diligent. Fast learner and willing to learn. Multi-finance and Banking experience is a plus. Job Descriptions : Involve in the entire development from coding, testing, resolve system issues and implementation. Work closely with other team members to achieve target. Document and provide periodic report based on the needs of related organizations requirement.",
    "createdAt": "2022-03-23T02:59:31.338000Z",
    "updatedAt": "2022-03-29T09:08:51.746000Z"
  },
  {
    "name": "PT. Permata Azzuri Sehat",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524080/hacktiv8/career/pt.-permata-azzuri-sehat-sgd8bu35kas.png",
    "location": "Cyber 2 Tower Lt. 18, Jl. HR. Rasuna Said Block X-5",
    "email": "info@permataazzurisehat.com",
    "description": "PT. Pemata Azzuri Sehat adalah perusahaan start-up mitra klinik kesehatan berbasis cloud computing services. Kami membantu klien kami melakukan peningkatan kinerja yang langgeng dan mewujudkan tujuan terpenting mereka melalui aplikasi dan solusi bisnis terbaik. Persyaratan : Lulusan Sarjana Ilmu Komputer/IT; Memiliki pengalaman minimal 5 tahun dalam pengembangan aplikasi web; Memiliki kemampuan dalam menulis dokumentasi teknis seperti use case, flow chart, swim lane, sequence diagram, component diagram, dll.; Memiliki pengetahuan dan pengalaman dengan pengembangan Teknologi Web (Backend&Frontend), menekan pada kerangka kerja terkit Java & Javascript (misalnya visual studio, anguar, react, node.js); Memahami progressive web apps, layanan web dan pengembangan API; Pengalaman dengan database noSQL, seperti Mariadb, HBase, Cassandra, MongoDB atau sejenisnya; Pengalaman dengan Git dan Gitflow. Tugas dan tanggung jawab : Memberikan arahan fungsional dan bimbingan teknis kepada tim Development; Melakukan analisis dari masalah bisnis maupun teknis dan memberikan solusi; Membuat laporan lisan maupun tertulis kepada CEO/CTO secara berkala; Membantu membuat program dan memimpin dalam design perencanaan, tata kelola pelaksanaan proyek dalam bentuk apapun; Menerapkan proses ETL (extract, transform, load); Merekayasa pengambangan perangkat lunak dan Big Data secara efisien.",
    "createdAt": "2022-03-02T06:54:08.784000Z",
    "updatedAt": "2022-03-09T04:33:17.633000Z"
  },
  {
    "name": "PT Reka Multi Aptika",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524081/hacktiv8/career/pt-reka-multi-aptika-qlxrlz1tyo.jpg",
    "location": "Gedung Graha Senatama, Lt. 4 Jl. Kramat Kwitang No.8,  RT.1/RW.7, Kwitang, Kec. Senen, Kota Jakarta Pusat,  Daerah Khusus Ibukota Jakarta 10420",
    "email": "info@aptika.co.id",
    "description": "PT Reka Multi Aptika is a modern information technology (IT Industry) company that prioritizes innovation and the application of today's technology in meeting all system needs both inside and outside the company. We uphold consistency and initiative in understanding today's technological innovations and their relationship to a technological solution that can simplify the process of modern life and business opportunities both materially and non-materially. We invite young professionals and creative individuals to move together towards our company's vision and mission, which is to create a modern technology industry that is useful for a broad and innovative business market.",
    "createdAt": "2022-10-11T07:19:27.812000Z",
    "updatedAt": "2022-10-11T08:41:36.565000Z"
  },
  {
    "name": "PT Datascrip",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524082/hacktiv8/career/pt-datascrip-rtuzmc4o8od.png",
    "location": "Jl. Selaparang Blok B-15 Kav. 9, Kompleks Kemayoran,     Jakarta 10610",
    "email": "info@datascrip.com",
    "description": "Datascrip – Business Solutions. A company that markets and sells machinery, digital devices, furniture, survey tools, stationery, and systems needed in business and offices. Datascrip started out as a humble stationery store in 1969. The company continued to expand its product lines from stationery to office equipment, office machines, drafting machines, office furniture, computers and printers. In 1979, Office Systems was the company's core business. With its foray into information technology sector, Datascrip is now known as a One-Stop Business Solutions company. Our vision is to be the prominent distributor of business products in Indonesia. Our mission is to support customer's business through high quality product provision and excellent customer service, with strong company culture, competent employees, efficient technology and good financial health. We believe and base our actions on the following values: Succeed Above Success. CARE - Customer Interest, Attentive, Responsive and Enthusiasm. SMILE - Share, Motivate, Improve, Lead, Efficient. CoCoCoCo - Communication, Cooperation, Coordination, Commitment.",
    "createdAt": "2016-02-05T13:47:57.204000Z",
    "updatedAt": "2023-09-01T12:18:10.592000Z"
  },
  {
    "name": "Noosc",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524083/hacktiv8/career/noosc-d9qurjcdeas.jpg",
    "location": "Jakarta, Indonesia",
    "email": "info@noosc.co.id",
    "description": "Technology alone won’t stop today’s threats. You need the combined power of technology and security expertise to safeguard your organization. With the ability at both the strategic and tactical levels, NOOSC offers a variety of solutions to help your organization achieve its technology goals by understanding the needs and implementing technology strategies that work perfectly with your business. We provide managed security services to help your business with the day-to-day running, maintenance, and support of your security needs on an ongoing basis, also strategic consulting services for a specific pain point or problem, including planning strategically for your future growth. We will help you to ensure that your business survives & thrives in an environment of technology disruption.",
    "createdAt": "2021-01-20T07:16:35.770000Z",
    "updatedAt": "2023-12-13T07:46:13.328000Z"
  },
  {
    "name": "PT InMotion Inovasi Teknologi (InMotion)",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524083/hacktiv8/career/pt-inmotion-inovasi-teknologi-%28inmotion%29-848dw3pwfl9.jpg",
    "location": "Gedung One Pacific Place level 11 SCBD, Jl. Jendral Sudirman Kav 52-53  Kel Senayan Kec Kebayoran Baru Jakarta Selatan",
    "email": "contact@inmotion.co.id",
    "description": "3Dolphins.ai was developed by PT InMotion Inovasi Teknologi (InMotion) to help businesses accelerate their digital customer experience. Built as enterprise, cloud, or on-premise solutions, our approach enables seamless collaboration between technology and people. InMotion (PT. InMotion Inovasi Teknologi) is an Indonesia-based technology company with primarily focus is helping businesses to thrive customer experience using new technologies and customer-facing channels. We served many industries such as Finance, Automotive, Online Travel, Education, Public Sector, and etc.",
    "createdAt": "2019-09-02T07:46:21.125000Z",
    "updatedAt": "2022-11-29T08:34:42.837000Z"
  },
  {
    "name": "PT Solusi Aplikasi Integrasi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524084/hacktiv8/career/pt-solusi-aplikasi-integrasi-jqt7732fhlo.jpg",
    "location": "Jalan Siantar Nomor 18",
    "email": "info@solusiaplikasi.id",
    "description": "SAI as a United Teknologi Integrasi Group which is has more than 20 years of experience in Infrastructure Technology Solution in many sectors industry and SAI is distributor of innovative technology products and solutions. and already help our customer to work using our system digital with automation. With our Digital System and Automation make your work become easier, faster, simplest and accurate. We glad to serve your organization to make your work with our Solution Digital and Automation ahead. If you are interested in joining us, Please apply to the available positions below : Requirements : 1. Minimum bachelor's degree majoring in Computer Science / Information Technology 2. Have 1 years experience in the same field 3. Have expertise in using programming and scripting languages Required Technical Specifications : • Experience using docker compose at least 1 years • Has scripting skills using Pyhton and Bash • Have troubleshooting experience • Have experience using Linux for at least 1 years • Has the ability to use postman to use the API.",
    "createdAt": "2023-06-07T09:26:52.477000Z",
    "updatedAt": "2024-06-05T02:13:19.104000Z"
  },
  {
    "name": "Pt. Sapta Tunas Teknologi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524085/hacktiv8/career/pt.-sapta-tunas-teknologi-7rp0514llru.png",
    "location": "Komplek Perkantoran Agung Sedayu Harco Mangga Dua Blok J no.16",
    "email": "info@saptatunas.com",
    "description": "Sapta Tunas Teknologi is established in 2015 with high passion and commitment for providing Business Technology Solutions and services in Indonesia. Sapta Tunas Teknologi is your source for IT solutions, we focus solely on embracing our client’s hardware, networking, application and technology needs. Helping organizations across all industry to achieve their business goals and objectives by lowering the cost and maximizing the performance of their information technology systems.",
    "createdAt": "2021-06-15T04:52:01.161000Z",
    "updatedAt": "2023-01-05T07:54:07.971000Z"
  },
  {
    "name": "PT. Nawa Data Solutions",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524086/hacktiv8/career/pt.-nawa-data-solutions-ovl5pqurdho.jpg",
    "location": "Jakarta, Indonesia",
    "email": "info@nawadata.com",
    "description": "NawaData was founded by a group of experienced professional in IT and Banking Industry. PT Nawa Data Solutions, the word \"Nawa\" taken from Sanskrit language, it means 9 (nine). Trusted by: Indonesia’s Top 10 Banks (based on Assets), The Largest Bank in South East Asia, Indonesia’s Largest Automotive Financing Company, Other National and Multinational Companies.",
    "createdAt": "2019-05-12T08:24:04.288000Z",
    "updatedAt": "2022-07-06T02:32:27.779000Z"
  },
  {
    "name": "Pt Espresso Italia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524088/hacktiv8/career/pt-espresso-italia-9eded1ejkoa.jpg",
    "location": "Jalan Cideng Timur 50 D-E, Jakarta Pusat 10160, Indonesia",
    "email": "info@espressoitalia.id",
    "description": "Who We Are: One Stop Solution for Coffee and Gelato. Berdiri sejak tahun 2006 oleh Ana Lukman di Jakarta, Indonesia. Kami adalah dealer resmi untuk berbagai merk mesin kopi, mesin gelato, bahan-bahan gelato, serta aksesoris pendukungnya. What We Do? Authorized Dealer (Sales & Services). Temukan top world brands disini, mesin kopi SAECO dan FIAMMA, mesin gelato VALMAR dan NEMOX, blast freezer TECHFROST, showcase gelato ISA, bahan-bahan gelato MONTEBIANCO. Kami siapkan layanan purna jual untuk kepuasan dan keberhasilan bisnis Anda, training mesin, training pembuatan produk, pengembangan menu, after sales service dengan garansi tersedianya spare part hingga kontrak service mesin berkala.",
    "createdAt": "2019-07-17T08:06:30.219000Z",
    "updatedAt": "2024-07-19T10:39:41.174000Z"
  },
  {
    "name": "Pilar Dev Solution",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524089/hacktiv8/career/pilar-dev-solution-bbu29rkafc.jpg",
    "location": "ITS Tower, Jl. Raya Pasar Minggu No. 18, Jakarta, Indonesia 12520",
    "email": "info@pilardev.com",
    "description": "Pilar Dev Solution adalah salah satu jasa pembuatan aplikasi Jakarta terbaik yang bisa menjadi rekomendasi terbaik untuk Anda dalam membuat aplikasi. 1. Java 2. Familiar dengan Google Cloud Platform 3. Latar belakang kuat di Spring Boot dan API Design 4. PostgreSQL 5. OOP 6. Familiar dengan Spring Boot dan ORM Hibernate dalam penggunaan bersama PostgreSQL, Vue.js Composition API 7. Pengalaman dalam membuat user interface yang user friendly 8. Salary : IDR 9 s/d 10 Juta/Bulan 9. Work From Office (Jakarta) 10. Berpengalaman minimal 3 Tahun",
    "createdAt": "2024-07-16T04:21:11.766000Z",
    "updatedAt": "2024-07-16T09:12:09.180000Z"
  },
  {
    "name": "Pt Vanz Inovatif Teknologi (qbit)",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524090/hacktiv8/career/pt-vanz-inovatif-teknologi-%28qbit%29-j8wprjmsm6e.png",
    "location": "Ruko Sentra Niaga Green Lake L7 Jl. Green Lake City Boulevard Cengkareng, DKI Jakarta 11750",
    "email": "info@qbit.co.id",
    "description": "PT. Vanz Inovatif Teknologi was established in July 2017 under the service name of “qbit”, with the aim of providing comprehensive quantum based IT Solution. We develop product and project with unique and creative solutions that meet the clients’ expectations not only by realizing the clients’ business objectives, but also by considering the effective approach in IT solution. Qualifications: · Minimum 1 years experience in Java 8 and above · Familiar with Spring, Hibernate/ORM · Familiar with messaging concept using Kafka or similar application · Familiar with the application of Java OOP, MVC and various implementation Pattern · Familiar with JavaScript development · Familiar with Elastic-Logstash-Kibana and its operation · Experience in using Spring Boot, and Hibernate · Passion for writing clean code with excellent readability · Good communication skill · Excellent team player and able to work individually · Familiar in financial industry is an advantage.",
    "createdAt": "2021-10-25T11:16:19.341000Z",
    "updatedAt": "2021-10-26T09:06:35.287000Z"
  },
  {
    "name": "PT. Bukuku Solusi Kreatif",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524090/hacktiv8/career/pt.-bukuku-solusi-kreatif-659ltm1jjiv.jpg",
    "location": "Komplek Meruya Indah Blok J No.3, Meruya Selatan, Jakarta Barat",
    "email": "hr@bukuku.io",
    "description": "Kami merupakan perusahaan yang menyediakan Aplikasi Laporan Keuangan. Kualifikasi: • Minimal pendidikan D3 atau S1 Jurusan Informatika Komputer • Pengalaman minimal 3 tahun • Menguasai PHP programing language • Menguasai pemrograman Front-end menjadi nilai tambah (HTML, CSS, Javascript, mobile Android dan IOS) • Menguasai Laravel Framework • Mengerti SQL atau MySQL • Mengerti konsep API dan securitynya (Oauth) • Memahami Konsep OOP (Object Oriented Programming) • Mampu bekerjasama dengan tim ataupun Individu • Mampu menyelsakan pekerjaan sesuai deadline • Mau belajar dan Berkembang • Mampu bekerja di bawah tekanan • Fleksibel, dinamis, kreatif dan mudah beradaptasi. Tugas dan Tanggung jawab: • Mengembangkan software desain dan arsitektur yang berkualitas tinggi • Identifikasi, prioritaskan, dan jalankan tugas dalam software development life cycle • Develop tools dan aplikasi dengan menghasilkan code yang bersih dan efisien • Otomatiskan task dengan tools dan skrip yang sesuai • Review dan debug code • Melakukan pengujian validasi dan verifikasi • Berkolaborasi dengan tim internal dan vendor untuk fix dan mengembangkan produk • Mendokumentasikan development phases and monitor systems • Memastikan software yang digunakan merupakan yang terbaru dengan teknologi terupdate. Benefit: • PPh 21 ditanggung perusahaan • BPJS Kesehatan dan Ketenagakerjaan • Pengangkatan karyawan tetap jika memenuhi kriteria dengan masa probation 6 bulan • Asuransi Kesehatan untuk Karyawan Tetap • Hari Kerja: Senin – Jumat. Lokasi: Meruya (Jakarta Barat) - WFO.",
    "createdAt": "2023-05-03T17:12:12.300000Z",
    "updatedAt": "2023-05-04T04:50:28.168000Z"
  },
  {
    "name": "EPL GROUP",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524091/hacktiv8/career/epl-group-w5jjo3o65u.png",
    "location": "Jl. Peternakan II No. 15 (Ruko Nagata Pintu ke-7), Kapuk, Cengkareng. Jakarta Barat",
    "email": "info@eplgroup.com",
    "description": "EPL GROUP Merupakan perusahaan yang bergerak dibidang E-commerce, Trading dan Logistics. We are searching for a talented and passionate Full Stack Developer to join our growing team. In this role, you will be responsible for the entire development lifecycle of our web applications, from front-end design and user experience to back-end development and database management. You will work closely with designers, product managers, and other developers to build robust and scalable software solutions. Job Responsibilities: • Design, develop, and maintain user interfaces and front-end components. • Develop and implement back-end logic using server-side programming languages and frameworks. • Design and manage databases to store and retrieve data efficiently. • Create and maintain secure and well-documented APIs. • Participate in all stages of the software development lifecycle, including requirements gathering, design, development, testing, and deployment. • Collaborate with designers, product managers, and other developers to ensure smooth project execution. • Write clean, maintainable, and well-documented code. • Stay up-to-date with the latest technologies and trends in web development. Job Requirements: • Bachelor's degree in Computer Science, Information Technology, or a related field (or equivalent experience). • 3+ years of experience as a Full Stack Developer, or similar role. • Strong proficiency in front-end technologies such as HTML, CSS, JavaScript, and a front-end framework (e.g., React, Angular, Vue.js). • Strong proficiency in back-end technologies such as a server-side programming language (e.g., Java, Python, Node.js) and a database management system (e.g., MySQL, PostgreSQL). • Experience with API development and integration. • Experience with version control systems (e.g., Git). • Excellent problem-solving and analytical skills. • Strong communication and collaboration skills. • Ability to work independently and as part of a team. • A passion for learning and staying up-to-date with the latest technologies.",
    "createdAt": "2024-01-13T04:09:07.116000Z",
    "updatedAt": "2024-05-07T02:24:50.199000Z"
  },
  {
    "name": "PT Serikat Hantar Ekspedisi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524092/hacktiv8/career/pt-serikat-hantar-ekspedisi-uqz2pnqv4ld.jpg",
    "location": "Jl. Raya Tugu No.15A Rt.7 Rw.9 Tugu Utara . Kecamatan Koja , Kota Jakarta Utara .14260",
    "email": "info@seryucargo.com",
    "description": "The rapid growth of Micro, Small and Medium Enterprises (MSMEs) and e-Commerce has encouraged the development of the logistics industry in Indonesia. This motivated the establishment of SERYU, a pioneer of technology-based cargo company in Indonesia. Utilizing the latest technology, SERYU provides an integrated, reliable and safe cargo system to answer the diverse cargo needs of customers. A number of SERYU's superior services include a real-time cargo tracking system, pick-up/pick-up facilities with same day orders, item drop-off facilities, and exclusive services for corporate customers (B2B). In addition, SERYU always prioritizes customer satisfaction. Utilizing the Whatsapp social media platform, SERYU provides 24/7 customer service. SERYU believes that effective and efficient cargo services can support customer business growth. For this reason, SERYU continues to innovate to provide various superior services for customers.",
    "createdAt": "2021-06-22T09:22:58.738000Z",
    "updatedAt": "2024-02-26T09:16:15.983000Z"
  },
  {
    "name": "PT Sahabat Agro Group",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524093/hacktiv8/career/pt-sahabat-agro-group-5y7i4p340yw.png",
    "location": "Sunter Agung Podomoro Blok N 2, No. 9 - 10, Sunter Jaya, Daerah Khusus Ibukota Jakarta 14350",
    "email": "info@sahabatagro.co.id",
    "description": "Established in 2017, Sahabat Agro Group specialized as a management consultant which affiliate with companies that runs in palm oil plantation and production. Our focus is to bring up the best of fresh fruit bunch quality, fresh fruit bunch processing and creating manpower that align. Vision, is to become a modern and leading agribusiness company in Indonesia that continuously provides optimal economic value and becomes the partner of choice. Mission, is to provide quality agribusiness products and services, to create added value for stakeholders.",
    "createdAt": "2024-05-16T12:14:33.239000Z",
    "updatedAt": "2024-08-09T08:48:03.891000Z"
  },
  {
    "name": "PT. THE MASTER STEEL MFC",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524093/hacktiv8/career/pt.-the-master-steel-mfc-ysxz9pb7jum.jpg",
    "location": "M49 Building, Jalan Hos Cokroaminoto No. 49, Menteng, Gondangdia, Central Jakarta",
    "email": "info@mastersteel.com",
    "description": "Master Steel builds meaningful experiences through content strategy, safety and deployment. PT The Master Steel Mfc was established in 1972 as one of the pioneers in steel-making and rolling in Indonesia. The first steel plant was initially set up as a green-field project on twelve hectares of land in Pulogadung, East Jakarta. As one of the earliest industrial estates, Pulogadung lies in close proximity to the city center as well as to Tanjung Priok port, making it the most strategic industrial area in Jakarta. Our ISO 9001:2008 certified company currently operates four major steel plants with combined capacity of 1.5 million tpa, occupying more than one hundred hectares of land in Jakarta and Gresik (East Java), employing more than five thousand people working around the clock on a three-shift production schedule. We are looking forward to reaching more than two million tpa capacity by 2014 with the on-going modernization and expansion project of the new state-of-the-art 600,000 tpa bar mill, 500,000 tpa wire-rod and bar combi-mill. The Master Steel Company's dedicated and professional team is the main drive to ensure high quality standard of our products. Our production team is committed to exceeding our valued customers expectation.",
    "createdAt": "2022-04-07T05:46:05.505000Z",
    "updatedAt": "2023-11-13T10:43:15.019000Z"
  },
  {
    "name": "MediaWave Interaktif",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524094/hacktiv8/career/mediawave-interaktif-8304598ywss.jpg",
    "location": "Jl. Abdul Majid Raya No.36, RT.10/RW.2, Cipete Sel., Kec. Cilandak, Kota Jakarta Selatan",
    "email": "info@mediawave.id",
    "description": "OUR WORK We attract clients who believe in innovation and creativity are core ingredients for exceptional results. We believe in the power of social media to accelerate business growth for brands. Job Description : • Contribute to the review and analysis of business requirements • Collaborate on architecture and technical design discussions • Document and review detailed design • Implement web technologies in PHP/Laravel platform • Perform and participate in code reviews, peer inspections and technical design/specifications Skills And Qualifications : • Candidate must possess at least Bachelor's Degree in Computer Science/Information Technology or equivalent. • Deep understanding in OOP • Familiar with REST Web Services • Familiar working using Laravel Framework • Familiar working with Bootstrap or Bootstrap-Vue • At least 2 Year(s) of working experience in the related field is required for this position. • Preferably Staff (non-management & non-supervisor) specialized in IT/Computer - Software or equivalent.",
    "createdAt": "2024-06-14T07:45:41.986000Z",
    "updatedAt": "2024-06-14T10:37:35.885000Z"
  },
  {
    "name": "Talenta Hutama Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524095/hacktiv8/career/talenta-hutama-indonesia-xb0a1ty8o8.png",
    "location": "Gedung Treasury Tower 1, Lt.7 Unit F. Jl. Jend. Sudirman Kav 52-53 Kebayoran Baru Jakarta Selatan",
    "email": "info@talenthunts.id",
    "description": "Talent Hunts is an Executive Search Agency that is built by the idealism of its Founder to provide excellent recruitment services to our clients. Started by a Professional Executive Search with more than a decade of experience working in a Multinational Executive Search agency and combine with years of experience on the corporate side, providing multiple perspectives to our clients which will result in a better experience in recruitment. We know it is never been an easy job to find the best talents in the market, but our team's years of experience as well as our approach will surely make the search of talents, will be more efficient and effective. Talent Hunts is one of few Executive search agencies that believe that a combination of people, process, and technology will bring a new experience in recruitment. With its Value of Honesty, Excellent, and Respect we strive not only to be one of the best recruitment agencies in Indonesia but also to build our reputation in the recruitment industry.",
    "createdAt": "2021-11-12T08:16:30.548000Z",
    "updatedAt": "2023-08-21T09:38:00.902000Z"
  },
  {
    "name": "Pt Nomura Research Institute Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524096/hacktiv8/career/pt-nomura-research-institute-indonesia-em79i4fs55p.png",
    "location": "Sahid Sudirman Center Unit F Floor 11, Jl. Jend.Sudirman Kav.86",
    "email": "info@nri.co.id",
    "description": "Nomura Research Institute (NRI) Indonesia is the only stop you need to make for your company's Digital Transformation (DX). Backed by the knowledge, proven track record, and expertise of our parent company, Nomura Research Institute (NRI) Japan, NRI Indonesia strives to solve social issues and contribute to a sustainable future. Nomura Research Institute (NRI) envisions the future of society and business by taking an approach called \"Navigation × Solution.\" NRI acts as the navigation system for our clients to meet their goals while providing them with solutions that address complex business challenges. At NRI, we have always worked to enhance our strengths, providing high-quality, cutting-edge services, and earn the continuous trust of our clients and society. Addressing issues from the standpoint of our clients is at the core of NRI’s corporate DNA.",
    "createdAt": "2021-04-19T05:45:29.554000Z",
    "updatedAt": "2022-08-31T09:20:40.307000Z"
  },
  {
    "name": "EMBLEM OF STRENGTH & COURAGE TECHNOLOGY PTE. LTD",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524097/hacktiv8/career/emblem-of-strength-and-courage-technology-pte.-ltd-b8n88gspefl.png",
    "location": "Address: 68 Circular Road # 02-01 Singapore (049422)",
    "email": "contact@sssper.com",
    "description": "Sapphire Skyscraper (SSSPer) is a growth capital fund focused on the Financial Technology, Big Data, eCommerce, and Gaming sectors, managed by an experienced team with demonstrated sector expertise. Job responsibility : 1. Responsible for the design, development, testing and optimization of back-end services; 2. Provide constructive opinions on system architecture, technology selection and research and development process; 2. Participate in the design and implementation of containerization, Kubernetes and continuous integration and continuous deployment (CI/CD) solutions; 3. Collaborate with team members to promote the implementation of business technical standards; 4. Perform code reviews to ensure code quality. Job Requirement: 1. Bachelor degree or above in computer related major; 2. 3 years or more of Golang development experience, those who have led medium and large projects will be given priority; 3. Proficient in Go language and related technology stacks, and have good programming habits; 4. Familiar with Docker container technology and k8s, and proficient in Kubernetes components such as Pod, Deployment, Service, and Helm; 5. Understand CI/CD workflow and have practical experience; 6. Good basic skills in data.",
    "createdAt": "2023-09-04T05:35:15.995000Z",
    "updatedAt": "2024-05-07T02:31:50.448000Z"
  },
  {
    "name": "Software Seni",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524097/hacktiv8/career/software-seni-ys8xtju1fua.jpg",
    "location": "Jakarta, Indonesia",
    "email": "info@softwareseni.co.id",
    "description": "SoftwareSeni is a Software Development Company based in Yogyakarta & Australia. We love solving tough problems – from user experience to design and code. We build enterprise web-based solutions for clients all over the world, from Australia, Indonesia, Europe, Africa, and America. We are a growing business and need experienced developers to accelerate that growth. SoftwareSeni is nestled in amazing Yogyakarta. It's not just in any Yogyakarta, our office is right in the heart of Yogyakarta within walking distance from the famous Tugu Yogya. You can easily find a great place to dine nearby. We seek people who want to make a difference, be part of a team, and are interested in building a company that’s bigger than the four walls of a building. We are looking for those who embody curiosity, awareness, resoluteness, and empathy – who are flexible, proactive, and driven. You'll work in a small team with very flexible development and will often switch and cover team members, so you will need to understand most of the products.",
    "createdAt": "2017-08-21T08:12:05.012000Z",
    "updatedAt": "2024-05-13T08:23:37.530000Z"
  },
  {
    "name": "BroilerX",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524098/hacktiv8/career/broilerx-f6o5eim5j2p.jpg",
    "location": "Jl. Nologaten No 49A, Sleman, Daerah Istimewa Yogyakarta 55281, Indonesia.",
    "email": "info@broilerx.com",
    "description": "BroilerX, perusahaan yang sedang berkembang dibidang Poultry-tech Company yang berfokus dalam perkembangan industri peternakan Ayam Broiler, Layer dan Karkas yang tersebar hingga 18+ unit secara Nasional. Dengan misi menjadi leading provider yang menjadi solusi dalam end-to-end Poultry Farming Industry serta memberdayakan peternak secara Global. BroilerX is a poultry tech startup offering precision, sustainable, and scalable poultry technology and business to smallholder poultry farmers. By having an extensive poultry farming experience and reliable smart poultry technology, we aim to enhance poultry output and work with the poultry farmers and farming practitioners to understand the challenges they face then tap into smart technology for solutions. We have been working with poultry farmers on a contractual basis since 2020. We provide smart tech services and technical expertise, as well as live birds and feed supplies, while the poultry farmers provide the labor, housing, and utilities to support the birds. This benefits the farmers because it protects the poultry farmer from the risk of changing market prices for poultry and feed ingredients such as corn and soybean meal, which represents most of the cost of raising poultry and helps keeping the price of nutritious poultry affordable for millions of families and the foodservice industry in Indonesia. We proudly work with thousands of independent poultry farmers every day, bringing quality protein from family farms to family tables. Let’s make poultry farming easier, smarter, and profitable for everyone!",
    "createdAt": "2023-02-03T16:35:32.280000Z",
    "updatedAt": "2024-03-20T05:02:59.347000Z"
  },
  {
    "name": "Merdeka Precision",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524099/hacktiv8/career/merdeka-precision-q7mukg0z0v.jpg",
    "location": "185 Jalan Merdeka, Tangerang, Banten 15114, ID",
    "email": "info@merdekaprecision.com",
    "description": "MERDEKA PRECISION which legal entity is PT. BUANA MERDEKA JAYA is an ISO 9001:2015 certified company specialized in manufacturing complex, high precision parts/components. Our goal is to produce high quality product delivered on time and with competitive price to our customers. This position involves you to be responsible with ERP System that runs as operational back bone of the company. Therefore one will be exposed to business process flow of the company such as with manufacturing, sales, purchasing & inventory. One shall be responsible in managing & optimizing the ERP System, working with users from different Divisions related to data input and reporting activities. To be successful in this role, Candidates will need to have: Bachelor / Diploma in Computer Science/ System Information / Computerized Accounting with minimum 3.0 GPA. Have minimum experience 2 years using manufacturing ERP System such as INFOR, EPICOR, BAAN, SAP, MICROSOFT DYNAMICS. Must be able to operate Excel and Power Point. SQL and Reporting Tools (Crystal Report, Active Report, etc) is a plus. Willing to work on-site on week days and Saturday (half-day). Preferably live at Tangerang. Candidate's responsibilities: Learn existing ERP System and able to manage, optimize and synchronize with actual condition. Provide solution to users’ issues related to ERP System data input and reporting; if necessary consult to the ERP System consultant. Conduct trial runs and simulation of new modules/features of current ERP System and present them to management. Create Work Instructions or SOP to guide end users. Maintain server and PCs of users. Benefits joining us: Work in small & collaborative environment. Opportunity to learn & gain new skills beyond primary responsibilities. Performing employee will get noticed faster by Top Management.",
    "createdAt": "2024-07-16T03:13:04.407000Z",
    "updatedAt": "2024-07-16T07:58:41.123000Z"
  },
  {
    "name": "PT Ebliethos Digital Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524099/hacktiv8/career/pt-ebliethos-digital-indonesia-3ik0y4xg06u.png",
    "location": "Condongcatur, Depok, Sleman, Yogyakarta",
    "email": "info@ebliethosdigitalindonesia.com",
    "description": "PT Ebliethos Digital Indonesia adalah sebuah perusahaan yang bergerak di bidang digital marketing yang saat ini sedang bertumbuh sangat pesat. Perusahaan digital marketing yang mengedepankan pertumbuhan team, bergerak secara dinamis dan dipenuhi dengan happiness, loving, creative serta mengedepankan spiritualitas.",
    "createdAt": "2022-08-15T01:56:50.810000Z",
    "updatedAt": "2023-01-09T02:00:58.297000Z"
  },
  {
    "name": "PT Qtera Mandiri",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524100/hacktiv8/career/pt-qtera-mandiri-uihtlhrsopl.png",
    "location": "Area Perkantoran Rukan Villa Gading Indah Blok A1 no.1 Jl. Boulevard Bukit Gading Raya, Kelapa Gading",
    "email": "info@qteramandiri.id",
    "description": "Kami, PT QTERA MANDIRI merupakan distributor untuk beberapa produk IT dengan brand ternama dari Eropa dan USA. Customer kami terdiri dari berbagai macam sektor industri, diantaranya Pemerintahan, BUMN, BUMD dan perusahaan swasta ternama dari berbagai macam industri, baik skala nasional maupun multi-nasional. PENGUMUMAN: PT Qtera Mandiri tidak pernah memungut biaya apapun dalam proses rekrutmen dan seleksi. PT Qtera Mandiri tidak pernah bekerja sama dengan travel agent / biro perjalanan manapun dalam proses rekrutmen. Apabila Anda diminta untuk membayar sejumlah uang dalam bentuk pembayaran tiket pesawat dan hotel atau akomodasi lainnya segera abaikan dan laporkan pada Kami. Jangan memberikan data pribadi atau data keuangan Anda kepada siapapun. Jika Anda membutuhkan klarifikasi lebih lanjut, silakan langsung menghubungi PT Qtera Mandiri.",
    "createdAt": "2018-07-17T09:18:59.844000Z",
    "updatedAt": "2023-08-11T03:41:14.062000Z"
  },
  {
    "name": "Sekolah Pelita Harapan",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524101/hacktiv8/career/sekolah-pelita-harapan-0gp95ypfohw.png",
    "location": "Jl. Boulevard Palem Raya No.2500, Klp. Dua, Kec. Klp. Dua, Kabupaten Tangerang, Banten 15810",
    "email": "info@sph.edu",
    "description": "Sekolah Pelita Harapan is a group of five International Christian schools located in the heart of Indonesia - the city of Jakarta. From a visionary beginning in 1993, Sekolah Pelita Harapan schools continue to develop as Indonesia's leading Christian schools with a focus on academic excellence, personal growth, and spiritual development. Our vision of True Knowledge, Faith in Christ, and Godly Character defines our goals for students: that they may come to understand that all truth emanates from God the Creator and Sustainer and is to be found ultimately in a relationship with Jesus Christ His Son, and our Saviour. The end result of accepting and living out these truths is the development of godly character as those made in the image of God. We aim to achieve this goal by focusing on Christ as the preeminent One in God's plan of redemption in the world, believing that He calls us to engage with Him in the world's restoration from its brokenness. We want our students to be people of influence and action in the world, well-equipped to engage positively wherever they may serve. We are grounded in an Evangelical, Reformed theology that seeks truth wherever it may be found and recognizes that all truth is God's. Using the International Baccalaureate and Cambridge programs allows us to develop mature, thoughtful students who are committed to life-long learning and who utilize inquiry to search for the truth.",
    "createdAt": "2024-01-11T04:08:57.692000Z",
    "updatedAt": "2024-01-11T08:23:29.799000Z"
  },
  {
    "name": "PT Diraya Mahala Adhikari",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524103/hacktiv8/career/pt-diraya-mahala-adhikari-01rfgxbtgkt6.jpg",
    "location": "Jalan Raya Gandul No 12B, Cinere, Depok 16512",
    "email": "info@mahalagroup.co.id",
    "description": "Welcome to Diraya Mahala Adhikari ~Virtuous Consulting, Divine Solutions ~ Our client is currently looking for an experienced Software Engineer to join the engineering team. You will be responsible for designing and building high-performance applications, as well as maintaining and optimizing working software by working together with peers in dynamic team from its inception to its production phase. What You Will Do: Responsible for developing applications for the company, with proficiency in SQL, RUST and ZIG. Contribute to the full lifecycle of system construction, including requirement analysis, architectural discussions, roadmap planning, solution design, and iterative system optimization. Provide insights that influence the direction of our projects and technology choices. What You Will Need: Bachelor's degree or above in Computer Science or a related major. Have the ability to learn business processes from existing and future applications, design Software Architecture, and create application documentation (C4 Model, BPMN, user story). Understand the concept of desktop applications, web applications, mobile applications, Inter Process Communication, both REST-API and GRPC, Monolithic and Microservices software architecture, Function As A Service and other Cloud Application technologies, virtualization, containerization and web assembly (wasi/wasm), native application development and cross platform application development. Understand the concept of Software Development Life Cycle, Software Testing, CI/CD, TCP/IP family protocol, Data Compression and Encryption, relational database and graph database. Mastering SQL. Familiar with PRQL, Malloy. Have the ability to read Source Code: Visual Basic dot net 2008, Python, Java for Mobile Application. Capable of learning new languages, frameworks, concepts in the world of Software Engineering. Able to develop applications with one of the following Programming Languages: RUST, ZIG. Good communication skills and teamwork spirit, and be able to collaborate effectively with other developers or stakeholders. Willing to be placed in Surakarta – Central Java during the system development process. Remote working will be possible after the system is implemented.",
    "createdAt": "2024-03-05T04:47:33.982000Z",
    "updatedAt": "2024-05-07T02:30:48.860000Z"
  },
  {
    "name": "PT. Media Digitech Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524103/hacktiv8/career/pt.-media-digitech-indonesia-udinjxcvh28.png",
    "location": "Jakarta, Indonesia",
    "email": "info@mediatechindo.com",
    "description": "Mediatechindo born in 2010 on the inspiration and need. To give one of your companion in the answer of Information Technology, mediatechindo can serve you who have focus problems Website Development, Software Development, Mobile Development, Online Marketing, Web design and further with our services. In the middle proliferation of IT development which includes software development and website development but, mediatechindo a difference from the company’s existing software. Provide consultative advice but also creates an applicable solution for your needs. Many of our partners and clients from around the world who have passed the problem along with us so that they can smile and be a winner we would like to see a more complete portfolio.",
    "createdAt": "2022-08-05T11:17:58.312000Z",
    "updatedAt": "2022-08-08T03:10:06.366000Z"
  },
  {
    "name": "CV. SEGITIGA SAMA SISI",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524104/hacktiv8/career/cv.-segitiga-sama-sisi-lwk541yreb.jpg",
    "location": "Gg. Melati 1 No.419A, Kayen, Condongcatur, Kec. Depok, Kabupaten Sleman, Daerah Istimewa Yogyakarta 55281",
    "email": "info@sesasi.id",
    "description": "CV Segitiga Sama Sisi adalah Perusahaan IT yang siap memberikan solusi teknologi terbaik untuk kebutuhan bisnis Anda. Kami menawarkan berbagai layanan, mulai dari pengembangan perangkat lunak, jaringan komputer, hingga manajemen keamanan dan infrastruktur IT. Kami memiliki tim ahli yang berpengalaman di bidang IT dan siap membantu Anda untuk mengoptimalkan sistem teknologi yang ada di perusahaan Anda. Selain itu, kami juga dapat membantu Anda untuk mengembangkan perangkat lunak khusus yang dirancang sesuai dengan kebutuhan bisnis Anda. Menjadi Harmoni Masa Depan Digital menjadi motto kami kami percaya culture yang kami terapkan mengandung unsur-unsur : 1. Fun 2. Kreatif 3. Solutif 4. Inspiratif",
    "createdAt": "2023-10-05T04:22:25.466000Z",
    "updatedAt": "2024-06-04T07:18:58.207000Z"
  },
  {
    "name": "PT Tricada Intronik",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524105/hacktiv8/career/pt-tricada-intronik-fipo4elzxrm.jpg",
    "location": "Jakarta, Indonesia",
    "email": "hr@tritronik.com",
    "description": "Tritronik bases all it's innovation and business efforts on a belief that Tritronik exists to contribute to the well-being of our customers, suppliers, employees, shareholders, society, and the environment. In everything we do, we seek to transform our self, our business, and our society for a better tomorrow. It's casual. It's flexible. It's fun. It has so many benefits!",
    "createdAt": "2018-10-17T10:40:07.194000Z",
    "updatedAt": "2023-04-26T03:06:17.464000Z"
  },
  {
    "name": "PT. Insan Daya Teknologi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524106/hacktiv8/career/pt.-insan-daya-teknologi-euel2rxqq15.jpg",
    "location": "Jl. Teluk Betung No.45E\nDKI Jakarta - Jakarta Pusat\nIndonesia, 10310",
    "email": "info@indatek.id",
    "description": "Pioneering innovation and client-centric solutions for global impact, fostering continuous growth and adaptability. a. Job Descriptions: i. Melakukan tugas tech-engineering untuk mendukung tim teknis dalam mencapai tujuan bisnis perusahaan ii. Memimpin, mengelola dan melatih tim teknis dalam pengembangan sistem iii. Membuat desain sistem untuk meningkatkan efficiency, availability, scalability, flexibility, functionality dan usability dari produk perusahaan iv. Memiliki pemahaman yang mendalam tentang arsitektur perangkat lunak, sistem operasi, dan jaringan v. Bekerja sama dengan tim teknis untuk menetapkan tolok ukur, standarisasi, teknikal, dan mekanisme lain untuk persyaratan non-fungsional vi. Bekerja sama dengan pengguna dan pemangku kepentingan untuk memahami kebutuhan bisnis vii. Menciptakan alat dan sumber daya yang membantu tim bekerja secara lebih efisien dan efektif b. Requirements i. Lulusan S1 atau setingkat dari semua jurusan dengan minimal IPK 3.00 ii. Pengalaman minimal 1-2 tahun sebagai System Analyst atau di bidang terkait dengan pengalaman minimal 2 tahun sebelumnya sebagai software developer/engineer/programmer iii. Harus mempunyai pengalaman sebagai System Analyst di Perusahaan Multifinance iv. Mahir dalam: Planning, Architecting, Designing, Estimating, dan Executing untuk membuat pengembangan perangkat lunak terdeliver dengan baik kepada Customer v. Mampu memimpin tim, membimbing anggota tim, dan memastikan pekerjaan diselesaikan dengan baik sesuai dengan kebutuhan bisnis vi. Mampu berkomunikasi dengan jelas, tepat sasaran dan efektif baik secara lisan maupun tulisan vii. Memiliki pengetahuan yang mendalam tentang teknologi informasi, pengembangan perangkat lunak, dan kerangka kerja terdistribusi serta memiliki antusiasme dalam perkembangan teknologi terbarukan viii. Mampu untuk menemukan dan memperbaiki masalah teknis dalam lingkungan yang sangat adaptif ix. Memahami GIT, CI-CD, teknologi virtualisasi dan containerisasi serta mampu menggunakan tools untuk Issue Tracking x. Memahami Agile Mindset dan Scrum Framework.",
    "createdAt": "2024-05-30T04:50:15.739000Z",
    "updatedAt": "2024-05-30T07:15:29.976000Z"
  },
  {
    "name": "PT Kwadran Lima Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524107/hacktiv8/career/pt-kwadran-lima-indonesia-2cbh2hxzeha.png",
    "location": "BSD Green Office Park 1, 6th Floor, BSD City, Tangerang, Banten 15345, ID",
    "email": "info@kwad5.com",
    "description": "We are Information Technology Consulting Firm which provides Technology, Business, IT Support and Operation consultation cervices. Strengthened by IT Practitioners whose expertise In implementing IT solution from small and large enterprises client. Pendidikan minimum: D3 jurusan Ilmu Komputer atau Teknologi Informasi. Menguasai dasar programming dan algoritma. Menguasai pemrograman Golang. Memiliki kemampuan programming dan manipulasi data. Pengalaman minimum 2 tahun sebagai tim Development.",
    "createdAt": "2023-02-03T02:36:05.380000Z",
    "updatedAt": "2023-02-03T04:07:25.672000Z"
  },
  {
    "name": "Pt Ada Ide Langsung Jalan",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524107/hacktiv8/career/pt-ada-ide-langsung-jalan-ix4l0tnhxsq.jpg",
    "location": "Jakarta, Indonesia",
    "email": "info@smartlink.id",
    "description": "PT ada ide langsung jalan adalah perusahaan startup yang bergerak di bidang perdagang dan penyedia aplikasi laundry berbasis Android. Kualifikasi: Berpengalaman sebagai Flutter Developer minimal 1 tahun, Memiliki pemahaman tentang API, GRPC, GraphQL, Berpengalaman membuat kode program dengan format yang benar, rapi mengikuti standar dan jelas, Familiar dengan tools desain dan prototipe Figma, Berpengalaman mendeploy aplikasi ke production menggunakan proses CI/CD, Memiliki pengalaman menggunakan state management (Bloc, Getx).",
    "createdAt": "2021-02-04T06:30:14.332000Z",
    "updatedAt": "2023-06-27T10:46:08.261000Z"
  },
  {
    "name": "PT. Aigen Global Teknologi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524108/hacktiv8/career/pt.-aigen-global-teknologi-ks0vta3xjfd.png",
    "location": "Jln Raya Rawa Buntu No 18D Serpong,\nTangerang Selatan 15318,\nIndonesia",
    "email": "info@aigen-global.com",
    "description": "PT. Aigen Global Teknologi is an IT Consultant / IT Solution services company. We are seeking a talented and dedicated Backend Developer to join our growing team. As a Backend Developer, you will play a key role in designing, developing, and maintaining the server-side components of our applications. If you have a bachelor's degree and expertise in Java Spring Boot or Java, we invite you to apply for this exciting opportunity to contribute to our innovative projects. Responsibilities include collaborating with cross-functional teams to gather and analyze requirements, designing and developing scalable, high-performance backend systems, writing clean, efficient, and maintainable code, implementing RESTful APIs and web services, optimizing backend applications for speed and efficiency, troubleshooting and resolving backend issues, ensuring the security and integrity of data, staying up-to-date with the latest backend development trends and best practices, and participating in code reviews to maintain code quality. Qualifications for this role include a bachelor's degree in a related field, strong proficiency in Java Spring Boot or Java, experience with server-side development and backend frameworks, familiarity with RESTful API design and implementation, a solid understanding of databases and SQL, strong problem-solving and debugging skills, the ability to work both independently and in a team, and excellent communication and teamwork skills.",
    "createdAt": "2023-08-24T03:31:30.031000Z",
    "updatedAt": "2024-05-07T02:24:50.672000Z"
  },
  {
    "name": "Kitameraki",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524109/hacktiv8/career/kitameraki-z68posuti5k.jpg",
    "location": "Equity Tower 37th Floor Sudirman Central Busines District Lot 9, Jl. Jend. Sudirman No.Kav.52-53, Jakarta 12190",
    "email": "info@kitameraki.com",
    "description": "Kitameraki adalah perusahaan konsultan Teknologi & Operasi untuk perusahaan-perusahaan di seluruh Asia Tenggara. Kami memberikan konsultasi kepada manajemen senior tentang cara memanfaatkan Teknologi untuk meningkatkan pendapatan dan menciptakan efisiensi operasional. You are a Front-End/Back-End Developer who is looking for exciting challenges, this position may interest you! To support our ambitious growth and strengthen our technology team in Indonesia, we are looking for talented Front-End/Back-End Developer: 2-5 years experiences with 10+ web & mobile app development projects (Mandatory). Experts in several technology stacks: .NET, RESTful API framework, Kotlin, Swift, Flutter or other JavaScript Frameworks / Libraries, JavaScript, NodeJS, React, Angular, … Knowledge in Microsoft Graph API, Azure Functions, Cosmos DB is a strong plus. Familiar with GitHub and CI/CD tools. Graduate bachelor in Computer Science or diploma. Experience in using cloud services such as: Azure, AWS, ... Experience in using API Gateway such as: Kong, Able to implement GitHub and CI/CD tools. Knowledge in system architecture. Strong interest in technology and software development. Good communication skill. Good command of English. Our Technology Professionals are the technology expert during our customer engagements and development of our own products, and as a Senior Professionals you will be the company technology referent and coach the Software Development Teams. Beyond your current technology skill & knowledge, we are looking for talented people, who share the company's spirit, are passionate about what they are doing, curious, eager to learn new things and can work with little supervision. As a Frontend/Backend developer, you will be involved in various customer project engagement and product development requiring both analysis and IT development skills.",
    "createdAt": "2024-06-27T04:30:02.263000Z",
    "updatedAt": "2024-06-27T09:34:28.364000Z"
  },
  {
    "name": "PT. Quantic Inovasi Teknologi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524109/hacktiv8/career/pt.-quantic-inovasi-teknologi-cu1075rknde.jpg",
    "location": "Jl. Warung Buncit Raya No. 168, Mampang Prapatan, RT.10/RW.2, Duren Tiga, Kec. Pancoran, Kota Jakarta Selatan,  12790, Indonesia",
    "email": "info@quantyc.ai",
    "description": "Quantic is an Information Technology service and product company based in Jakarta, Indonesia and Mumbai, India, founded in 2017. Quantyc.ai is a Software and IT Consultancy provider with offices in Mumbai and Jakarta. We provide Analytics, Predictive and Data-backed decision support solutions and services across multiple industries.",
    "createdAt": "2023-02-28T08:38:31.248000Z",
    "updatedAt": "2023-08-15T13:04:12.962000Z"
  },
  {
    "name": "Pertiwi Bisma 1 Ubud",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524123/hacktiv8/career/pertiwi-bisma-1-ubud-4ng5nxqyuze.jpg",
    "location": "Jl. Bisma, Ubud, Kec. Gianyar, Kabupaten Gianyar, Bali",
    "email": "info@pertiwibisma1ubud.com",
    "description": "Stunning Resort Requriments are : Having Minimum 1years’ experience. Good attitude, plesant personality. Able to join immediatly. Domicilied in Bali.",
    "createdAt": "2024-07-16T02:53:40.360000Z",
    "updatedAt": "2024-07-16T03:41:08.735000Z"
  },
  {
    "name": "PT Formulatrix Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524124/hacktiv8/career/pt-formulatrix-indonesia-rchjzwnv4qi.jpg",
    "location": "Jakarta, Indonesia",
    "email": "contact@formulatrix.com",
    "description": "Formulatrix is committed to providing the life science community with the most innovative robotic automation equipment and software on the market. Our team doesn't simply upgrade the systems everyone else is making - we reinvent the technology, producing the smartest, fastest, and most efficient imagers and liquid handlers available. Since its inception in 2002, Formulatrix has grown from a one-person enterprise with a single product into an international company with a line of imagers, software, and liquid handlers that all fifteen of the top pharmaceutical companies use in their research. We continue to expand our reach into new markets with products like the Tempest, a high-throughput dispenser with many applications to a broad range of industries. We think that developing top-notch laboratory equipment is congruent with having fun! At Formulatrix we have a casual dress code, an open-door environment, and even grill-outs every Friday of the summer. We think a positive attitude goes a long way to meet project deadlines and deliver quality support. Most of all, we aim to convert our customers into loyal clients through the quality of our products and customer service. Our imagers run nightly diagnostics and send us summary emails every morning, alerting us when equipment needs maintenance before the user is even aware of an issue. We believe that if we make excellent products that outstrip the competition and commit to full product support, we will continue to expand our influence as a world leader in protein crystallization and liquid handling. Formulatrix was established in 2002 to provide protein crystallization automation solutions. Since then, we've started developing the next generation of liquid handlers using microfluidic technology. Headquartered in Waltham, Massachusetts, we supply software and robotic automation solutions to leading pharmaceutical companies and academic research institutions around the world. Our team works tirelessly to provide the best products in the industry with support that is second to none. Our business operations are international in scope with customers located in North America, Europe, the Middle East, and Asia. Our corporate culture highly rewards dedicated motivation, exceeding client expectations, entrepreneurial spirit, and \"outside the box\" thinking. In return, we offer a rewarding salary and benefits package, young and vibrant \"down to earth\" corporate culture, employee empowerment, and excellent growth opportunities.",
    "createdAt": "2019-08-28T18:30:15.759000Z",
    "updatedAt": "2023-02-23T05:06:50.460000Z"
  },
  {
    "name": "PT Perkom Indah Murni",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524125/hacktiv8/career/pt-perkom-indah-murni-ccc58p7upft.jpg",
    "location": "Midplaza 2, Jl. Jenderal Sudirman Kav. 10 No.11 21st Floor, Karet Tengsin, Kecamatan Tanah Abang, Jakarta, Daerah Khusus Ibukota Jakarta 10220",
    "email": "info@perkom.co.id",
    "description": "PT Perkom Indah Murni is one of the Strategic Business units of MidPlaza and a major shareholder of BIZNET Networks – Indonesia's leading Network Provider. Responsible for the operational function of Fiber optic networks (DWDM Technology). Implementation (Maintenance, activation, provisioning, troubleshoot). Making operational reports on the operation & performance of optical networks and DWDM Networks. Performing an initial analysis of the condition of optical network performance and DWDM. Analysis and evaluation of the overall work system. Know and be able to read the DWDM networks topology plan. Familiar DC Electrical system. Requirements: S1 majoring in electrical, Telecommunication, IT. Understanding the concept and implementation of networks. Good communication Skill. CCNA Certification.",
    "createdAt": "2024-07-24T03:45:03.800000Z",
    "updatedAt": "2024-07-24T10:35:59.410000Z"
  },
  {
    "name": "PT. Barrans Global Mandiri",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524136/hacktiv8/career/pt.-barrans-global-mandiri-e7zp6ld3sc7.png",
    "location": "M-SQUARE Ruko Blok C No.23 Jl. Cibaduyut No.142 Bandung",
    "email": "info@barransglobalmandiri.com",
    "description": "Barrans is an IT Service Company solution for your IT needs.",
    "createdAt": "2021-01-13T09:05:35.608000Z",
    "updatedAt": "2022-02-02T02:45:00.487000Z"
  },
  {
    "name": "Ogya Tekno Nusantara",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524145/hacktiv8/career/ogya-tekno-nusantara-qjxsckql8we.jpg",
    "location": "office tower 88\njl. casablanca kav.88 \njakarta 12870\nindonesia",
    "email": "info@ogya.co.id",
    "description": "Delivering IT Solution in Indonesia, OGYA has been known to be one name that symbolizes innovation. We never stop innovating to deliver end-to-end IT Solution from Custom Application and Software Design and Development, Business Integration Solution, Project Life Cycle Management, up to Training and Post-Implementation Supports.",
    "createdAt": "2019-02-08T02:49:14.169000Z",
    "updatedAt": "2024-06-13T08:33:58.755000Z"
  },
  {
    "name": "Pt. Aldmic Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524165/hacktiv8/career/pt.-aldmic-indonesia-faxfa4bysef.jpg",
    "location": "Jakarta, Indonesia",
    "email": "info@floweradvisor.co.id",
    "description": "1. Overseas platform (Pay'sGift) service operation / development (no customer service). 2. Improvement of mobile coupon issuance platform (development of API and improvement of internal logic such as issuance, dispatch, cancellation). 3. Developed tasks to issue and send coupons by providing or calling APIs to overseas sales channels and brands. 4. Developing tasks to synchronise products to be provided to sales channels through APIs provided by overseas brands. 5. Developing and improving the admin page. 6. Develop and improve coupon verification pages, etc. Qualifications: 1. Understanding of Java asynchronous processing and Lambda. 2. Understanding of Multi Thread in Vert.x asynchronous framework. 3. Able to develop considering DB integrity and contention occurrence in asynchronous processing. 4. Able to write SQL queries and utilise mybatis. 5. Those who have no disqualifications for travelling abroad. Development Environment: Java, Vert.x, AWS EC2, Spring Boot, Spring, Oracle, Jquery, javaScript.",
    "createdAt": "2018-06-19T10:13:04.058000Z",
    "updatedAt": "2023-08-10T09:37:26.471000Z"
  },
  {
    "name": "FlexiDev Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524167/hacktiv8/career/flexidev-indonesia-qvyjv8l2kun.png",
    "location": "Jakarta, Indonesia",
    "email": "info@flexidev.co",
    "description": "FlexiDev is a global IT Consultant company. We provide Smart Solutions to solve our Client’s business problem through our vision as a global force in smart software solution. To assist our client’s need, we utilized our primary team, The General Project Division (SDaaS and GPS) and The Specialized Product Division (FlexiDev Product). By being a Learning Organization that keeps up with the technology trends and the market needs, where Smart People collaborate to Provide Smart Solution. We listen to our clients, and we tried to understand what they need.",
    "createdAt": "2019-08-08T04:44:42.847000Z",
    "updatedAt": "2024-03-22T02:33:57.344000Z"
  },
  {
    "name": "Ikonsultan Inovatama",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524171/hacktiv8/career/ikonsultan-inovatama-v2hoxxhgq19.jpg",
    "location": "PT. iKonsultan Inovatama\nGedung Plaza Oleos\n5th Floor Unit B-C \nJl T.B. Simatupang No. 53A \nJakarta 12520\nTel (+62 21) 2985 7330",
    "email": "info@ikonsultan.com",
    "description": "For more than two decades, PT Ikonsultan Inovatama (IKON) has been trusted by many local and global leading companies to help them reach their business goals. This continuous partnership is proof of IKON’s competency and capability. Since 2002, IKON has built a strong reputation through its consultants by their experience and knowledge in the financial industry, project management, and information technology. Banks, insurance, and financing companies have become IKON’s clients. However, due to the rapid development of information technology in Indonesia, IKON is extending the services to other fields like telecommunication, construction, and engineering, oil, and gas, and also retail. With the vision of empowering people through humanized technology to make better Indonesia, and supported by professional teams, IKON has committed to help clients to achieve their vision and objectives.",
    "createdAt": "2021-03-08T05:19:37.548000Z",
    "updatedAt": "2024-07-23T03:16:33.956000Z"
  },
  {
    "name": "PT SCBD (Arthaskyline)",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524173/hacktiv8/career/pt-scbd-%28arthaskyline%29-kvq27jqeivq.png",
    "location": "Office : The Mansion Bougenville 35, Jakarta Pusat \nCabang : Jl. S. Parman 97, Medan - Sumatera Utara",
    "email": "info@ptscbd.com",
    "description": "PT.SCBD | PT. Shankara Cabot Bajra Danapati dikenal dengan brand Artha Skyline berdiri sejak tahun 2008 adalah perusahaan Sistem Integrator yang mengkhususkan diri dalam mengintegrasikan berbagai komponen dengan sistem ekosistem teknologi untuk mengoptimalkan proses bisnis dalam meningkatkan kinerja dan produktivitas secara keseluruhan untuk menghadapi era digitalisasi 5.0.",
    "createdAt": "2024-06-08T22:23:33.080000Z",
    "updatedAt": "2024-06-10T08:29:49.191000Z"
  },
  {
    "name": "PT Imecon Tekindo",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524176/hacktiv8/career/pt-imecon-tekindo-l3igkpl7jpa.png",
    "location": "Gandaria 8 Office Tower 2nd Floor. Jl Sultan Iskandar Muda- Kebayoran Lama Jakarta 12240",
    "email": "info@imeconteknindo.com",
    "description": "PT IMECON TEKNINDO adalah perusahaan Indonesia yang bergerak di bidang jasa Sumber Daya Manusia. Berdiri sejak tahun 1999 yang didirikan oleh para praktisi dan profesional di bidangnya memiliki pelayanan yang mencakup Jasa Perekrutan tenaga kerja, Jasa Pengelolaan Tenaga kerja Kontrak (Outsourcing), Jasa Psikotes & Assesmen dan Jasa penghitungan upah & Pajak dan Kontrak. Pengalaman selama lebih dari 2 dekade dalam persaingan yang bertambah ketat membuat kami terus berbenah sehingga bisa bertahan dan bahkan bertumbuh, dan pengalaman ini membuat kami semakin memahami arti daripada pentingnya sebuah pelayanan. Escort overall implementation of existing Odoo modules and assist users in transitioning to Odoo across our office branches. Design and develop improvements/customization on Odoo modules based on inputs from users. Analyze, diagnose, and resolve errors or bugs. Integrate multiple data sources, databases, and middleware into the company's Odoo system. Actively suggest and implement solutions to improve and streamline overall workflow processes.",
    "createdAt": "2022-11-07T09:23:13.775000Z",
    "updatedAt": "2023-06-06T02:10:33.325000Z"
  },
  {
    "name": "PT Prima Vista Solusi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524186/hacktiv8/career/pt-prima-vista-solusi-9pu90zc1rn.png",
    "location": "International Financial Center, Tower 2, 16th Floor, Jl. Jenderal Sudirman Kav. 22-23, Jakarta Selatan",
    "email": "info@primavista-solusi.com",
    "description": "Primavista is a distributor and provider of end-to-end payment solutions founded in 2002. Primavista focuses on providing payment systems for “card present” systems such as edc terminals and “not card present” such as internet payments and mobile payments. Due to its comprehensive portfolio of products and services, its unique position as a leading technology company and financial institution and its truly international corporate structure, PrimaVista is uniquely positioned to support partners in its group payments initiatives and is confident that it will fully meet partner requirements. PrimaVista's unique selling proposition includes: Extensive portfolio of international and domestic payment schemes, Multi-channel payment acceptance capabilities (POS, e-commerce, NFC, etc.), Issuance of prepaid Apps and mobile wallets, Global network of financial institution partnerships and acquiring banks, A variety of unique risk management and fraud protection services, Comprehensive financial services based on own banking license, Unmatched level of customer service and system availability, A comprehensive range of integrated consulting and services, Staff with extensive experience in the telecommunications, retail, travel and finance industries and familiarity with financial processes and the specific challenges faced, based on practical experience in the realization of similar projects.",
    "createdAt": "2022-06-29T05:10:50.668000Z",
    "updatedAt": "2023-07-12T08:29:24.504000Z"
  },
  {
    "name": "PT Astronacci International",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524197/hacktiv8/career/pt-astronacci-international-y2d8ovwuqb.jpg",
    "location": "Astronacci Mansion, Jl. Arteri Klp. Gading E1/9, RT.5/RW.2, Pegangsaan Dua, Kelapa Gading, North Jakarta City, Jakarta 14250",
    "email": "info@astronacci.com",
    "description": "Astronacci adalah metode analisis saham, komoditas, mata uang, dan instrument keuangan lainnya yang menggabungkan ilmu Financial Astrology dan Fibonacci untuk menemukan peta perjalanan harga di masa depan dan tanggal naik turunnya harga sebelum terjadi. Pada era \"The Next Generation\", Astronacci melahirkan pendekatan 4 dimensi yang dimulai dari Macro economy Analysis, Fundamental analysis, Technical analysis hingga Time forecast. Keempat pendekatan ini disatukan dan membuahkan informasi penting apa & mengapa kita memilih sebuah financial asset. Dengan akurasi hingga 75% Astronacci dapat meningkatkan keberhasilan trading anda secara eksponensial. Metode Astronacci mempercayai bahwa WAKTU adalah elemen terkuat yang harus diperhatikan dan diketahui dalam menentukan pergerakan pasar. Untuk mengetahui WAKTU yang tepat untuk membeli dan menjual sangatlah mungkin untuk saat ini.",
    "createdAt": "2016-02-22T07:42:14.080000Z",
    "updatedAt": "2023-01-03T04:46:51.112000Z"
  },
  {
    "name": "AdIns (Advance Innovations) - PT. Adicipta Inovasi Teknologi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524201/hacktiv8/career/adins-%28advance-innovations%29-pt.-adicipta-inovasi-teknologi-5ikahslhn6u.png",
    "location": "Jl. Raya Kb. Jeruk No.80, RT.7/RW.1, Kb. Jeruk, Kec. Kb. Jeruk, Kota Jakarta Barat, Daerah Khusus Ibukota Jakarta 11530",
    "email": "info@ad-ins.com",
    "description": "PT Adicipta Inovasi Teknologi (AdIns) is a dynamic, thriving organization with the mission to deliver business solutions through the innovative integration of proven technologies with creativity. The company's vision is to become a leading provider of IT solutions in the regional market. AdIns was established in April 2000 with a sound vision and commitment to deliver the suitable and innovative solutions to increase the customer competitive advantage. The best solution to our client will never be achieved without close long term relationship partners. Our strategic partners include Microsoft, IBM, HP, Oracle, SUN Microsystem, Kofax, Matel, Blackberry and some local partners. Our team members are well trained, self-motivated and result-driven professionals, responsive to client needs amidst the ever-changing information field. We use the latest and affordable technology available in the market to support our client needs.",
    "createdAt": "2016-11-29T03:48:26.580000Z",
    "updatedAt": "2024-02-05T01:44:45.241000Z"
  },
  {
    "name": "Pt First Wap International",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524214/hacktiv8/career/pt-first-wap-international-bjpj0a4axnb.jpg",
    "location": "Millennium Centennial Center, Jl. Jenderal Sudirman No.Kav 25, RT.10/RW.1, Kuningan, Karet Kuningan, Kecamatan Setiabudi, Kota Jakarta Selatan, Daerah Khusus Ibukota Jakarta 12920",
    "email": "info@1rstwap.com",
    "description": "PT FIRST WAP INTERNATIONAL (brand name 1rstWAP) provides advanced mobile messaging, location based solutions and other services to mobile operators, the enterprise market and government institutions around the world. DUTIES AND RESPONSIBILITIES: Implement computer software systems using Java code following software requirements specification as set up by the Development Department Manager or direct supervisor, this includes: ◦ Research the technology used for the implementation ◦ Analyse the specifications for the implementation ◦ Estimate production time for the implementation ◦ Design of the code implementation ◦ Write unit tests for the implementation ◦ Write the (Java) code, following 1rstWAP's coding guidelines ◦ Maintaining proper documentation of the code Set up and maintain system (code) performance tests and execute code refactoring for existing code Perform thorough code reviews of other programmers Testing the implementation in a local environment, also checking logs and the user interface for flaws If needed, participate in internal meetings, workshops and presentations If needed, participate in meetings with partners and clients Ensuring the integrity of the workplace (no downloads, no private code or data, etc.) Providing trainings of department personnel and others on IT development issues related to his development scope and/or technical skills. If needed, provide technical support for installations done at the client Use our project management tool to report progress Find, analyse, and fix reported bugs in our systems Job Requirements: You hold a bachelor degree in Computer Science or IT discipline You have at least 2 years of working experience in this sector (fresh graduates are occasionally welcome too!) Strong application development programming knowledge using Java (8) Knowledge of application servers such as JBoss, Tomcat Experienced with frameworks such as Hibernate, and Spring (Boot). Experienced working in Linux environment Experienced working with Git Strong knowledge of MySQL Experience with RESTful programming Experienced in writing unit tests using TestNG Familiar working with NetBeans, Intelij, or Eclipse IDE Preferred: experienced with Redmine Preferred: experienced with Docker Ability to communicate with English effectively, both orally and in writing.",
    "createdAt": "2018-01-12T07:15:32.090000Z",
    "updatedAt": "2023-10-06T04:14:19.828000Z"
  },
  {
    "name": "PT Venturium System Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524217/hacktiv8/career/pt-venturium-system-indonesia-mb8c7c4fv58.png",
    "location": "JL Utan Kayu Raya No 14",
    "email": "info@vensys.co.id",
    "description": "VenSys - PT Venturium System Indonesia established since 2003. We provide comprehensive services and solutions for the banking and financial market. Create, design and develop Java-based applications. Qualifications: Bachelor degree in Computer Science, Electrical Engineering, Information Technology, Physics and Math Science. Have strong knowledge and skill in: Java Developer, at least two of: J2EE, J2SE, J2ME, Spring Framework, Object Oriented programming. Experienced using microservice, Kafka, Container, JMS, EJB, JDBC or any technology provided by the market leader. Hard worker, team player, thrive in an extremely fast paced environment.",
    "createdAt": "2023-08-03T08:26:55.003000Z",
    "updatedAt": "2023-08-04T03:35:23.528000Z"
  },
  {
    "name": "PT. RAKHASA ARTHA WISESA",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524220/hacktiv8/career/pt.-rakhasa-artha-wisesa-9mbsxzq7n0e.jpg",
    "location": "Jl. Jemb. Besi II No.6-7, RT.10/RW.1, Jemb. Besi, Kec. Tambora, Kota Jakarta Barat, Daerah Khusus Ibukota Jakarta 11320",
    "email": "info@rakhasa.com",
    "description": "PT Rakhasa Artha Wisesa is a dynamic and forward-thinking company established in 2020 with a clear vision to revolutionize the business landscape globally. We are committed to creating a systematic world for all business sectors, aiming to significantly contribute to the growth and stability of the world economy. Vision: To harness the power of AI technologies to create a connected and systematic world where businesses thrive, driving sustainable economic growth and innovation. To create a systematic world where businesses thrive through innovative solutions, fostering global economic growth and sustainability. Mission: Our mission is to revolutionize industries by integrating AI technologies that streamline operations, optimize decision-making processes, and foster a more efficient and sustainable business environment globally. We aim to empower businesses of all sizes to achieve their full potential and contribute to the advancement of the world economy. We are to empower businesses across all sectors with cutting-edge technologies and services that streamline operations, enhance efficiency, and drive sustainable growth. By providing comprehensive solutions tailored to the unique needs of each industry, we aim to elevate productivity, reduce costs, and promote global economic stability. Core Values: Innovation: Pioneering new solutions and technologies to stay ahead in a rapidly evolving digital landscape. Integrity: Upholding ethical standards and transparency in all aspects of our operations. Collaboration: Building strong partnerships with clients, stakeholders, and communities to drive mutual success. Excellence: Committing to delivering superior quality and value through our AI-driven solutions. Sustainability: Promoting sustainable practices and solutions that benefit both businesses and society at large. Key Offerings: Technology Solutions: Advanced software and digital platforms tailored to optimize business processes. AI Solutions: Custom AI applications and platforms tailored to specific business needs. Data Analytics: Advanced data analytics tools for actionable insights and informed decision-making. Consulting Services: Expert consultation to guide businesses in AI adoption and implementation. Training and Support: Comprehensive training programs and ongoing support to maximize AI utilization and effectiveness. Market Focus: We serve a diverse range of industries including but not limited to manufacturing, healthcare, finance, retail, and transportation. Our solutions are scalable and adaptable to businesses of all sizes, from startups to multinational corporations. Achievements: Since our inception, we have successfully transformed numerous businesses by integrating AI technologies that drive operational efficiencies and enhance competitiveness. Our dedication to delivering impactful solutions has earned us recognition as a trusted partner in the AI industry. Future Outlook: Looking ahead, PT Rakhasa Artha Wisesa is poised for continued growth and expansion. We remain dedicated to driving innovation, fostering strategic partnerships, and making a positive impact on the global economy. By staying true to our core values and leveraging emerging technologies, we are confident in our ability to shape the future of business worldwide. Contact Us: For more information about our services and how we can support your career, please visit our website rakhasa.com or contact us at career@rakhasa.com or +62 813-8133-8889. We look forward to partnering with you on your journey to success.",
    "createdAt": "2023-09-19T07:19:41.845000Z",
    "updatedAt": "2024-07-30T04:02:41.477000Z"
  },
  {
    "name": "PT Indo Cipta Daya",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524223/hacktiv8/career/pt-indo-cipta-daya-sox42djl3e.png",
    "location": "GrahaMustika,JakartaSelatan",
    "email": "info@indociptadaya.co.id",
    "description": "Welcome to RENNO - Tallentics, where we specialize in providing Headhunting Services and Learning & Development for corporate training. We are passionate about connecting exceptional candidates to your company and believe that investing in people is the best path for success. Our commitment is to help individuals and organizations reach their full potential as humans, creating a world where this is possible for everyone.",
    "createdAt": "2023-05-05T03:21:01.923000Z",
    "updatedAt": "2023-09-25T02:29:43.014000Z"
  },
  {
    "name": "PT Rajawali Anugrah Resources",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524226/hacktiv8/career/pt-rajawali-anugrah-resources-un4wjrt7vv.png",
    "location": "Jl. Bend. Jatiluhur No.17, RT.5/RW.2, Bend. Hilir, Kecamatan Tanah Abang,",
    "email": "info@rar.co.id",
    "description": "PT Rajawali Anugrah Resources (RAR) menyediakan Solusi Sumber Daya Manusia (SDM) untuk perusahaan (pengusaha) dan individu (pencari kerja). Kami berkomitmen untuk memberikan klien kami solusi terbaik di bidang SDM, meningkatkan efisiensi dan kinerja orang-orang di dunia persaingan yang semakin ketat. Klien akan dibantu dalam memperoleh solusi yang layak dalam setiap aspek SDM. Orang adalah aset paling berharga dalam sebuah organisasi. Oleh karena itu, tujuannya adalah memberikan pengembangan yang konsisten kepada klien dan membekali mereka dengan pengetahuan yang sesuai untuk mempertahankan kinerja yang optimal.",
    "createdAt": "2022-10-06T06:39:18.678000Z",
    "updatedAt": "2022-10-07T03:31:57.230000Z"
  },
  {
    "name": "PT Mega Sukses (LOLY POLY)",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524228/hacktiv8/career/pt-mega-sukses-%28loly-poly%29-sy2msoovx6.jpg",
    "location": "Headquarters\nRuko Puri Delta Mas Blok D6 No. 43, Jakarta Utara, DKI Jakarta ID",
    "email": "info@lolypoly.com",
    "description": "We're the largest gadget accessories retail company in Indonesia that has been established since 2000. Our vision is to become the biggest gadget accessories brand in Indonesia. With counters spread throughout Indonesia and reaching more than 100 counters, we are ready to meet customer needs with competent human resources and innovative products. Deskripsi Pekerjaan: Membuat, membangun dan mengembangkan program baik pada aplikasi maupun web yang sesuai dengan kebutuhan perusahaan. Mengatur dan menjamin keamanan web. Membuat laporan analisis dan statistik server. Melakukan analisis kebutuhan pengguna sehingga perangkat yang dihasilkan sesuai dengan target user yang ditentukan. Melakukan perbaikan pada kesalahan yang terjadi pada sistem/aplikasi. Melakukan dokumentasi pada penyusunan program yang sedang dikerjakan atau diperbaiki sehingga bisa dilakukan tracking dengan mudah saat ditemukan kesalahan. Bekerja sama dengan tim internal maupun eksternal untuk melakukan analisis kesalahan pada software yang sedang atau akan dikerjakan. Melakukan maintenance sistem yang disinyalir terdapat kesalahan. Melakukan pengembangan lanjutan pada sistem perangkat lunak yang akan dilakukan tindak lanjut atau updating, dan developing. Melakukan uji coba software yang sudah diselesaikan oleh tim untuk kemudian dianalisis lebih lanjut untuk dicari kesalahannya sehingga hasil yang benar-benar aman. Melakukan adaptasi hardware untuk menunjang sistem yang sedang dibangun. Kualifikasi: Berpengalaman min 3 tahun di bidang retail. End to end trouble shoot dan bug yang muncul. Mampu bekerja di bawah tekanan. Terbiasa membuat web dan aplikasi lainnya. Terbiasa sistem POS, Inventory Warehouse.",
    "createdAt": "2023-10-16T06:48:51.041000Z",
    "updatedAt": "2023-11-29T02:53:02.307000Z"
  },
  {
    "name": "PT Quadra Karya Santosa",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524230/hacktiv8/career/pt-quadra-karya-santosa-i3tr3y2q5hd.jpg",
    "location": "Jln. Gaya Motor Raya No. 8, Sunter II, Jakarta Utara, DKI Jakarta 14330",
    "email": "info@quadrakaryasantosa.co.id",
    "description": "Quadra Karya Santosa is a team of IT consultant, developer, designer, and technopreneur who thrive on designing and developing great user interfaces and user experiences for IT consulting. Programming Language (Java, Kotlin, Swift, Objective-C), Mobile Development. Framework (ReactNative), Performance Optimization, Mobile Application Architecture. 1. Mengembangkan dan memelihara aplikasi mobile IOS untuk platform penjualan mobil bekas, dengan fokus pada performa, keamanan, dan kualitas pengalaman pengguna. 2. Berkolaborasi dengan tim pengembangan untuk merancang, menguji, dan mengimplementasikan fitur-fitur baru dalam aplikasi, serta melakukan perbaikan dan pembaruan sesuai kebutuhan. 3. Memastikan aplikasi IOS selalu terintegrasi dengan baik dengan backend dan database perusahaan, serta memastikan fungsionalitas yang konsisten dan lancar. 4. Memantau dan menganalisis performa aplikasi IOS, serta melakukan debugging dan perbaikan masalah yang mungkin muncul guna meningkatkan kinerja aplikasi secara keseluruhan.",
    "createdAt": "2024-01-17T06:24:48.354000Z",
    "updatedAt": "2024-05-07T02:32:17.452000Z"
  },
  {
    "name": "UKU Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524233/hacktiv8/career/uku-indonesia-10uqq86mi5v.jpg",
    "location": "Jakarta, Indonesia",
    "email": "info@ukuindo.com",
    "description": "UKU merupakan aplikasi layanan pinjaman dana tanpa jaminan yang diluncurkan oleh PT Teknologi Merlin Sejahtera pada tahun 2017. Hanya dengan menyediakan KTP, Anda dapat mengajukan pinjaman dana hingga Rp5.000.000. UKU menggabungkan teknologi risk management, machine learning, dan big data mining yang kuat untuk menciptakan implementasi strategi dan teknologi aplikasi mobile berkualitas tinggi. Demi menyediakan layanan pinjaman dana berkualitas bagi pengguna UKU.\n\n**Bilingual English and Mandarin Developer**\nWe are seeking a talented bilingual developer fluent in both English and Mandarin to join our dynamic team. As a key member of our development team, you will play a crucial role in enhancing and maintaining our software applications, ensuring they meet the highest standards of quality and performance.\n\n**Job Responsibilities**\n- Develops and enhance software applications through coding and testing.\n- Involves in code reviews and training.\n- Delivers highest quality software by creating unit test plan and testing code thoroughly.\n- Adept with the tools, applications, and processes used for software development.\n- Implements solutions as designed in technical documentation specification and coding standards.\n- Creates project documentations and coordinate technical issues.\n- Reports to a senior developer.\n- Knows the business rules and concepts, software specifications and designs provided by the technical lead and apply them in completing the assigned task.\n\n**Requirements:**\nCandidate must possess a Bachelor’s degree in Computer Science/Information Technology/Engineering (computer/telecommunications).\n- Must have at least 2 years of extensive experience in Object-oriented programming specifically on JAVA/J2EE.\n- Has knowledge or relevant work experience in any of the following programming languages or technologies: Java/J2EE.\n- Must have sufficient knowledge in Object-oriented programming concept.\n- Must be an excellent team player in a different culture.\n- Must display ability to learn in a short time and work under pressure.\n- **Mandarin & English speaker is a must.**",
    "createdAt": "2019-08-23T02:23:50.638000Z",
    "updatedAt": "2023-08-29T04:37:40.315000Z"
  },
  {
    "name": "PT. iBantu Solusi Syariah",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524243/hacktiv8/career/pt.-ibantu-solusi-syariah-2elsiefwndm.jpg",
    "location": "Menara 165 Lantai 4, JL. TB Simatupang Kav. 1, Cilandak Timur, Pasar Minggu, Jakarta Selatan 12650, South Jakarta, Indonesia, Jakarta",
    "email": "info@ibantu.co",
    "description": "iBantu is a specialist in Islamic finance and a technology partner for Web3.0 Blockchain, providing training and consultancy, and solutions to corporations and individuals. Our mission is to make financial services accessible to everyone, regardless of their economic background. By leveraging technology and Islamic finance principles, we are dedicated to supporting individuals, businesses, and organizations in achieving their financial goals. iBantu strive to empower organizations to succeed with innovative Islamic finance solutions.",
    "createdAt": "2024-07-24T02:34:03.578000Z",
    "updatedAt": "2024-07-24T09:14:32.911000Z"
  },
  {
    "name": "PT Ishida Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524252/hacktiv8/career/pt-ishida-indonesia-vp2nxlqrbfn.png",
    "location": "Jalan Boulevard Barat Raya Blok B No 03 dan 05, Kelapa Gading Barat, Kelapa Gading, Jakarta Utara",
    "email": "info@ishida.com",
    "description": "Since our establishment in 1893, Ishida has been an important presence in society as a developer of advanced industrial technology. As the first privately held domestic manufacturer of weighing equipment, we have made a significant contribution to the Japanese economy, and have been a leading representative of Japanese industry worldwide. In recent years, we have extended the scope of our business to include the fields of packing, inspection, and display technology, in addition to building on our continued success in the field of weighing. We currently provide products and give satisfaction to customers in over 100 countries worldwide. In 2010, Ishida established -Ishida Mind- a new management philosophy aimed at ensuring our continued existence and future growth. The central pillar of this new philosophy -the Three Way Harmony- is a management concept that has been passed down throughout the history of our company and will continue to be passed on to future generations. As a company that naturally adapts to the times and is admired by others, Ishida consistently puts the customer first and, maintaining an open and fair outlook, endeavors to be a company that is trusted by all and recognises our responsibility in creating a prosperous society. To that end, Ishida believes in developing world-class employees to match our world-leading technology, and will continue to strive unceasingly for excellence. I extend my sincere thanks to all our stakeholders for their continued support, which has helped Ishida to grow, and we will continue to grow day after day. Expect great things from us in the future.",
    "createdAt": "2019-05-13T11:28:33.864000Z",
    "updatedAt": "2024-04-05T10:08:27.205000Z"
  },
  {
    "name": "Jasnikom Gemanusa",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524255/hacktiv8/career/jasnikom-gemanusa-g5tx6ir4vf.jpg",
    "location": "KANTOR PUSAT & OPERATION BASE:\nJl. Pintu Air Raya No.2A, Jakarta Pusat - 10710, Indonesia",
    "email": "info@jasnikom.com",
    "description": "Jasnikom is a reliable and experienced wireless data network provider in Indonesia. Find out more about our services, career opportunities and contact details. Job Qualifications : Bachelor's degree in Electrical Engineering, Telecommunication engineering, Computer Science, Computer Engineering, Instrument Engineering. 2 years experiences in Telecommunication and IT Industries. Has persistent personality and able to work under pressure. Able to work individually or in a team. Excellent to operate microsoft office. Having CCTV and ACS BOSH Certification will be advantages. Having a healthy body and healthy eyes. Willing to work in elevation area. Job Descriptions : Data management on site. Standby engineer CCTV. Manage ACS users, add and remove users. Synchronize existing systems and devices with new systems and devices. Carry out troubleshooting and repairs if there is CCTV and ACS damage at the customer location. Make a monthly report.",
    "createdAt": "2024-07-12T07:38:03.534000Z",
    "updatedAt": "2024-07-12T11:02:56.224000Z"
  },
  {
    "name": "PT Global Edge Teknologi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524268/hacktiv8/career/pt-global-edge-teknologi-ecxftp44qtv.jpg",
    "location": "The Mansion Bougenville Tower Fontana BE17 F1, Jl. Trembesi Blok D, Pademangan Tim, Pademangan, Jakarta Utara",
    "email": "info@globaledgeteknologi.com",
    "description": "PT Global Edge Technology merupakan sebuah perusahaan yang bergerak dibidang information technology. As a Full-Stack Developer, you will be responsible for developing and maintaining web applications using C# .NET, ReactJS, and Google’s Firebase. You will work closely with our design and development teams to create robust, scalable, and high-performance applications. Your role will involve both front-end and back-end development, ensuring seamless integration and functionality across the entire stack. Key Responsibilities: • Develop and maintain web applications using C# .NET and ReactJS. • Design and implement database solutions using Firebase Realtime DB and Cloud Firestore. • Collaborate with cross-functional teams to define, design, and ship new features. • Write clean, well-documented, and efficient code following best practices. • Perform code reviews and provide constructive feedback to peers. • Troubleshoot, debug, and optimize applications for maximum speed and scalability. • Work with Facebook Developer tools for social media integrations and marketing automation. • Manage and optimize our Google My Business profile and API integrations. • Stay up-to-date with emerging technologies and industry trends. Requirements: • Proven experience (3+ years) as a Full-Stack Developer using .NET Core and ReactJS • Proficient in C# .NET: Demonstrated experience in developing web applications using C# .NET. • Strong knowledge of ReactJS: Solid experience in building user interfaces with ReactJS, including component-based architecture and state management. • Firebase Expertise: Hands-on experience with Firebase Realtime DB and Cloud Firestore for real-time data synchronization and cloud-based storage solutions. • ElasticSearch: Knowledge and experience with ElasticSearch for implementing search functionality and analytics. • Full-Stack Development: Ability to handle both front-end and back-end development tasks. • Version Control: Proficiency with version control systems, preferably Git. (We’re using Azure DevOps for SDLC) • Problem-Solving Skills: Strong analytical and problem-solving skills with a keen attention to detail. • Team Collaboration: Excellent communication and teamwork skills, with the ability to work effectively in a collaborative environment. • Professional proficiency in spoken and written English is required as you will be collaborating with an overseas team. Preferred Qualifications: • Familiarity with RESTful API design and integration. • Familiarity with ASP.NET Core Identity • Knowledge of cloud services and serverless architecture. • Experience with CI/CD pipelines and DevOps practices. (Azure DevOps) • Microsoft Azure: Experience with deploying, managing, and scaling applications on Microsoft Azure • Facebook Developer Program: Experience with the Facebook Developer platform, including integrating Facebook APIs and tools. • Google My Business: Experience with managing and optimizing business profiles using Google My Business. Education: Bachelor’s degree in Computer Science, Software Engineering, or a related field, or equivalent work experience.",
    "createdAt": "2023-12-12T07:48:32.305000Z",
    "updatedAt": "2024-05-07T02:29:11.347000Z"
  },
  {
    "name": "Sunset Residence & Condotel",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524273/hacktiv8/career/sunset-residence-and-condotel-bi3jvd977a.jpg",
    "location": "Jl. Dewi Sri No.11, Legian, Kec. Kuta, Kabupaten Badung, Bali",
    "email": "info@sunsetresidencecondotel.com",
    "description": "Sunset Residence Condotel is the leading Serviced Apartment accommodation in Bali and ideally located in the golden triangle of Legian, Kuta and Seminyak. Qualification: Can work with the team. Fresh graduates are welcome. Minimum SMA / SMK.",
    "createdAt": "2024-07-26T04:03:09.300000Z",
    "updatedAt": "2024-07-26T04:25:53.298000Z"
  },
  {
    "name": "Taldio",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524276/hacktiv8/career/taldio-4k55jughpu8.png",
    "location": "Ruko Dalton Extension,Scientia Garden, Blok DLNT No.39, Gading Serpong.Tangerang,, Tangerang Selatan, ID",
    "email": "info@taldio.com",
    "description": "As we know, the hiring process can be difficult. Such difficulties are not just because of the long hiring process but also the difficulty of finding the best match candidate for the position. The difficulty of hiring can be compounded when the candidate we just hired may not be satisfied with their newfound employment or the activities associated with their employment. Such problems happen because hiring is not just matching the candidate's hardskills, experience, and major with the position. It can be very complex for companies to navigate this hiring environment. We spend a lot of time matching their skill but we forget people will not perform their maximum capacity if they are not happy or even love their job or their company culture. We often forget this part in hiring. A lot of time is spent matching a candidate's skill set to willing employers and clients. However, it is important to note that people will not put any effort into the job if they feel that they are not happy with their job or if their company culture is not suited to their personality. Oftentimes, such issues are thrown on the backburner. So how do we know that our candidate matches the position and will put in their best effort into the job? Taldio have a solution for that problems.",
    "createdAt": "2023-10-31T04:30:26.974000Z",
    "updatedAt": "2023-11-14T14:14:22.186000Z"
  },
  {
    "name": "Pt Pendanaan Teknologi Nusa",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524278/hacktiv8/career/pt-pendanaan-teknologi-nusa-nxgz0bex2bs.png",
    "location": "Foresta business loft 3 No. 30 & 31, Jl. BSD Raya Utama, Kecamatan:, Pagedangan, Tangerang, Banten 15331",
    "email": "info@pendanaan.com",
    "description": "We started our technology-based financial lending service platform in Indonesia since December 2016, under the control of the parent company Hadoop Fintech (Hong Kong) Limited, a limited liability company incorporated in Hong Kong. We aim to roll out mobile innovations for more financial services for people who don't get banking services. Our technology enables eligible borrowers to access affordable and flexible digital credit via mobile devices.",
    "createdAt": "2021-08-10T06:43:24.951000Z",
    "updatedAt": "2023-03-28T03:50:50.903000Z"
  },
  {
    "name": "PT. Orang Informasi Teknologi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524291/hacktiv8/career/pt.-orang-informasi-teknologi-luqqgdcgh98.png",
    "location": "Jl. Jendral Sudirman Kav. 86, Sahid Sudirman Center, floor 23, Jakarta Pusat, Indonesia 10220, ID",
    "email": "info@orang-it.id",
    "description": "Orang-IT.id is a company that focuses on meeting the needs of IT experts and positions needed in IT projects. Historically, our business has been started since 2015, namely as part of PT. Solman Manuggal Informatika (Solman), which has successfully provided IT workforce fulfillment services to several well-known clients. Due to the development of digitalization, the presence of the orang-IT.id platform has our vision to become an IT workforce provider company with the aim of making it easier for IT talents to get permanent and project-based jobs and make it easier for clients to get IT experts based on digital technology. We focus on providing IT expert solutions with three business pillars, namely resourcing, outsourcing and headhunting. With a budget that is tailored to the needs of the HR department and project team, we will help clients find the right IT talent. We are fully responsible for meeting the needs of IT personnel in an IT project with a conformity level of above 90% thus speeding up the placement process. In addition, guaranteeing performance monitoring during project entry up to candidate replacement is the focus of our services when IT talents are placed. As an IT talent, you can access information about permanent work or employment contracts and time from Orang-IT.id. In addition, we are here with social media features such as community, general discussions about products and issues in IT, and you can post your thoughts, opinions, personal experiences and others. You have the opportunity to get a referral fee as a reward if you help your colleagues to get the job they want. So, there is no other word to join Orang-It.id if you really are an “IT person”.",
    "createdAt": "2023-10-11T05:12:12.536000Z",
    "updatedAt": "2023-10-27T07:22:27.293000Z"
  },
  {
    "name": "PT. Inovasi Niaga Integrasi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524293/hacktiv8/career/pt.-inovasi-niaga-integrasi-iiwwxh81emp.jpg",
    "location": "Gedung Graha Krama Yudha Lt.4 Unit B\nJl. Warung Jati Barat No.43 Jakarta Selatan 12760",
    "email": "info@waizly.id",
    "description": "PT Inovasi Niaga Integrasi or with brand Waizly is a digital solution that connects. Sellers/Brands to multiple channels or marketplaces, manages inventory and warehouse operational in a digital, and connects to multi logistics partner. Job Descriptions: Participated to develop Backend and Frontend Application using Laravel, Yii, Codelgniter. Identificaton and handle bug to ensure performance scalability. Develop and maintain Waizly's system. Collaborate with Engineer team on developing interface and functionality. Job Requirements: Experienced as Full Stack Engineer for at least 2 years. Familiar with Git, Scrum Agile, and Design Pattern (Atomic, Clean Code). Have a strong experienced at Laravel, Yii, and Codelgniter. Having knowledge about massage broker (Kafka, RabbitMQ) will be a plus point. Abillity to work as part of a team. Having a good communication skill.",
    "createdAt": "2023-09-04T06:17:22.760000Z",
    "updatedAt": "2024-05-07T02:31:42.174000Z"
  },
  {
    "name": "PT Lumos Inisiatif Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524298/hacktiv8/career/pt-lumos-inisiatif-indonesia-ehtmgo9f1dt.jpg",
    "location": "Komp. Ruko Green Garden Blk. Z, Jl. Panjang Arteri Klp. Dua Raya No.5 4 No.15, RT.5/RW.8, Kedoya Utara, Kec. Kb. Jeruk, Kota Jakarta Barat, Daerah Khusus Ibukota Jakarta 11520",
    "email": "info@lumoshive.com",
    "description": "PT. Lumos Inisiatif Indonesia, also known as Lumoshive is a technology resource provider based in Jakarta and Batam, Indonesia. We are a group of technical developers who will help you transform your old-schooled, plain, paper-based businesses into new, trendy, innovative businesses utilizing all available technology. We are a digital acceleration expert, specializing in solid end-to-end delivery of tailor-made technology solutions bringing innovative, scalable, and competitive results.",
    "createdAt": "2022-09-12T04:30:03.058000Z",
    "updatedAt": "2024-03-05T07:32:51.645000Z"
  },
  {
    "name": "PT Daya Rekadigital Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524300/hacktiv8/career/pt-daya-rekadigital-indonesia-h0xwvlwdge.png",
    "location": "Jl. Wijaya Kusuma No. 39 Tipes, Serengan, Surakarta, Jawa Tengah 57154",
    "email": "info@dri.co.id",
    "description": "PT Daya Rekadital Indonesia merupakan perusahaan penyedia jasa dan konsultan layanan IT yang dapat membantu Anda dalam membangun citra digital  yang kuat melalui desain website dan aplikasi yang sesuai dengan kebutuhan perusahaan, didukung dengan layanan jasa konsultasi digital marketing yang unggul. Kami menghadirkan pengembangan IT yang komprehensif dan inovatif bagi bisnis Anda secara menyeluruh.",
    "createdAt": "2020-11-11T21:45:19.321000Z",
    "updatedAt": "2024-07-23T08:47:05.839000Z"
  },
  {
    "name": "PT. Nuvens Prima Retail",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524312/hacktiv8/career/pt.-nuvens-prima-retail-xewmig9umv.png",
    "location": "Ruko Green Mansion Blok A no 1-5",
    "email": "info@nuvensprimaretail.id",
    "description": "Awandaya Group is the national sole distributor of RELX, a fast-growing consumer electronic and lifestyle brand, with more than 40% market share in China and presence in more than 50 countries worldwide. The brand is backed by prominent international venture capitals. Capitalizing on Indonesia's large existing market with limited direct competitors. PT Garda Distribusi Teknologi was established in 2020 by well-experienced professionals from fertilizer trading, distribution, and private equity backgrounds.",
    "createdAt": "2022-11-15T07:16:22.251000Z",
    "updatedAt": "2023-05-19T02:05:55.496000Z"
  },
  {
    "name": "PT. Sinar Mitra Cendekia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524314/hacktiv8/career/pt.-sinar-mitra-cendekia-zgc8jl1be1d.jpg",
    "location": "Ruko Harco Mangga Dua Blok I No.34-35, Jl. Mangga Dua Raya, RT.17/RW.11, South Mangga Dua, Sawah Besar, Jakarta, 10730",
    "email": "info@sinarcendekia.com",
    "description": "PT Sinar Mitra Cendekia adalah sebuah perusahaan yang bergerak di bagian distribusi produk Supplier dan Accessories Computer didirikan pada 25 Juli 2012 di Jakarta yang merupakan salah satu dari anak perusahaan PT Dragon Computer & Communication yang telah berkecimpung didalam bisnis IT sejak tahun 1980, dan merupakan salah satu cikal-bakal bisnis computer di Indonesia, saat ini PT Sinar Mitra Cendekia memliki divisi supplies tinta printer InkTec (Made in Korea) sebagai distributor yang telah dijalankan sebelumnya oleh perusahaan induk selama 20 tahun, dalam perkembangannya saat ini telah dibentuk pula divisi Networking dengan produk yang dipasarkan bermerek MikroTik (Latvia). Selain itu mulai tahun 2023 ini kami juga memiliki divisi untuk supplies produk-produk AIDC (scanner barcode, dll).",
    "createdAt": "2024-03-01T07:42:11.411000Z",
    "updatedAt": "2024-03-01T08:08:01.759000Z"
  },
  {
    "name": "PT CreateIT Solution Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524319/hacktiv8/career/pt-createit-solution-indonesia-5lyz9q6nun9.jpg",
    "location": "Ruko DeMansion Blok EF No.5 Alam Sutera, Kec. Pinang, Kota Tangerang, Banten 15143",
    "email": "info@createit.id",
    "description": "At PT CreateIT Solution Indonesia, we are at the forefront of innovation, delivering unparalleled software solutions to drive the success of businesses in the digital age. As an experienced software company, we specialize in creating and maintaining businesses' software. We are looking for an experienced Senior .NET Engineer with strong AWS knowledge to join our development team. The ideal candidate will have a solid background in C# development, containerization, and AWS services, and will contribute to various projects to enhance and maintain our platform. Key Responsibilities include Service Development & Integration, Containerization & Workflow Management, System Upgrades & Optimization, Security & Integration, and AWS Infrastructure Management. Requirements include extensive experience with C# and .NET development, proficiency in containerization and database management, and a strong understanding of AWS services. Candidates should also possess strong problem-solving skills, excellent English communication skills, and effective project management capabilities.",
    "createdAt": "2024-07-03T09:19:53.224000Z",
    "updatedAt": "2024-07-04T04:04:10.646000Z"
  },
  {
    "name": "‪Ihsan Solusi",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524321/hacktiv8/career/ihsan-solusi-4cp6071fosy.jpg",
    "location": "JL PHH Mustofa 39, Surapati Core C-7.Pasirlayung, Kec. Cibeunying Kidul, Kota Bandung, Jawa Barat 40192",
    "email": "info@ihsansolusi.co.id",
    "description": "Ihsan Solusi is a technology development company founded in 2001. The company has an interesting history in developing IT solutions for the banking and financial industry across various sectors, including fintech, payments, capital markets, etc. Qualifications and Requirements: Bachelor's degree in informatics engineering or relevant, Domiciled in Jabotabek, Female preferably, Have an expertise in Laravel Framework and React.JS, Have an expertise in Python and SQL, Comfortable working in fast-paced, Capable using cloud platform is a plus, Willing to be placed in Jakarta.",
    "createdAt": "2024-06-11T06:51:40.452000Z",
    "updatedAt": "2024-06-11T09:27:54.118000Z"
  },
  {
    "name": "PT. SATRIA DIGITAL SEJAHTERA",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524325/hacktiv8/career/pt.-satria-digital-sejahtera-dnpb7e1ud9.png",
    "location": "Ruko ICE Business Park Blok A no. 3, Jl. BSD Grand Boulevard, Pagedangan, Kec. Pagedangan, Kabupaten Tangerang, Banten 15339",
    "email": "info@satriadigitalsejahtera.co.id",
    "description": "PT. SATRIA DIGITAL SEJAHTERA membuka lowongan kerja untuk mengisi posisi sebagai Full Stack Developer untuk Build and Update Internal Application (Web Bases). Tanggung Jawab Pekerjaan : -Build and Update Internal Application (Web Bases). -Analyze Requirements and Construct them to PHP Coding. -Strategy for Application Structure, Architecture, Development & Implementation. -Develop in HTML and PHP. -Teamwork and proper workflow with SDLC Oriented or Agile Project Management. Syarat Pengalaman : min 1 tahun berpengalaman sebagai web developer Keahlian : -PHP- -Good SQL knowledge and good analytical thinking -Framework Laravel Kualifikasi : -Education: Bachelor Degree in IT/Computer Science or related major -At least 1 Year(s) of working experience in the related field is required for this position. Fresh graduate are welcome to apply -Excellent teamwork and deadline-oriented -Placement in Tangerang Selatan, WFO. Waktu Bekerja : 08.30 – 17.00 ( Senin – Jumat ) 08.30 - 14.00 ( Sabtu )",
    "createdAt": "2022-10-13T07:20:11.216000Z",
    "updatedAt": "2022-10-13T09:30:24.021000Z"
  },
  {
    "name": "Geekgarden",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524327/hacktiv8/career/geekgarden-mrowc8t4qv.png",
    "location": "Gedung Asram Lt 2 Jl Ring Road Utara, Gg Pandega Rini II Manggung, Catur Tunggal, Kec Depok, Mlati, Sleman Regency, Special Region of Yogyakarta 55285",
    "email": "hr@geekgarden.id",
    "description": "Geekgarden is an IT company in Indonesia that provides planning, development, and management services for small to large scale applications and systems. By mastering various platform development tools, especially those that use open source technology, both web, and mobile-based. We are able to provide an appropriate and integrated system and application solutions. Join us and develop your skills here. Assist in develop and implement user interfaces for web applications using Vue.js and related front-end technologies. Integrate with backend APIs to fetch and manage data. Optimize application performance to deliver a fast and efficient user experience. Assist in testing of Vue.js components to identify and resolve any bugs or issues. Collaborate with development team to deliver high-quality solutions. Job Requirements: Final year college student or Bachelor's degree (S1) in Computer Science, Software Engineering, or related Majors. Proficiency in HTML, CSS and JavaScript (Vue Js). Having knowledge with RESTful APIs to efficiently fetch and manage data within Vue.js applications. Understand with GitHub or similar tools. Willing to work onsite in Yogyakarta.",
    "createdAt": "2021-03-03T02:04:56.528000Z",
    "updatedAt": "2024-02-21T06:51:53.144000Z"
  },
  {
    "name": "PT Trasfello Bangun Teknika",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524337/hacktiv8/career/pt-trasfello-bangun-teknika-93w26qd6a6t.jpg",
    "location": "Plaza 3 Pondok Indah Jakarta Selatan 12310\n",
    "email": "info@trasfello.com",
    "description": "Founded on 6 February 2008, Trasfello (PT. Trasfello Bangun Teknika) start from the experts of HVAC system which has a commitment to providing the best service to the customers from both sides of the selected material quality and service. Qualification:\n\n- Usia Maksimal 30th;\n- Pendidikan Min.D3 Teknik Tata Udara dan Pendingin/ Teknik Mesin atau jurusan terkait;\n- Memiliki Pengalaman Min. 3 Tahun;\n- Memiliki Kemampuan Bahasa Inggris Lebih Diutamakan;\n- Kreatif dan Inovatif;\n- Mampu Bekerja Dengan Team;\n- Menguasai AUTOCAD;\n- Menguasai Cooling Load HVAC;\n- Memiliki Pengetahuan Yang Luas Tentang Sistem HVAC.",
    "createdAt": "2024-04-05T03:15:19.622000Z",
    "updatedAt": "2024-05-07T02:32:59.329000Z"
  },
  {
    "name": "Cemslab Teknologi Indonesia",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524340/hacktiv8/career/cemslab-teknologi-indonesia-uuaeqil38yb.png",
    "location": "Grand Galaxy Park – Ruko Sentra Niaga 8 No 7 Kel Jakasetia, Bekasi Selatan - BEKASI",
    "email": "info@cemslab.co.id",
    "description": "PT. Cemslab Teknologi Indonesia is a private company engaged in the fields of Control & Automation, Instrumentation, and Mechanical and Electrical for the industrial sector. We are experienced in several multi-national companies in Indonesia.",
    "createdAt": "2022-08-09T04:48:46.946000Z",
    "updatedAt": "2022-08-09T07:28:32.356000Z"
  },
  {
    "name": "Fgs Infotama",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524345/hacktiv8/career/fgs-infotama-eh43p4yand7.png",
    "location": "GP PLAZA 15th floor unit 15, Jl. Gelora II no.1 , Jakarta Pusat",
    "email": "info@fgsinfotama.com",
    "description": "PT FGS Infotama is a Software Company which develops Business Information Systems including Information Technology Services. Until now, Online Trading has become one of the main and best software from PT FGS Infotama. REQUIREMENTS: Currently pursuing or recently completed a degree in Computer Science, Software Engineering, or a related field. Experience: Minimum of 2 years in React Native development, with a strong portfolio of released applications on both Android and iOS. Strong understanding of React Native and mobile app development. Experience with JavaScript, HTML, and CSS. Familiarity with RESTful APIs and third-party libraries. Strong problem-solving skills and attention to detail. Excellent communication and teamwork skills. Self-motivated and fast learner. Responsibilities: Collaborate with the development team to design and implement mobile applications using React Native. Develop, test, and deploy mobile app features. Ensure the performance, quality, and responsiveness of applications. Debug and resolve technical issues and bugs. Participate in code reviews and contribute to the improvement of our development processes. Optimize applications for maximum speed and scalability. Collaborate with backend developers to integrate APIs and other services. Ensure the technical feasibility of UI/UX designs. Stay up-to-date with the latest industry trends and technologies. Qualification Skill: React Native (MUST), LINUX (MUST), Memahami konsep Rest Api, Nodejs, Java, SQL / My SQL, Android & iOS Development.",
    "createdAt": "2021-12-06T05:32:43.154000Z",
    "updatedAt": "2024-07-24T03:12:51.651000Z"
  },
  {
    "name": "PT Ruang Maha Karya",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524352/hacktiv8/career/pt-ruang-maha-karya-8rv438eubtn.png",
    "location": "Jl. KS Tubun 31, Petamburan, Tanah Abang",
    "email": "info@ruangmahakarya.com",
    "description": "PT. Ruang Maha Karya adalah salah satu perusahaan dalam grup Optik Melawai yang bergerak dalam bidang Property, dan gaya hidup. Tanggung Jawab: 1. Mendevelop program dan aplikasi yang digunakan perusahaan 2. Maintain program/aplikasi yang dikembangkan 3. Mendevelop team programmer untuk bs menguasai developing program/aplikasi yang ada, berkoordinasi dengan Head Programmer lainnya dan Dev Manager 4. Mengembangkan ide-ide digitalisasi sistem untuk mendukung perkembangan perusahaan Kualifikasi: 1. Programming: Golang, Vue Js (framework Nuxt), Progress (menjadi nilai tambah), mengerti konsep pembuatan API 2. O/S: LINUX, Windows 10/11, & Windows Server (memiliki Sertifikasi IOS menjadi nilai tambah) 3. Database: My SQL, Postgres, Progress (menjadi nilai tambah)",
    "createdAt": "2023-06-23T08:22:15.110000Z",
    "updatedAt": "2023-10-30T03:26:17.234000Z"
  },
  {
    "name": "PT Tri Nindya Utama",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524358/hacktiv8/career/pt-tri-nindya-utama-l4ffyl7ij8.jpg",
    "location": "Jl. H. Sa'aba No.6, RT.6/RW.5, Meruya Sel., Kec. Kembangan, Kota Jakarta Barat, Daerah Khusus Ibukota Jakarta 11650, Indonesia",
    "email": "info@banggasolution.com",
    "description": "Provides a broad portfolio of information technology solutions and business process to its clients.",
    "createdAt": "2024-02-01T01:44:49.100000Z",
    "updatedAt": "2024-05-07T02:32:03.583000Z"
  },
  {
    "name": "Sagara Technology",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524361/hacktiv8/career/sagara-technology-y6b3ujcq0bo.png",
    "location": "Wisma GKBI, Jl. Jend. Sudirman No.Kav. 28, Bend. Hilir, Kecamatan Tanah Abang, Kota Jakarta Pusat, Daerah Khusus Ibukota Jakarta 10210",
    "email": "info@sagaratechnology.com",
    "description": "Sagara Technology is an industry-leading software development proficient in delivering web and mobile IT solutions, outsourced product engineering services, and a digital marketing agency to provide enterprises reinvent their objectives for the digital age. Six years of implementing more than 150 projects, this experience provides Sagara a great basis for a thorough understanding of processes at all project development stages. Sagara fulfills to establish complete and stable products of any complexity on the market, irrespective of its purpose.",
    "createdAt": "2023-09-08T06:19:55.281000Z",
    "updatedAt": "2023-09-08T16:16:14.042000Z"
  },
  {
    "name": "YouApp",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524363/hacktiv8/career/youapp-8udmgd2p07y.jpg",
    "location": "Millerz Square, Kuala Lumpur",
    "email": "info@youapp.ai",
    "description": "YouApp integrates Western, Indian, and Eastern philosophies such as Astrology, Horoscopes (星座), Chinese Zodiac (生肖), and BaZi (八字) to offer immersive matching experiences, vibrant communities, exciting experiences & events, and connections with like-minded groups and communities. As a part of our development team, you will have the opportunity to work using the latest web2 and web3 technologies to deploy a scalable system to thousands if not millions of people.",
    "createdAt": "2022-12-31T16:05:29.260000Z",
    "updatedAt": "2024-07-11T02:52:15.918000Z"
  },
  {
    "name": "Tada",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524365/hacktiv8/career/tada-ge4l5fkt83b.jpg",
    "location": "Setiabudi Atrium 6th Floor Suite 602 Jl. H. R. Rasuna Said, Kav 62, Kuningan, RT.18/RW.2, Kuningan, Karet, Kecamatan Setiabudi, Kota Jakarta Selatan, Daerah Khusus Ibukota Jakarta 12920",
    "email": "info@usetada.com",
    "description": "Tada is a B2B2C loyalty and rewards platform that helps businesses improve channel partner, customer, and employee retention, build loyalty, and drive growth. Founded in 2012, Tada offers unified solutions that create engaging and rewarding experiences. As an Indonesian SaaS company with a global footprint, Tada has assisted 400+ local and international brands across various industries. Our game-changing loyalty solutions have also garnered numerous awards, solidifying our reputation as a leader in the sector.",
    "createdAt": "2021-07-16T06:51:36.504000Z",
    "updatedAt": "2024-07-11T02:57:36.625000Z"
  },
  {
    "name": "PT Kita Borneo Kompeten (Kita Kompeten)",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524369/hacktiv8/career/pt-kita-borneo-kompeten-%28kita-kompeten%29-jucijd9mdcm.png",
    "location": " Jl. Merpati No.9 A, RT.6/RW.10, Kby. Lama Sel., Kec. Kby. Lama, Kota Jakarta Selatan, Daerah Khusus Ibukota Jakarta 12240",
    "email": "info@kitakompeten.id",
    "description": "Kita Kompeten membuat kelas-kelas yang berhubungan dengan K3, Tambang, Industri, dan UMKM. Saat ini, KITA Kompeten sudah memiliki kelas-kelas berbasis standar kualitas kerja nasional Indonesia (SKKNI)",
    "createdAt": "2024-05-03T07:20:43.441000Z",
    "updatedAt": "2024-05-07T02:26:24.052000Z"
  },
  {
    "name": "PT Insan Daya Sentosa",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524373/hacktiv8/career/pt-insan-daya-sentosa-8hbsns6ijzu.png",
    "location": "Jl. Ruko Cemp. Mas No.27 Blok K, RW.8, Sumur Batu, Kemayoran, Central Jakarta City, Jakarta 10640",
    "email": "info@ptinsandayasentosa.com",
    "description": "PT Insan Daya Sentosa (PT IDS) merupakan perusahaan yang bergerak dalam bidang SDM. Saat ini, kami bekerja sama dengan beberapa perusahaan ternama yang tersebar di beberapa Kota Besar di Indonesia dan memiliki ribuan karyawan yang sudah tersebar luas di bebrapa kota Besar untuk lintas posisi. Mulai dari Cleaning Service, Kurir, Driver, SPB/SPG, Audit, Admin Bahkan hingga level Supervisor. Kami akan terus tumbuh memberikan kontribusi positif membangun negeri dengan menyediakan lowongan kerja yang berkualitas bagi generasi muda Indonesia.",
    "createdAt": "2024-02-06T07:48:56.508000Z",
    "updatedAt": "2024-04-26T10:29:30.685000Z"
  },
  {
    "name": "Arvis",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524389/hacktiv8/career/arvis-vcqspyfdxbm.png",
    "location": "Jl.Sunter Agung Podomoro Blok N2, No. 9 - 10, Sunter, RT.10/RW.11, \nSunter Jaya, Kec. Tj. Daerah Khusus Ibukota Jakarta 14350\n",
    "email": "info@arvis.id",
    "description": "An Intelligent data-driven integrated Business Intelligence and Workflow Automation solution platform. Our Mission is to empower businesses with the power of Data, to augment and integrate individuals with powerful data driven systems and elevate performance and results.",
    "createdAt": "2021-01-11T11:20:00.904000Z",
    "updatedAt": "2024-02-05T06:24:23.458000Z"
  },
  {
    "name": "Pt Enigma Camp",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524392/hacktiv8/career/pt-enigma-camp-1kse1sb3wvy.jpg",
    "location": "Gran Rubina Business Park, Generali Tower Lt. 20, Jalan HR Rasuna Said - Jakarta 12940",
    "email": "info@enigmacamp.com",
    "description": "Enigma Camp (PT Enigma Cipta Humanika) specializes in the business of IT Bootcamp and IT Talent Management, and it was officially established on August 19, 2019. Enigma Camp is driven by experiences that build software engineers to support our client's businesses. Be a Professional Software Engineer with Enigma Camp. Sebagai penyedia IT bootcamp dan IT talent management, Enigma Camp menawarkan program pelatihan offline gratis (Enigma Camp 1.0) yang dijalankan selama kurang lebih 8 s/d 12 minggu dengan berbagai fasilitas pelengkap yaitu, tempat tinggal yang dilengkapi AC dan Wi-Fi, laptop untuk menunjang kegiatan pembelajaran, serta makan 3 (tiga) kali sehari. Kualifikasi: Usia maksimal 30 tahun. Memiliki minat atau pengetahuan dasar programming. Lulusan SMA/SMK sederajat. Benefit: Kesempatan bekerja bersama hiring partners multinasional. Gaji minimal UMP Jakarta. Sesi Coaching, Monitoring, dan Mentoring selama bekerja. BPJS Kesehatan & Ketenagakerjaan. Asuransi Kesehatan Swasta. Daftar sekarang dan dapatkan kesempatan untuk menjadi software engineer bersama kami! Connect with us through: LinkedIn (Enigma Camp), Instagram (@enigmacamp), Twitter (@enigmacamp).",
    "createdAt": "2021-10-11T04:11:53.514000Z",
    "updatedAt": "2024-06-21T04:47:51.834000Z"
  },
  {
    "name": "FOWTEDU",
    "companyLogo": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723524396/hacktiv8/career/fowtedu-p1paq4e703c.png",
    "location": "Jl. River Garden Boulevard No.15-16, Cakung Timur., Kec. Cakung Kota Jakarta Timur, DKI Jakarta 13910",
    "email": "info@fowtedu.com",
    "description": "Solusi Pengembangan Skill dan Performa Karyawan. Dengan pendekatan holistik dan terstruktur, Fowtedu mendampingi profesional untuk mengoptimalkan kemampuan dan memberikan landasan yang kuat untuk mengembangkan kompetensi, meningkatkan produktivitas, dan mencapai kesuksesan karier.",
    "createdAt": "2023-11-09T03:43:36.140000Z",
    "updatedAt": "2024-01-25T10:42:45.513000Z"
  }
]