{
  "name": "SequelizeDatabaseError",
  "parent": {
    "length": 99,
    "name": "error",
    "severity": "ERROR",
    "code": "22001",
    "file": "varchar.c",
    "line": "641",
    "routine": "varchar",
    "sql": "INSERT INTO \"Blog_Posts\" (\"id\",\"created_at\",\"updated_at\",\"title\",\"content\",\"img_url\",\"category_id\",\"author_id\") VALUES (DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Uno Platform Error & Performance Monitoring with Raygun','The post provides a detailed guide on integrating Raygun for error and performance monitoring in Uno Platform applications, aiming to help developers enhance their productivity and application reliability. It highlights setup steps, key features, and benefits of using Raygun with Uno Platform.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522544/hacktiv8/blog/uno-platform-error-and-performance-monitoring-with-raygun-a1euieujac.jpg',3,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Using Web Authentication (OAuth2) to access Figma from Windows and Uno Platform Application','This post guides you through the process of using the Uno.Extensions web authentication package to simplify OAuth2 authentication and interact with the Figma API from a Windows and Uno Platform application. It covers configuring app settings, registering authentication and API endpoints, and handling token refreshes. The application setup allows logging into Figma and retrieving user information, demonstrating the benefits of using a streamlined web authentication flow.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522545/hacktiv8/blog/using-web-authentication-%28oauth2%29-to-access-figma-from-windows-and-uno-platform-application-qdd9qh80ggn.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','5.3 Release: Full Rider Support and 350+ Enhancements','The latest update to Uno Platform introduces over 350 enhancements, with significant additions including full support for JetBrains Rider, an improved Hot Reload experience, new UI controls (ItemsView and SelectorBar), and support for SkiaSharp 3 Previews. The release also simplifies Uno Platform versioning and shifts focus to .NET 9, discontinuing support for .NET 7.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522546/hacktiv8/blog/5.3-release:-full-rider-support-and-350%2B-enhancements-z2iv9s3uzo.jpg',14,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Webstudio: Open Source Webflow Alternative','Webstudio provides a visual tool that offers complete control over CSS properties, enables quick iterations without writing code, and delivers high optimization for search engines. It supports dynamic templates that change content based on URLs and allows data binding to components. Published sites are hosted separately for better performance and stability. Webstudio is free to start, scalable without hidden costs, and compliant with GDPR regulations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522547/hacktiv8/blog/webstudio:-open-source-webflow-alternative-g52w0otnom.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Mastering Microfrontends: 9 Patterns Every Developer Should Know','Microfrontend architecture allows independent frontend pieces to be developed by separate teams and integrated into a complete system, enabling faster releases and reduced complexity. The post explores nine integration patterns, such as Micro Apps, iFrames, App Shell, and Module Federation, highlighting their strengths and weaknesses. Each pattern addresses different aspects like autonomy, fault isolation, performance, technology compatibility, and flexibility. Combining multiple patterns can help leverage their strengths to meet specific project requirements and maintain long-term application efficiency.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522548/hacktiv8/blog/mastering-microfrontends:-9-patterns-every-developer-should-know-kcej72jd3kn.jpg',1,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Create beautiful images of your code','Learn how to create visually appealing images of your code using Raycast API. Customize by adjusting themes, background, dark mode, padding, and language to enhance readability.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522549/hacktiv8/blog/create-beautiful-images-of-your-code-w6vt6ez6bai.jpg',14,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','🌍 Introducing the New \"Globe Anime\" Component in Eldora UI! 🎨✨','Eldora UI has introduced Globe Anime, a new dynamic and visually appealing globe animation component for web applications. This component aims to enhance the visual experience for developers and designers. More details and integration can be found on the official Eldora UI site.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522550/hacktiv8/blog/introducing-the-new-%22globe-anime%22-component-in-eldora-ui%21-60wd4daiooo.jpg',1,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','🧠 Understanding JavaScript Proxies: Harnessing the Power of Metaprogramming','JavaScript Proxies allow developers to intercept and redefine fundamental operations on objects, offering a powerful tool for enhancing control and flexibility in applications. They are used for tasks like validation, data binding, tracing, debugging, and creating immutable objects. Understanding and using Proxies can significantly improve the dynamism of your JavaScript code.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522551/hacktiv8/blog/understanding-javascript-proxies:-harnessing-the-power-of-metaprogramming-k4xkpe7nij.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Prepare for Coding Interviews in 2024? (with Resources)','In today''s competitive job market, preparing for coding interviews requires a systematic approach. Key areas to focus on include Data Structures and Algorithms, High-Level Design (HLD), Low-Level Design (LLD), CS Fundamentals, and Behavioral questions. Utilize resources such as DesignGuru.io, notable books, video channels, and platforms like Leetcode, Codemia, and Pramp for comprehensive preparation. Mock interviews and company-specific preparation are also essential for success.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522552/hacktiv8/blog/how-to-prepare-for-coding-interviews-in-2024-%28with-resources%29-3xnstgvphql.jpg',16,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Cache Optimization on NextJS Without Vercel','Optimizing cache in a Next.js application, even without using Vercel, can significantly enhance load times, scalability, and user experience. Next.js offers several built-in features for caching, such as Static Site Generation (SSG) and Incremental Static Regeneration (ISR), which pre-render pages and update them in the background. Utilizing Cache-Control headers and client-side caching techniques like service workers and local storage can further improve performance. Integrating a Content Delivery Network (CDN) distributes static content globally, ensuring faster load times and reduced server load.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522553/hacktiv8/blog/cache-optimization-on-nextjs-without-vercel-kyn42zr1fi.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','stack-auth/stack: Open-source Clerk/Auth0 alternative','Stack Auth is an open-source, developer-friendly user authentication solution that supports Next.js frontends and backend integrations via REST API. It offers a quick setup and the flexibility to export and self-host user data at any time. The post provides comprehensive setup instructions including dependency installation through Docker, local development execution, and Prisma database initialization. Contributors are encouraged to join their Discord and follow contribution guidelines.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522554/hacktiv8/blog/stack-authstack:-open-source-clerkauth0-alternative-ta07y0g5bir.jpg',3,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','10 modern Node.js runtime features to start using in 2024','Explore 10 modern Node.js runtime features to start using in 2024. Includes the Node.js test runner, native mocking, test coverage, watch mode, .env loader, import.meta support, native timers with promises, permissions model, and policy module.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522554/hacktiv8/blog/10-modern-node.js-runtime-features-to-start-using-in-2024-mwnkeh7jqho.jpg',13,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Pines - A beautiful UI library for Alpine and Tailwind','Pines is a library of animations, sliders, tooltips, accordions, modals, and more! It''s a set of UI elements that can be copy and pasted into any Alpine and Tailwind projects. This is Pines''s first launch.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522555/hacktiv8/blog/pines-a-beautiful-ui-library-for-alpine-and-tailwind-7xxflwk33z.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Performance Benchmarks: Comparing Query Latency across TypeScript ORMs & Databases','Performance benchmarks compare query latencies of three TypeScript ORMs (Prisma, TypeORM, Drizzle) across PostgreSQL databases on AWS RDS, Supabase, and Neon. Benchmarking methodology includes 14 queries, executed 500 times on an EC2 instance to measure query latencies. Results show that performance varies based on the specific query, dataset, schema, and infrastructure. Most queries perform similarly across different ORMs, with some exceptions like ''Nested find all'' queries. Factors such as network latency and limited API features impact the results. Prisma Optimize offers insights and recommendations for better query performance.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522556/hacktiv8/blog/performance-benchmarks:-comparing-query-latency-across-typescript-orms-and-databases-9vr3sbjqk1p.jpg',15,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Tauri 2.0 Release Candidate','Tauri 2.0 has reached its release candidate phase after extensive beta and alpha testing. The focus now is on documentation and fixing critical bugs before the stable release planned for the end of August. Significant changes include the restructuring of core plugins and improvements in mobile development capabilities. An external security audit has also been completed, with all findings addressed. The Tauri team encourages community involvement and contributions to help improve the project further.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522557/hacktiv8/blog/tauri-2.0-release-candidate-f88l6umwdvw.jpg',2,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Introducing UI Coverage','UI Coverage by Cypress introduces a visual approach to test coverage, helping development teams analyze and report on untested areas in their applications. It automatically detects which pages and elements remain untested, providing a dynamic visual map to highlight gaps. This tool simplifies setup, offers instant coverage reports without additional configuration, and enables teams to make data-driven decisions for comprehensive testing and efficient resource allocation.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522559/hacktiv8/blog/introducing-ui-coverage-zj0bxjl7j9.jpg',13,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','v0.dev by Vercel Labs','v0.dev by Vercel Labs A Tweet UI 14 hours ago A cookie consent banner 19 hours ago a sleek pricing page for a SaaS. 18 hours ago. A table of financial invoices 1 hour ago A simple music player 15 hours ago.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522562/hacktiv8/blog/v0.dev-by-vercel-labs-6wo1m0gex5a.jpg',17,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','JavaScript design patterns guide','Developers use design patterns as reusable solutions to common problems. This guide demonstrates several JavaScript design patterns, including creational (factory and builder), structural (adapter and decorator), and behavioral (chain of responsibility and strategy) patterns. Each pattern is illustrated with practical code examples to aid understanding.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522564/hacktiv8/blog/javascript-design-patterns-guide-68qka5puo0x.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','jodigiordano/gg: The software architecture simulator','gg is a light software architecture simulator designed for documentation and presentation purposes. Although still in its proof-of-concept phase, it allows users to define various software architectures and create step-by-step presentations of different usage scenarios. The tool can be started by cloning the repository, installing dependencies, and running the development server.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522565/hacktiv8/blog/jodigiordanogg:-the-software-architecture-simulator-6agl9h0jh6o.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','As a dev, sometimes what keeps me from building something is not having a design to riff off of. This seems like a super cool tool to quickly generate a UI to get things started. Feels like a good starting point and a quick way to remove that mental block!','OpenUI allows users to describe UI using their imagination and see it rendered live. It can convert HTML to various languages like React, Svelte, and Web Components.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522566/hacktiv8/blog/as-a-dev-sometimes-what-keeps-me-from-building-something-is-not-having-a-design-to-riff-off-of.-thi-r1hbprhttes.jpg',18,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','My first experience as a Tech Lead','The author shares their experiences and insights from their journey of becoming a tech lead. Emphasizing the importance of soft skills, they discuss the nuances involved in evaluating candidates, the distinction between junior and senior developers, and their personal anecdote of leading a project for the first time. Valuable lessons from various types of senior developers are also recounted.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522567/hacktiv8/blog/my-first-experience-as-a-tech-lead-1yli648p84y.jpg',16,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','AI Studio','AI Studio allows users to create custom AI characters for Instagram, Messenger, and WhatsApp in the US. Content creators can build AIs to engage their audience by mimicking their tone and expressions. The platform provides a step-by-step guide, offering full customization and control over the AI''s behavior. It also supports the latest Generative AI capabilities, making it easy for anyone to craft conversational AIs based on personal interests.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522568/hacktiv8/blog/ai-studio-gc744ooy785.jpg',6,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','xkcd: CrowdStrike','The post informs readers that xkcd comics are licensed under the Creative Commons Attribution-NonCommercial 2.5 License, allowing free copying and sharing but restricting commercial use.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522569/hacktiv8/blog/xkcd:-crowdstrike-ag3y0deowjl.png',18,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Animations and effects for your tooltips components.','Popply is a new open-source library designed to add dynamic animations and effects to tooltips, enhancing UI and web pages. Created for the web development community, it offers a range of input and output animations for more engaging tooltips. Contributions and feedback are welcome, and the library is available on GitHub.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522570/hacktiv8/blog/animations-and-effects-for-your-tooltips-components.-hcgkn8mzi8u.jpg',1,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Perfio - Web Vitals and Performance Monitoring','Perfio is a new tool, debuted on August 3rd, 2024, designed for web vitals and performance monitoring. It caters to analytics, developer tools, and web design, offering insights to improve website performance.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522571/hacktiv8/blog/perfio-web-vitals-and-performance-monitoring-g8ye3islekp.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Why use displayName when building React components?','The displayName property in React components improves debugging and error messages by providing clear identifiers for components. It is utilized by React DevTools for better navigation and understanding of component hierarchies, and also aids in debugging context objects within the Context API. ESLint rules like react/display-name enforce the use of displayName to maintain consistency in large projects.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522572/hacktiv8/blog/why-use-displayname-when-building-react-components-6dri2y6ykm9.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The final boss of build tools','Vite has rapidly become a key foundation for higher-level innovations in the web ecosystem, with many frameworks adopting it. The Vite team plans to create a unified toolchain for handling JavaScript and TypeScript from source to production. Meanwhile, Neon offers a managed Postgres service designed to simplify database management tasks. Additionally, recent tech updates include new JavaScript tools, TypeScript 5.6 beta features, and insights from the Stack Overflow 2024 Developer Survey.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522573/hacktiv8/blog/the-final-boss-of-build-tools-78qd06ronka.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','PWABuilder','PWABuilder is a tool designed to help developers create Progressive Web Apps (PWAs) easily. It provides a user-friendly interface and various resources to streamline the process of building and deploying PWAs.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522575/hacktiv8/blog/pwabuilder-4v4jfmifo76.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','LLM Portfolio Projects Ideas to Wow Employers','Discover diverse AI project ideas that can be built using Python and various open-source tools like LangChain, FastAPI, OpenAI API, and Hugging Face. From fine-tuning Llama 3 and creating Q&A retrieval systems to building YouTube summarizers and vacation planning assistants, these projects are designed to enhance your portfolio and impress potential employers. Each project comes with guides or sample links to aid in development, making AI more accessible even to those with fundamental Python skills.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522576/hacktiv8/blog/llm-portfolio-projects-ideas-to-wow-employers-hg9c12ek78j.jpg',6,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','I Found the Best Apps for Productivity in 2024','Discover some lesser-known but highly effective productivity apps for 2024. The list includes tools like Audionotes for turning speech into text, Typeframes for AI-driven video creation, and CompressX for media compression. Additionally, explore apps like ReplyGuy for managing online conversations, Motion for organizing tasks and calendars, and Brain.fm for AI-generated focus music. Each app offers unique features designed to streamline tasks and boost productivity.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522576/hacktiv8/blog/i-found-the-best-apps-for-productivity-in-2024-9qx3kjknqri.jpg',6,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','(comic) Mindset makes all the difference','Comics about work, created with love and fueled by lots of coffee, illustrate how mindset can make a significant difference in the workplace.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522578/hacktiv8/blog/%28comic%29-mindset-makes-all-the-difference-q71cd7ee3ri.jpg',18,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Meet Reworkd: An AI Startup that Automates End-to-end Data Extraction','Reworkd AI is an AI startup that automates the entire web data extraction process. The platform can automatically create and update scraping code in response to website changes, offering a no-code, easy-to-use interface. It streamlines web data pipelines, managing website scans, code generation, data validation, and export. Additional features include self-healing scrapers, scheduling, deduplication, and automated proxy handling. Reworkd simplifies and enhances scalable data extraction, making it accessible for businesses of all sizes.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522579/hacktiv8/blog/meet-reworkd:-an-ai-startup-that-automates-end-to-end-data-extraction-t8pc06m9sh.jpg',6,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Build an Invoice SaaS App with Next.js, Resend, Clerk and Neon Postgres','This tutorial guides you through building a complete invoicing web application using Next.js, Resend, Clerk, and Neon Postgres. Key functionalities include managing customers, creating invoices, printing and sending invoices via email, and handling real-time communication between the frontend and backend. You''ll gain experience with setting up a Postgres database, implementing user authentication with Clerk, and using React-to-print for PDF generation.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522580/hacktiv8/blog/how-to-build-an-invoice-saas-app-with-next.js-resend-clerk-and-neon-postgres-r75be0hp7tp.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Twill — An open source CMS toolkit for Laravel','Twill is an open-source CMS toolkit for Laravel that offers a seamless experience for publishers, designers, and developers. It provides intuitive and powerful publishing tools, design controls, and developer-friendly configurations. Twill can streamline digital workflows, making it easier to manage digital content and launch products efficiently. It is designed to save time and involve entire teams in content management.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522581/hacktiv8/blog/twill-an-open-source-cms-toolkit-for-laravel-nvmivbhu36.png',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Productivity apps I use in 2024','The author shares their current productivity toolset for 2024, highlighting the apps they use daily across both PC and Mac platforms. Key tools include Obsidian for note-taking, Dabble.me for journaling, Raindrop for bookmark management, Notion Calendar for scheduling, Sukha for task-focused flow states, and todometer for task management. The author emphasizes the importance of reassessing and committing to your toolset regularly.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522583/hacktiv8/blog/the-productivity-apps-i-use-in-2024-kxt2vgqwks.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','System Design Interview: Design WhatsApp','This post outlines how to design a high-level system architecture for a messaging app similar to WhatsApp. Key points include handling 10 billion messages daily with plans to double, using RESTful APIs for compatibility, employing WebSockets for real-time communication, and using message queues like Kafka or RabbitMQ for efficient message distribution. The databases considered are NoSQL options like Cassandra and DynamoDB, emphasizing sharding and partitioning for scalability. End-to-end encryption, handling peak traffic, and future enhancements like group chats and media handling are also discussed.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522584/hacktiv8/blog/system-design-interview:-design-whatsapp-cb1x7n4d629.jpg',18,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','This application is built using Next.js, Shadcn, tRPC, Drizzle, and Neon. Designed as an admin interface, it provides a robust and reusable foundation for your new projects.','A comprehensive guide for setting up and running a Next.js Admin Panel Fullstack Project. This template utilizes technologies such as Shadcn, tRPC, Drizzle, and Neon, providing a strong foundation for admin interface projects. Instructions include starting the development server, configuring environment variables, and running tests.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522584/hacktiv8/blog/this-application-is-built-using-next.js-shadcn-trpc-drizzle-and-neon.-designed-as-an-admin-inter-knbq7coikbj.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How I made our React app more performant (includes INP)','The author shares steps to optimize a React app by reducing unnecessary re-renders, especially in a chat layout. Techniques include using React DevTools for profiling, moving state into the appropriate components, and understanding the browser''s rendering process through Interaction to Next Paint (INP). Key advice involves colocating state, measuring performance before optimizing, and understanding the rendering process for effective optimization.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522585/hacktiv8/blog/how-i-made-our-react-app-more-performant-%28includes-inp%29-8j90pmuec1u.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','New in Chrome 127','Chrome 127 introduces improvements for developers including the `font-size-adjust` CSS property for better fallback font legibility, user activation propagation between picture-in-picture documents and their opener, and making scroll containers keyboard focusable by default to enhance accessibility.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522587/hacktiv8/blog/new-in-chrome-127-egl4b9rvh8o.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to build a tech stack for a remote startup','Building a remote startup involves choosing the right tools for communication, organization, and collaboration. Essential tools recommended include Discord for team communication, Linear for task tracking, Figma for design and collaboration, Notion for document management, and Loom for asynchronous information sharing. Additionally, Appwrite''s own backend solutions, Attio for CRM, GitHub Teams for open source contributions, Plausible for privacy-focused analytics, and Dub.co for link-building are highlighted for enhancing remote operations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522587/hacktiv8/blog/how-to-build-a-tech-stack-for-a-remote-startup-q0qvuhsnyhi.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Announcing River UI','River UI provides a user-friendly interface for managing SQL-backed job queues, featuring a backend Go API and a frontend built with React and TypeScript. It allows users to monitor job states, interact by cancelling, retrying, or deleting jobs, and offers features like pausing queues during issues. River UI is available as a Docker image and a pre-built static binary, with future enhancements planned.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522589/hacktiv8/blog/announcing-river-ui-bnwtpgopvga.jpg',3,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','UUIDv7 in 20 languages','UUIDv7 is a 128-bit unique identifier that is time-sortable with 1 ms precision. It can be used as record identifiers in databases, including distributed ones. The post provides an implementation of UUIDv7 in 20 different programming languages.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522589/hacktiv8/blog/uuidv7-in-20-languages-7coq9wmyu3u.jpg',14,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A Gentle Intro to TypeScript','TypeScript enhances JavaScript by adding type annotations that catch errors during compilation, making code more robust and easier to read. Switching to TypeScript involves adding type annotations to your functions, which the TypeScript compiler uses to infer types and ensure only valid operations. This can prevent entire categories of bugs frequently encountered in JavaScript. Tools like Deno and Vite simplify TypeScript adoption by automatically handling TypeScript to JavaScript compilation.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522590/hacktiv8/blog/a-gentle-intro-to-typescript-nnhxf4jmteo.jpg',1,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Secret knowledge to self-host Next.js','Learn how to self-host Next.js applications outside of Vercel. The guide covers deploying to both servers and serverless functions, detailing the setup required for production readiness, including image optimization, caching, CDN configuration, middleware, and redirect and rewrite configurations. It also discusses the tradeoffs between server and serverless deployments and provides tips for efficient server management.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522592/hacktiv8/blog/secret-knowledge-to-self-host-next.js-5n9q9lt68pf.jpg',8,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Mastering Next.js and Beyond: An interview with Lee Robinson','Lee Robinson discusses the challenges and opportunities in software development, the impact of AI, machine learning, and blockchain on software engineering, and the reasons for considering Next.js.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522593/hacktiv8/blog/mastering-next.js-and-beyond:-an-interview-with-lee-robinson-xl7imddeef.jpg',5,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A JavaScript Quine Clock','A JavaScript Quine Clock is a unique clock that uses self-replicating code to display the time. The code continuously updates and generates the current time in a visually appealing way.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522594/hacktiv8/blog/a-javascript-quine-clock-dlqbs84vekh.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Web Frameworks, JavaScript Utilities, Uncats','Issue #573 of Insanely Cool Tools brings a curated collection of unique tools and utilities designed to enhance productivity and spark creativity. Highlights include a range of web frameworks like Next.js boilerplates, customizable React components, and typesafe full-stack setups. The JavaScript utilities section features tools like a rich text editor, barcode scanning, and consent banner utilities. Additionally, uncategorizable tools such as a local development tool for WordPress and an open-source alternative to Netlify are featured.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522595/hacktiv8/blog/web-frameworks-javascript-utilities-uncats-prp6aet4r4o.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Blacksmith - Faster and cheaper hosted GitHub Actions runners','Blacksmith offers faster and cheaper hosted GitHub Actions runners. It was launched on July 24th, 2024, and falls under SaaS and Developer Tools categories. This marks Blacksmith''s initial launch.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522596/hacktiv8/blog/blacksmith-faster-and-cheaper-hosted-github-actions-runners-ob0ojb4zilk.jpg',3,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The 5 Most Anticipated New Features In Strapi 5','Strapi 5 introduces several anticipated features, including content versioning, a new Document Service API, an easier data response structure, partial support for Relay-style GraphQL queries, and a CLI upgrade tool. These enhancements address common challenges and streamline the content management process, making it easier for users to manage drafts, rollback content, count documents, and upgrade versions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522597/hacktiv8/blog/the-5-most-anticipated-new-features-in-strapi-5-ak5rcqpgzgs.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Learn Asynchronous JavaScript','Mastering asynchronous programming is essential for modern JavaScript development, providing efficiencies and responsiveness. A new freeCodeCamp.org YouTube course offers a comprehensive guide, covering synchronous vs asynchronous programming, callbacks, promises, async/await, and the Fetch API. It includes practical projects with APIs like Chuck Norris API, Weather API, and Pokedex API to reinforce learning.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522598/hacktiv8/blog/learn-asynchronous-javascript-5h1ndmdsy3b.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','From ESLint and Prettier to Biome','A developer shares their experience migrating from ESLint and Prettier to Biome, highlighting the simplicity, good defaults, and error messages of Biome. They also mention the drawbacks, such as the use of JSON for configuration and the lack of some ESLint features. The post provides information on how to set up Biome and how it handles linting staged files. Overall, the migration was smooth and the developer recommends giving Biome a try.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522599/hacktiv8/blog/from-eslint-and-prettier-to-biome-ju2qczjvxx.jpg',14,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A JavaScript developer tries Go for the first time','A JavaScript developer shares their first impressions of the Go programming language, highlighting its error handling, defer statement, explicit type conversion, switch statement, pointers, simple type system, and consistent approach to coding.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522600/hacktiv8/blog/a-javascript-developer-tries-go-for-the-first-time-f0eshgj7qch.jpg',14,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Vite + React + TS','Combining Vite with React and TypeScript offers a powerful and efficient development setup. Vite provides a fast build tool while TypeScript enhances code quality in React applications. This combination ensures a smoother and more performant developer experience.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522600/hacktiv8/blog/vite-%2B-react-%2B-ts-5jf8nitv2mw.jpg',1,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','useplunk/plunk: The Open-Source Email Platform','Plunk is an open-source email platform built on AWS SES for sending emails from applications. It supports transactional emails, automations, and broadcasts. The platform can be self-hosted using the driaug/plunk Docker image, and detailed deployment instructions are available in the documentation. Contributions are encouraged, with guidelines provided in CONTRIBUTING.md.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522601/hacktiv8/blog/useplunkplunk:-the-open-source-email-platform-e8ukh7amg1.jpg',3,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Never trust Frontend code','A developer investigates an unusual error where a user attempted to purchase an item with the wrong currency, revealing vulnerabilities in client-side code. The solution uncovered shows the importance of not trusting frontend code and placing strong restrictions on what APIs can accept. The investigation emphasized using server-side code for critical operations to enhance security.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522602/hacktiv8/blog/never-trust-frontend-code-lazt3rumnt.jpg',7,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Advanced Animation Techniques with Anime.js','Learn about advanced animation techniques using the anime.js library. Discover common animations on modern websites, the importance of mastering advanced animation in web development, and explore keyframe animations, easing functions, staggering animations, path animations, and SVG morphing animations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522603/hacktiv8/blog/advanced-animation-techniques-with-anime.js-k54gfkg77z.jpg',1,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Tiny macOS utility apps I love - Part 1','This post marks the beginning of a series highlighting tiny macOS utility apps that enhance productivity. It covers three apps: PixelSnap, for precise on-screen measurements; CleanShot, a feature-rich screenshot utility; and Paletro, which consolidates keyboard shortcuts across apps into a single command palette. These apps streamline workflows and integrate seamlessly into various design and development tasks.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522604/hacktiv8/blog/tiny-macos-utility-apps-i-love-part-1-4hkckj0x2ap.jpg',18,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Web Workers, Comlink, Vite and TanStack Query','Discover how to use Web Workers with Comlink and TanStack Query in a Vite-built project. Learn to offload expensive computations to Web Workers, enhancing UI performance without blocking the main thread. The post details the setup, including using vite-plugin-comlink for smoother integration, and demonstrates using TanStack Query to manage async data interactions effectively.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522605/hacktiv8/blog/web-workers-comlink-vite-and-tanstack-query-ds1j2fvh4fa.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','7 Web Dev Tools You Didn’t Know You Needed','Discover seven lesser-known web development tools designed to enhance your coding efficiency and creativity. Tools like WhatFont for identifying web fonts, GitKraken for simplifying Git workflows, JSON Schema for validating JSON data, BrowserStack for cross-browser testing, Insomnia for API debugging, Squoosh for image optimization, and Storybook for UI component management are highlighted. These tools offer numerous features to improve your projects and streamline your development process.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522605/hacktiv8/blog/7-web-dev-tools-you-didn%27t-know-you-needed-m6fuvprp6n.jpg',1,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Build Your Own React State Management Library in Under 40 Lines of Code - With Typescript Support','Learn how to build your own React state management library in under 40 lines of code with TypeScript support. Explore the use of the useSyncExternalStore hook and why React context may not be the best option for state management.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522606/hacktiv8/blog/build-your-own-react-state-management-library-in-under-40-lines-of-code-with-typescript-support-2cmn386m79c.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Ultimate Price Tracker','RupeeSpot offers a comprehensive collection of current top deals from popular e-commerce stores such as Amazon, Flipkart, Ajio, Nike, and Croma. The platform aims to help users find significant discounts on a variety of products including fashion, beauty, and travel accessories. Highlighted deals include a wide range of products with details on discounts and ratings.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522607/hacktiv8/blog/the-ultimate-price-tracker-wjpcsofq8wm.jpg',19,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Storybook 8.2','Storybook 8.2 introduces several enhancements aimed at improving component testing, including new test hooks, portable stories for React, Vue 3, and Svelte, and consolidated dependency management. The release also features a streamlined onboarding process, an improved website with better documentation, and numerous other improvements and bug fixes. Developers can try the new version by initializing a new project or upgrading an existing one using Storybook''s CLI.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522608/hacktiv8/blog/storybook-8.2-il99k9sn8li.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','taubyte/tau: Open source distributed Platform as a Service (PaaS). A self-hosted Vercel / Netlify / Cloudflare alternative.','Tau is an open-source, distributed Platform as a Service (PaaS) designed to compete with major providers like Vercel, Netlify, and Cloudflare. It''s a developer-friendly framework focused on minimal configuration, auto-discovery, and peer-to-peer networking. Using Git for infrastructure management, Tau emphasizes local development and seamless production deployment. Features include WebAssembly support, content-addressed storage, and a plugin system for extensibility.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522609/hacktiv8/blog/taubytetau:-open-source-distributed-platform-as-a-service-%28paas%29.-a-self-hosted-vercel-netlify-su7lx3axtt.jpg',8,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','✧˚ Outstanding Portfolio for the inspiration - 05','Alana Goyal is the founder and managing partner of Basecase Capital, partnering with multiple companies such as Ashby, Astral, and Supabase. She contributes to open-source projects like Branded and Eventbase. Alana has a rich history in product management, having worked at Samsara, Greylock, Blend, AppDynamics, and Natera. She studied computer science at Columbia University.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522610/hacktiv8/blog/o-outstanding-portfolio-for-the-inspiration-05-w4kouasstq.jpg',16,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','JS Library Tools, Git/CLI, Build Tools','Discover new tools for JavaScript libraries, Git/CLI, and build tools. Highlights include Catena for type-safe APIs, Layer Cake for Svelte visualizations, several Git-related tools like ntcharts, Hookdeck CLI, superfile, and build tools including unplugin-parcel-macros and npm-check-extras. Also, learn about the Meco app for reading newsletters and commercial apps like Penify.dev and FILE0.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522610/hacktiv8/blog/js-library-tools-gitcli-build-tools-igr7j8mc3hq.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Add Facebook Pixel in Next.js 14 App Router','Learn how to integrate Facebook Pixel into your Next.js 14 app using the new App Router. The guide includes steps to create a Facebook Pixel, install it using Next.js''s <Script> component, and verify the installation to enhance your web tracking and marketing strategies.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522611/hacktiv8/blog/how-to-add-facebook-pixel-in-next.js-14-app-router-dylbnngcpt4.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Using qr-code: a customizable, animate-able HTML element','The `qr-code` library offers developers a way to create customizable, animated, and SVG-based QR codes that can be integrated into any modern web application. It provides various customization options, including color changes, custom shapes, and logo insertion. The library works across all major frontend frameworks such as React, Angular, and Svelte, and comes with a simple API for building animations. It also supports download and print features for generated QR codes, making it versatile for different use cases.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522612/hacktiv8/blog/using-qr-code:-a-customizable-animate-able-html-element-wr34pmlopi9.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Improved lazy loading','The post discusses the design and implementation of an ORM named Tempest, focusing on improved lazy loading mechanisms. The key approach includes using typed properties for static analysis, making minimal configuration necessary by inferring relations directly from property types and docblocks. It contrasts Tempest''s strict lazy loading with Laravel''s default approach which allows lazy loading, thereby preventing n+1 query problems and optimizing performance. The post also explores PHP''s technical details, including handling uninitialized properties and triggering property accessors for lazy loading.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522613/hacktiv8/blog/improved-lazy-loading-pg2corwok4.jpg',14,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Implement Directus Auth in Next.js 14','Learn how to implement Directus Auth in Next.js 14, register new users, and perform CRUD operations on posts.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522614/hacktiv8/blog/implement-directus-auth-in-next.js-14-ihhvjsgpzj.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Create a PC game using JavaScript','Learn to create a Flappy Bird-like game in JavaScript using the KAPLAY library and package it for PC installation with Tauri. The comprehensive course includes setting up the development environment, loading assets, implementing player logic, building the game, and creating a score UI. Suitable for beginners and experienced developers, this tutorial provides practical hands-on experience in game development and desktop application packaging.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522615/hacktiv8/blog/create-a-pc-game-using-javascript-9cvr4dfz9l.jpg',10,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Tried and tested, I highly recommend! 💪🏻','Codeium is a free AI-powered coding assistant that offers features similar to GitHub Copilot, including code completions, support for multiple programming languages, IDE integrations, and data encryption. It provides limitless code completions, chatbots for AI suggestions, and intelligent searches within IDEs. Unlike Copilot, it is free for individual users and offers enhanced functionalities and security compliance (SOC 2 Type II). It supports over 70 programming languages and offers various installation methods, including browser-based playground and IDE extensions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522616/hacktiv8/blog/tried-and-tested-i-highly-recommend%21-db7de3nxl2.jpg',6,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Storyblok live editing with Next.js App Router and React Server Components','Learn how to set up live editing support with Storyblok''s full React Server Components approach for Next.js. Two ways to set up a Next.js app with Storyblok. Clever solution to retain live editing support when using the server-side approach with Storyblok.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522617/hacktiv8/blog/storyblok-live-editing-with-next.js-app-router-and-react-server-components-kq49qg63knr.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Futures: await vs unawaited vs ignore','When calling a method that returns a Future, you can use ''await'', ''unawaited'', or ''ignore''. This choice affects how your code handles exceptions thrown by the Future. Understanding the differences is crucial for proper error handling in asynchronous programming.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522618/hacktiv8/blog/futures:-await-vs-unawaited-vs-ignore-xb9f7y8org.jpg',14,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','New without parentheses in PHP 8.4','PHP 8.4 introduces a feature allowing developers to create new objects without parentheses, simplifying code and enabling method chaining directly on newly created objects. This update extends to methods, properties, static methods, and even supports dynamic and anonymous classes. However, constructor brackets remain mandatory for class instantiation to avoid parsing ambiguities. Despite minor limitations, this syntactic sugar promises to enhance coding efficiency.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522619/hacktiv8/blog/new-without-parentheses-in-php-8.4-uivfs8kyq1i.jpg',14,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','SEESAW ✦ Design Inspiration','Discover a range of innovative and creative projects from diverse fields such as AI video analysis, electric road trips, sustainable living cabins, and much more. This daily updated list showcases exemplary work in web design, product design, branding, and technology, serving as a rich source of inspiration for designers and developers.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522621/hacktiv8/blog/seesaw-design-inspiration-lue5mo9kscq.jpg',18,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Uppy','Uppy is a sleek and modular open-source JavaScript file uploader that allows fetching files both locally and from remote sources like Dropbox or Instagram. It seamlessly integrates into existing stacks and offers features such as large file upload resilience, image editing, and generated thumbnails. Uppy is compatible with multiple frameworks including React and comes with Companion to simplify remote file handling and authentication. Built with accessibility and community-driven development, Uppy enhances file uploading with reliability and ease of use.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522622/hacktiv8/blog/uppy-68ji3s2p1e.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Node FINALLY Supports TypeScript',NULL,'https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522622/hacktiv8/blog/node-finally-supports-typescript-72zhf9fp2aj.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Optimizing Web Backends','The post discusses common techniques for optimizing web backend performance, focusing on issues related to high response times. It categorizes optimization strategies into three main layers: Application, Database, and Infrastructure. Key methods include optimizing algorithms, using asynchronous functions, leveraging concurrency, indexing databases, scaling databases, data compression, using CDNs, upgrading to HTTP/2 or HTTP/3, and replicating infrastructure. Continuous measurement and testing are emphasized to ensure effectiveness.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522623/hacktiv8/blog/optimizing-web-backends-f8e7oyxftka.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','(comic) Time check','Comics about work, created with love and fueled by lots of coffee. Subscribe to Work Chronicles for more entertaining and relatable comic strips.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522624/hacktiv8/blog/%28comic%29-time-check-0vn148g20hui.jpg',16,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Clean Code: 7 tips to write clean functions','Writing clean functions ensures that your code is readable, maintainable, and less prone to errors. Key tips include keeping functions small and well-named, limiting parameters, reducing nesting by returning early, writing pure functions without side effects, avoiding boolean flags, and using comments sparingly. Good coding is about communication between programmers, so clarity and simplicity are paramount.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522625/hacktiv8/blog/clean-code:-7-tips-to-write-clean-functions-sa4qcxp7f2.jpg',13,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','What’s New in React 19?','React 19 introduces async functions and the useTransition hook, revolutionizing state management and data handling. New features such as Actions for data mutations, optimistic updates with useOptimistic, streamlined form handling with useActionState, and server components enhance the development experience. The update also improves hydration error reporting, ref handling, stylesheet management, and support for custom elements and document metadata.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522626/hacktiv8/blog/what%27s-new-in-react-19-6q8n9jkrm7r.jpg',1,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Building fast, fuzzy site search with Laravel and Typesense','Learn how to create a fast and fuzzy search functionality in a Laravel application using Typesense. The author provides a step-by-step guide to setting up a Todo model, configuring Laravel Scout, and creating Laravel Controllers and Views to synchronize data with Typesense. This setup allows developers to easily implement advanced search features, including handling typographical errors, with minimal code changes.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522627/hacktiv8/blog/building-fast-fuzzy-site-search-with-laravel-and-typesense-8ctn3ffnm1n.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','7 Levels Of Engineers Describe Software’s Most Important Skill','Engineers from various levels at companies like Meta, Pinterest, Instacart, and Slack shared the most crucial skills for their positions. From learning existing patterns as a new grad to combining business acumen and technical expertise as a distinguished engineer, each level comes with unique challenges and advice for growth. Consistently, the importance of building relationships and understanding the business was emphasized as vital for career progression.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522628/hacktiv8/blog/7-levels-of-engineers-describe-software%27s-most-important-skill-6jzy0edldk6.jpg',16,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','I tried React Compiler today, and guess what… 😉','The article explores the use of React Compiler, a tool developed by the React core team, to solve the problem of unnecessary re-renders in React components. It discusses the installation process, provides examples of using React Compiler, and evaluates its effectiveness in real-world scenarios. The author concludes that while React Compiler can improve performance in some cases, manual memoization techniques such as React.memo, useMemo, and useCallback are still necessary to optimize component rendering.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522629/hacktiv8/blog/i-tried-react-compiler-today-and-guess-what...-4jp8q88oqpf.jpg',14,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Inverted border-radius using CSS mask','Learn how to use a CSS mask to create an inverted radius corner with minimal code, without the need for extra elements or pseudo-elements, and optimized with CSS variables.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522630/hacktiv8/blog/inverted-border-radius-using-css-mask-1cpymf6oiti.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Self-hosted Open Source Alternatives to Google Photos','To achieve a private Google Photos-like experience, consider using self-hosted, open-source alternatives like Immich, PhotoPrism, and Nextcloud Photos. These platforms offer varying features such as facial recognition, automatic backups, and mobile apps. Options like Chevereto and LibrePhotos cater to more simplistic needs, while Piwigo offers extensive customizability. Photoview and Lychee have their unique benefits, and Ente provides a hassle-free, encrypted cloud solution without the need for self-hosting.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522631/hacktiv8/blog/self-hosted-open-source-alternatives-to-google-photos-pu2etulehlp.jpg',8,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Explore new hooks coming up in React 19','React 19 introduces new hooks that streamline common tasks, such as handling form actions, tracking form submissions, and updating the UI with optimistic outcomes. These hooks save time, promote code reusability, and result in better user interfaces.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522632/hacktiv8/blog/explore-new-hooks-coming-up-in-react-19-7wr6jexavec.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','My Ongoing Project 🎉','RupeeSpot offers a comprehensive collection of current top deals from popular e-commerce stores such as Amazon, Flipkart, Ajio, Nike, and Croma. The platform aims to help users find significant discounts on a variety of products including fashion, beauty, and travel accessories. Highlighted deals include a wide range of products with details on discounts and ratings.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522633/hacktiv8/blog/my-ongoing-project-1zljcwnnhw8.jpg',19,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Zsh Shell Tricks I Wish I’d Known Earlier','Enhance your command-line productivity with Zsh! Zsh is a powerful Unix shell known for its robust features like command-line editing, spell checking, and programmable completion. This guide offers practical tips on cursor navigation, line editing, globbing, command history, parameter expansion, and custom commands. Learn to navigate directories efficiently, create and bind custom commands, and use Zsh’s advanced features to optimize your workflow. Whether you''re a developer, system administrator, DevOps engineer, or tech enthusiast, mastering Zsh can significantly boost your efficiency.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522634/hacktiv8/blog/the-zsh-shell-tricks-i-wish-i%27d-known-earlier-clb3wfwpbk.jpg',3,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','An Interactive guide to understanding SVG. How well do you know your SVG elements and attributes?','SVGs provide a scalable way to create graphics for the web with no loss in quality. This reference covers the most popular SVG elements like viewBox, circle, rect, line, polyline, and many more, detailing their attributes and uses. Each element is illustrated with code snippets to demonstrate its application.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522635/hacktiv8/blog/an-interactive-guide-to-understanding-svg.-how-well-do-you-know-your-svg-elements-and-attributes-mu21tdl07xh.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','click on any component to go to code.','LocatorJS is a Chrome Extension enabling developers to click on any component in their browser and directly open its code in VSCode. It supports React, Preact, Solid, Vue, and Svelte, working efficiently with Babel and modern React stacks like Vite, Next.js, or Create React App. This tool allows quick navigation within the codebase, boosting productivity. It is open-source under the MIT license and can be used in production-like environments with added support for styled-components.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522636/hacktiv8/blog/click-on-any-component-to-go-to-code.-ot8qqjt4r7s.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to set priorities?','Setting priorities is essential for achieving goals and reducing stress. Prioritization provides clarity, focus, and a better work-life balance. The post discusses several methods for prioritizing tasks: the Eisenhower Matrix helps differentiate urgent and important tasks; the 3-3-3 Rule focuses on critical work; the Ivy Lee Method involves ranking six tasks by importance. For leaders, techniques like the Pareto Principle and OKRs align team efforts with strategic goals. Teams can benefit from the ABCDE Method, MoSCoW Method, and RICE Framework. Combining these approaches can create a tailored, effective productivity system.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522637/hacktiv8/blog/how-to-set-priorities-a8x4qczub6g.jpg',16,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','6 books engineers should read','This post lists six essential books for engineers, emphasizing the depth and practical insights books provide compared to other mediums. Two recommended books are suitable for all experience levels: ''The Pragmatic Programmer'' and Dale Carnegie''s book on winning over colleagues. For senior engineers, four additional books are suggested to enhance leadership, responsibility, and decision-making skills: ''Extreme Ownership'', ''The Phoenix Project'', ''Software Engineering at Google'', and ''Thinking in Bets''. Readers are encouraged to delve deeper into these books for a comprehensive understanding.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522639/hacktiv8/blog/6-books-engineers-should-read-2pgqg93kqv2.jpg',16,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Announcing TypeScript 5.6 Beta','TypeScript 5.6 Beta introduces several new features including disallowed nullish and truthy checks, iterator helper methods, strict builtin iterator checks with the new --strictBuiltinIteratorReturn flag, support for arbitrary module identifiers, a new --noUncheckedSideEffectImports option, and a --noCheck option to skip type checking for faster builds. Region-prioritized diagnostics improve editor performance in large files, and TypeScript can now better handle complex project setups by searching ancestor configuration files for project ownership.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522640/hacktiv8/blog/announcing-typescript-5.6-beta-zmlx5me152l.jpg',14,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Differences Between ''Object'', ''{}'', and ''object'' in TypeScript','In TypeScript, ''Object'', ''{}'', and ''object'' serve distinct purposes. ''Object'' (uppercase) describes properties common to all JavaScript objects and can have boxable objects like string, boolean, etc. ''{}'' describes an object with no members and behaves similarly to ''Object'' but represents a different concept. ''object'' (lowercase) refers to any non-primitive type. ''Record<string, any>'' is also often used to represent non-primitive types and is more semantic.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522641/hacktiv8/blog/the-differences-between-%27object%27-%27%27-and-%27object%27-in-typescript-eluzdfgsm3a.jpg',14,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Practical Guide to Creating a Design System','Creating a design system involves selecting a suitable UI framework, defining both light and dark themes, and organizing the system into a reusable package. Using tools like Storybook for documentation and ensuring regression UI testing minimizes unexpected issues. Avoid custom CSS and components to reduce complexity and maintenance costs. While initially labor-intensive, this approach significantly reduces the marginal cost of developing new front-end pages.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522642/hacktiv8/blog/practical-guide-to-creating-a-design-system-o3xvbzbav7.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Benty Org - AI code generator and app builder','Benty Org is an AI-driven code generator and app builder featured on August 7th, 2024. It falls under Developer Tools, Artificial Intelligence, and Development categories. It was first launched on November 14th, 2023, but hasn''t been rated yet.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522642/hacktiv8/blog/benty-org-ai-code-generator-and-app-builder-7pvd61kfw3t.jpg',6,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Customize VS Code Settings – Real Python','Visual Studio Code is an open-source editor that can be tailored for Python development. This guide by instructor Philipp Acsany covers customizing VS Code settings to create a cleaner and more productive coding environment. Key topics include working with user settings, creating profiles, adjusting specific settings, cleaning up the interface, and exporting profiles for reuse. The course features 15 lessons, video subtitles, transcripts, downloadable resources, and a Q&A session with Python experts.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522643/hacktiv8/blog/customize-vs-code-settings-real-python-brz9axqchj.jpg',14,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Trending','Kreativa is an award-winning design studio that has been shaping digital products since 2008.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522644/hacktiv8/blog/trending-nd6abkpwya8.jpg',19,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Codeium: The Best Github Copilot Alternative','Codeium is a free AI-powered coding assistant that offers features similar to GitHub Copilot, including code completions, support for multiple programming languages, IDE integrations, and data encryption. It provides limitless code completions, chatbots for AI suggestions, and intelligent searches within IDEs. Unlike Copilot, it is free for individual users and offers enhanced functionalities and security compliance (SOC 2 Type II). It supports over 70 programming languages and offers various installation methods, including browser-based playground and IDE extensions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522646/hacktiv8/blog/codeium:-the-best-github-copilot-alternative-mqsfbamoloh.jpg',6,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Figma fiasco.','Figma''s latest updates, featuring new AI capabilities and a revamped user interface, have generated significant dissatisfaction among users. Critics argue that the changes prioritize profit over user experience, complicate simple tasks, and cater to non-designers. The restructured UI and AI functionalities are considered not only unnecessary but also detrimental to the workflow of professional designers. Many are considering alternatives like Penpot and Sketch due to these frustrations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522647/hacktiv8/blog/figma-fiasco.-y15xum1p3q.jpg',18,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Million.js adoption guide: Overview, examples, and alternatives','Million.js is an open source, minimalistic JavaScript compiler designed to enhance React performance by reducing memory usage and improving rendering speed. It uses a granular approach for DOM updates and introduces the concept of block components, which are optimized higher-order components. While it offers various advantages, including low memory usage and efficient updates, it has some drawbacks and a limited feature set compared to other frameworks like React, Preact, and Vue.js. The guide provides steps for getting started with Million.js and offers a comparison with other popular frameworks.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522648/hacktiv8/blog/million.js-adoption-guide:-overview-examples-and-alternatives-zkcp2c1akva.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to access search params in Next.js layouts','In Next.js, layouts remain the same across route changes and don''t re-render, which means they can''t directly access search parameters. To access search params, you should use client components which handle these dynamic changes without requiring the entire layout to re-render.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522649/hacktiv8/blog/how-to-access-search-params-in-next.js-layouts-kw6beaeazi.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','ChatGPT is bullshit','Large language models like ChatGPT are producing falsehoods more accurately described as ''bullshit'' rather than ''hallucinations''. These models generate human-like text by analyzing probabilities rather than aiming for truth. Describing their inaccuracies as bullshit is argued to be a more useful framework for understanding and discussing their behavior, particularly since these models are designed to produce convincing text rather than accurate information.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522650/hacktiv8/blog/chatgpt-is-bullshit-dr8mpor98sw.jpg',6,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Exploring the Creative Potential of Atropos.js for Web Design','Explore the creative potential of Atropos.js in web design. Atropos.js is a versatile JavaScript library that enhances web design with scroll-based animations, parallax effects, and seamless integration with popular frameworks. It facilitates the creation of unique and memorable user experiences, improves website performance, and offers design flexibility. Learn how to build a scroll-based gallery using Atropos.js, Axios, and React.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522651/hacktiv8/blog/exploring-the-creative-potential-of-atropos.js-for-web-design-dbds9fhs7z.jpg',1,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Private cloud for your photos, videos and more','Ente Auth is an open-source 2FA authenticator offering end-to-end encrypted backups and cross-platform sync. It allows users to view next authentication codes, easily identify tokens by icons, organize them with tags, pin favorite services, and use a search function. It supports offline mode and import of tokens via QR code, manual entry, or bulk import. Ente is fully open-source, allowing data export and import without lock-ins.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522652/hacktiv8/blog/private-cloud-for-your-photos-videos-and-more-en3djb15jvk.jpg',8,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','From Web to Native with React','React Native enables web developers with experience in React to create native mobile apps using JavaScript or TypeScript. It allows for multi-platform code sharing between iOS and Android from a single codebase. Expo is recommended as a framework to bridge the gaps in React Native core capabilities, providing essential tools for production apps. Key differences between web and native development include the use of UI primitives and styling methods. Developers should avoid certain common pitfalls, such as using array.map for rendering large lists or the logical AND operator in rendering. Key native-specific concepts include build signing, deep linking, gestures, haptics, and handling the on-screen keyboard.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522653/hacktiv8/blog/from-web-to-native-with-react-ta5k2fibxch.jpg',2,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to animate width: auto using React, Next.js and Framer Motion','Learn how to animate the ''width: auto'' property using React, Next.js, and Framer Motion. This guide walks you through setting up a Next.js project, adding necessary HTML and CSS, and implementing animations using Framer Motion to create dynamic and visually pleasing transitions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522654/hacktiv8/blog/how-to-animate-width:-auto-using-react-next.js-and-framer-motion-s1dbiveb679.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','(comic) Cold Calls','Enjoy comics about work that are made with dedication and a love for coffee. Subscribe to Work Chronicles for more amusing content.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522655/hacktiv8/blog/%28comic%29-cold-calls-dhwdwrdp6ta.jpg',20,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','🚀 Create An Attractive GitHub Profile README 📝','Enhance your GitHub profile with a standout README using a comprehensive custom template. Your README is crucial for making a great first impression on potential employers and collaborators. Start by setting up a special README repository named exactly as your GitHub username. Add a warm introduction, an ''About Me'' section, and detailed sections for resume, experience, coding handles, and tech stack. Highlight key projects, show stats and activity, and end with social links and contact information. Utilize GitHub Actions for automating recent activities and merged PRs. Incorporate additional elements like jokes or Spotify music for a personal touch. Follow the guide for a visually appealing and organized README.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522656/hacktiv8/blog/create-an-attractive-github-profile-readme-8uf7ks6pg55.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Node.js is Not Single-Threaded','Node.js, often perceived as a single-threaded platform, utilizes an event-driven, non-blocking architecture to handle I/O operations efficiently. While it manages most operations via a single thread, it also employs the libuv library, which uses an event demultiplexer and a thread pool for certain operations (like file I/O or DNS queries) that can''t be handled asynchronously. This allows Node.js to maximize resource utilization and handle multiple client requests concurrently.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522657/hacktiv8/blog/node.js-is-not-single-threaded-jhqkqg503bj.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','I''m tired of it','AI-generated content is pervasive, often creating bland, inaccurate articles that lack true value. The author criticizes this trend, emphasizing the importance of human-crafted content that showcases effort and unique perspectives. Highlighting examples of pointless AI-generated articles and the inefficiency of email communication due to AI, the appeal is to maintain authenticity and personal touch in writing.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522658/hacktiv8/blog/i%27m-tired-of-it-gja5aibc44q.png',6,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','darrenburns/posting: The modern API client that lives in your terminal.','Posting is a terminal-based HTTP client designed for efficient keyboard-centric interactions. It stores requests locally in YAML files, ensuring easy version control. Key features include ''jump mode'' navigation, environment/variable management with autocompletion, various themes, and a command palette. Installation requires Python 3.11 or later and can be done using pipx. Users can also import OpenAPI 3.x specifications to create collections. Configuration is flexible, supporting YAML files, environment variables, and .env files.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522659/hacktiv8/blog/darrenburnsposting:-the-modern-api-client-that-lives-in-your-terminal.-51i832lh2x.jpg',13,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Ascendio - Ascend a turborepo project in seconds','Ascendio is a SaaS tool launched on August 7th, 2024, designed to help developers manage turborepo projects efficiently. It is the first version of this developer tool aiming to simplify and speed up turborepo project workflows.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522660/hacktiv8/blog/ascendio-ascend-a-turborepo-project-in-seconds-seejsvdh5jl.jpg',21,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Handling file uploads in Next.js using UploadThing','UploadThing is an open-source tool designed to simplify file uploads in full-stack TypeScript applications. By leveraging this tool, developers can effortlessly handle file uploads, manage authentication, and maintain a seamless user experience. UploadThing integrates well with Next.js, and it offers customizable upload parameters, secure storage solutions, and serverless functions to handle various processes like metadata storage and callback notifications. The guide demonstrates setting up UploadThing, integrating it with Next.js, and utilizing components to upload and manage files effectively.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522660/hacktiv8/blog/handling-file-uploads-in-next.js-using-uploadthing-8uuzgcdhpc.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Announcing: A new Init. Faster. Smoother. Better.','Appwrite announced a new Init event happening from August 19 to 23, 2024. Over five days, they will reveal new products, features, and potentially new SDKs. The event includes exciting Discord sessions with special guests, a live coding session by Dennis Ivy, and exclusive swag giveaways. Participants need a unique ticket to join and can register online.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522661/hacktiv8/blog/announcing:-a-new-init.-faster.-smoother.-better.-316j656rzcx.jpg',21,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How Google handles JavaScript throughout the indexing process – Vercel','Understanding how search engines crawl, render, and index web pages is vital for optimizing sites for SEO. Google has significantly evolved in rendering capabilities over the years, now using modern Chrome for rendering all HTML pages and dynamically loaded content. Key findings debunk myths like Google''s inability to render JavaScript, and show that there is no fundamental difference in how JavaScript-heavy pages are treated compared to static HTML. Recommendations include using JavaScript frameworks freely, ensuring critical resources are not blocked, and using server-side rendering for critical SEO elements.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522662/hacktiv8/blog/how-google-handles-javascript-throughout-the-indexing-process-vercel-hrqwsxlery.png',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Talos Linux','Talos Linux is a minimal, secure, and immutable operating system designed for Kubernetes. It supports multiple platforms including cloud, bare metal, and virtualization. All system management is performed through a secure API with mutual TLS authentication, eliminating the need for SSH or console access. Talos follows a hardened, immutable infrastructure approach, runs entirely in memory, and consistently delivers the latest stable versions of Kubernetes and Linux.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522663/hacktiv8/blog/talos-linux-45bskhktyy3.jpg',3,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','ezjson - JSON parsing, formatting, sorting and comparing','ezjson is a newly launched tool designed to simplify JSON parsing, formatting, sorting, and comparing. It aims to enhance productivity for developers by providing an easy-to-use interface for working with JSON data.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522664/hacktiv8/blog/ezjson-json-parsing-formatting-sorting-and-comparing-ya5siriv2vp.jpg',21,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Using tRPC for Backend Requests with React','This post explores the integration of tRPC into React applications, emphasizing its benefits in simplifying API communication and enhancing developer productivity. Topics covered include the workflow of tRPC in the frontend context, the benefits of using tRPC compared to traditional API communication methods, setting up tRPC in a React application, and advanced features like real-time data synchronization, security, error handling, and debugging.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522665/hacktiv8/blog/using-trpc-for-backend-requests-with-react-dfrcv3ub5em.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Optimizing React Context and Re-renders','Learn how to optimize React Context to minimize re-renders. The post covers evaluating the causes of re-renders, splitting context into multiple contexts, using the useMemo hook for memoizing context values, and leveraging React.memo for state from higher components. Practical code examples are provided to demonstrate these optimization techniques.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522666/hacktiv8/blog/optimizing-react-context-and-re-renders-gknpq11pte.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A JavaScript developer tries Go for the first time','A software developer with extensive JavaScript experience shares his first impressions on learning Go. Highlights include Go''s approach to error handling with errors as values, the utility of defer statements for resource management, and the requirement for explicit type conversion. The developer appreciates Go''s simplicity, readability, and the fact that it enforces one way to do things, which is beneficial for large teams working on complex codebases.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522667/hacktiv8/blog/a-javascript-developer-tries-go-for-the-first-time-gjzl1qgty0r.jpg',14,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','50 Best Websites for Web Design Inspiration and Ideas','Discover a curated list of 50 best websites offering web design inspiration and ideas. These resources cater to various needs, from business and ecommerce to portfolios and landing pages. Sources are categorized into multipurpose, focused, and niched inspirations, including both free and paid options. Special mentions include award galleries and website builder showcases.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522668/hacktiv8/blog/50-best-websites-for-web-design-inspiration-and-ideas-wf4w7s6gr7s.jpg',21,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Xterm.js','Xterm.js allows building browser-based terminals. To get started, install it via npm and include xterm.js and xterm.css in your HTML. Then, create a div for the terminal and initialize the Terminal object with the `open` function. Xterm.js is widely used in various applications, from online IDEs like SourceLair and Visual Studio Code to cloud platforms like Proxmox VE and Azure Cloud Shell.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522669/hacktiv8/blog/xterm.js-o0i1b703be.jpg',8,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Create Dockerfiles with GenAI','The post explores the use of generative AI (GenAI) for generating Dockerfiles, highlighting how AI tools like ChatGPT can analyze projects and create Dockerfiles with improved best practices. By providing specific functions and prompts, the AI can automate Dockerfile creation, employing advanced techniques like multi-stage builds and cache mounts, aimed at enhancing efficiency and adaptability. The content emphasizes practical examples and ongoing evaluation of AI''s role in developer workflows.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522669/hacktiv8/blog/how-to-create-dockerfiles-with-genai-vb827k59o4a.jpg',3,1) RETURNING \"id\",\"created_at\",\"updated_at\",\"title\",\"content\",\"img_url\",\"category_id\",\"author_id\";"
  },
  "original": {
    "length": 99,
    "name": "error",
    "severity": "ERROR",
    "code": "22001",
    "file": "varchar.c",
    "line": "641",
    "routine": "varchar",
    "sql": "INSERT INTO \"Blog_Posts\" (\"id\",\"created_at\",\"updated_at\",\"title\",\"content\",\"img_url\",\"category_id\",\"author_id\") VALUES (DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Uno Platform Error & Performance Monitoring with Raygun','The post provides a detailed guide on integrating Raygun for error and performance monitoring in Uno Platform applications, aiming to help developers enhance their productivity and application reliability. It highlights setup steps, key features, and benefits of using Raygun with Uno Platform.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522544/hacktiv8/blog/uno-platform-error-and-performance-monitoring-with-raygun-a1euieujac.jpg',3,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Using Web Authentication (OAuth2) to access Figma from Windows and Uno Platform Application','This post guides you through the process of using the Uno.Extensions web authentication package to simplify OAuth2 authentication and interact with the Figma API from a Windows and Uno Platform application. It covers configuring app settings, registering authentication and API endpoints, and handling token refreshes. The application setup allows logging into Figma and retrieving user information, demonstrating the benefits of using a streamlined web authentication flow.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522545/hacktiv8/blog/using-web-authentication-%28oauth2%29-to-access-figma-from-windows-and-uno-platform-application-qdd9qh80ggn.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','5.3 Release: Full Rider Support and 350+ Enhancements','The latest update to Uno Platform introduces over 350 enhancements, with significant additions including full support for JetBrains Rider, an improved Hot Reload experience, new UI controls (ItemsView and SelectorBar), and support for SkiaSharp 3 Previews. The release also simplifies Uno Platform versioning and shifts focus to .NET 9, discontinuing support for .NET 7.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522546/hacktiv8/blog/5.3-release:-full-rider-support-and-350%2B-enhancements-z2iv9s3uzo.jpg',14,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Webstudio: Open Source Webflow Alternative','Webstudio provides a visual tool that offers complete control over CSS properties, enables quick iterations without writing code, and delivers high optimization for search engines. It supports dynamic templates that change content based on URLs and allows data binding to components. Published sites are hosted separately for better performance and stability. Webstudio is free to start, scalable without hidden costs, and compliant with GDPR regulations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522547/hacktiv8/blog/webstudio:-open-source-webflow-alternative-g52w0otnom.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Mastering Microfrontends: 9 Patterns Every Developer Should Know','Microfrontend architecture allows independent frontend pieces to be developed by separate teams and integrated into a complete system, enabling faster releases and reduced complexity. The post explores nine integration patterns, such as Micro Apps, iFrames, App Shell, and Module Federation, highlighting their strengths and weaknesses. Each pattern addresses different aspects like autonomy, fault isolation, performance, technology compatibility, and flexibility. Combining multiple patterns can help leverage their strengths to meet specific project requirements and maintain long-term application efficiency.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522548/hacktiv8/blog/mastering-microfrontends:-9-patterns-every-developer-should-know-kcej72jd3kn.jpg',1,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Create beautiful images of your code','Learn how to create visually appealing images of your code using Raycast API. Customize by adjusting themes, background, dark mode, padding, and language to enhance readability.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522549/hacktiv8/blog/create-beautiful-images-of-your-code-w6vt6ez6bai.jpg',14,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','🌍 Introducing the New \"Globe Anime\" Component in Eldora UI! 🎨✨','Eldora UI has introduced Globe Anime, a new dynamic and visually appealing globe animation component for web applications. This component aims to enhance the visual experience for developers and designers. More details and integration can be found on the official Eldora UI site.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522550/hacktiv8/blog/introducing-the-new-%22globe-anime%22-component-in-eldora-ui%21-60wd4daiooo.jpg',1,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','🧠 Understanding JavaScript Proxies: Harnessing the Power of Metaprogramming','JavaScript Proxies allow developers to intercept and redefine fundamental operations on objects, offering a powerful tool for enhancing control and flexibility in applications. They are used for tasks like validation, data binding, tracing, debugging, and creating immutable objects. Understanding and using Proxies can significantly improve the dynamism of your JavaScript code.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522551/hacktiv8/blog/understanding-javascript-proxies:-harnessing-the-power-of-metaprogramming-k4xkpe7nij.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Prepare for Coding Interviews in 2024? (with Resources)','In today''s competitive job market, preparing for coding interviews requires a systematic approach. Key areas to focus on include Data Structures and Algorithms, High-Level Design (HLD), Low-Level Design (LLD), CS Fundamentals, and Behavioral questions. Utilize resources such as DesignGuru.io, notable books, video channels, and platforms like Leetcode, Codemia, and Pramp for comprehensive preparation. Mock interviews and company-specific preparation are also essential for success.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522552/hacktiv8/blog/how-to-prepare-for-coding-interviews-in-2024-%28with-resources%29-3xnstgvphql.jpg',16,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Cache Optimization on NextJS Without Vercel','Optimizing cache in a Next.js application, even without using Vercel, can significantly enhance load times, scalability, and user experience. Next.js offers several built-in features for caching, such as Static Site Generation (SSG) and Incremental Static Regeneration (ISR), which pre-render pages and update them in the background. Utilizing Cache-Control headers and client-side caching techniques like service workers and local storage can further improve performance. Integrating a Content Delivery Network (CDN) distributes static content globally, ensuring faster load times and reduced server load.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522553/hacktiv8/blog/cache-optimization-on-nextjs-without-vercel-kyn42zr1fi.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','stack-auth/stack: Open-source Clerk/Auth0 alternative','Stack Auth is an open-source, developer-friendly user authentication solution that supports Next.js frontends and backend integrations via REST API. It offers a quick setup and the flexibility to export and self-host user data at any time. The post provides comprehensive setup instructions including dependency installation through Docker, local development execution, and Prisma database initialization. Contributors are encouraged to join their Discord and follow contribution guidelines.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522554/hacktiv8/blog/stack-authstack:-open-source-clerkauth0-alternative-ta07y0g5bir.jpg',3,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','10 modern Node.js runtime features to start using in 2024','Explore 10 modern Node.js runtime features to start using in 2024. Includes the Node.js test runner, native mocking, test coverage, watch mode, .env loader, import.meta support, native timers with promises, permissions model, and policy module.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522554/hacktiv8/blog/10-modern-node.js-runtime-features-to-start-using-in-2024-mwnkeh7jqho.jpg',13,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Pines - A beautiful UI library for Alpine and Tailwind','Pines is a library of animations, sliders, tooltips, accordions, modals, and more! It''s a set of UI elements that can be copy and pasted into any Alpine and Tailwind projects. This is Pines''s first launch.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522555/hacktiv8/blog/pines-a-beautiful-ui-library-for-alpine-and-tailwind-7xxflwk33z.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Performance Benchmarks: Comparing Query Latency across TypeScript ORMs & Databases','Performance benchmarks compare query latencies of three TypeScript ORMs (Prisma, TypeORM, Drizzle) across PostgreSQL databases on AWS RDS, Supabase, and Neon. Benchmarking methodology includes 14 queries, executed 500 times on an EC2 instance to measure query latencies. Results show that performance varies based on the specific query, dataset, schema, and infrastructure. Most queries perform similarly across different ORMs, with some exceptions like ''Nested find all'' queries. Factors such as network latency and limited API features impact the results. Prisma Optimize offers insights and recommendations for better query performance.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522556/hacktiv8/blog/performance-benchmarks:-comparing-query-latency-across-typescript-orms-and-databases-9vr3sbjqk1p.jpg',15,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Tauri 2.0 Release Candidate','Tauri 2.0 has reached its release candidate phase after extensive beta and alpha testing. The focus now is on documentation and fixing critical bugs before the stable release planned for the end of August. Significant changes include the restructuring of core plugins and improvements in mobile development capabilities. An external security audit has also been completed, with all findings addressed. The Tauri team encourages community involvement and contributions to help improve the project further.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522557/hacktiv8/blog/tauri-2.0-release-candidate-f88l6umwdvw.jpg',2,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Introducing UI Coverage','UI Coverage by Cypress introduces a visual approach to test coverage, helping development teams analyze and report on untested areas in their applications. It automatically detects which pages and elements remain untested, providing a dynamic visual map to highlight gaps. This tool simplifies setup, offers instant coverage reports without additional configuration, and enables teams to make data-driven decisions for comprehensive testing and efficient resource allocation.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522559/hacktiv8/blog/introducing-ui-coverage-zj0bxjl7j9.jpg',13,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','v0.dev by Vercel Labs','v0.dev by Vercel Labs A Tweet UI 14 hours ago A cookie consent banner 19 hours ago a sleek pricing page for a SaaS. 18 hours ago. A table of financial invoices 1 hour ago A simple music player 15 hours ago.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522562/hacktiv8/blog/v0.dev-by-vercel-labs-6wo1m0gex5a.jpg',17,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','JavaScript design patterns guide','Developers use design patterns as reusable solutions to common problems. This guide demonstrates several JavaScript design patterns, including creational (factory and builder), structural (adapter and decorator), and behavioral (chain of responsibility and strategy) patterns. Each pattern is illustrated with practical code examples to aid understanding.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522564/hacktiv8/blog/javascript-design-patterns-guide-68qka5puo0x.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','jodigiordano/gg: The software architecture simulator','gg is a light software architecture simulator designed for documentation and presentation purposes. Although still in its proof-of-concept phase, it allows users to define various software architectures and create step-by-step presentations of different usage scenarios. The tool can be started by cloning the repository, installing dependencies, and running the development server.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522565/hacktiv8/blog/jodigiordanogg:-the-software-architecture-simulator-6agl9h0jh6o.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','As a dev, sometimes what keeps me from building something is not having a design to riff off of. This seems like a super cool tool to quickly generate a UI to get things started. Feels like a good starting point and a quick way to remove that mental block!','OpenUI allows users to describe UI using their imagination and see it rendered live. It can convert HTML to various languages like React, Svelte, and Web Components.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522566/hacktiv8/blog/as-a-dev-sometimes-what-keeps-me-from-building-something-is-not-having-a-design-to-riff-off-of.-thi-r1hbprhttes.jpg',18,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','My first experience as a Tech Lead','The author shares their experiences and insights from their journey of becoming a tech lead. Emphasizing the importance of soft skills, they discuss the nuances involved in evaluating candidates, the distinction between junior and senior developers, and their personal anecdote of leading a project for the first time. Valuable lessons from various types of senior developers are also recounted.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522567/hacktiv8/blog/my-first-experience-as-a-tech-lead-1yli648p84y.jpg',16,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','AI Studio','AI Studio allows users to create custom AI characters for Instagram, Messenger, and WhatsApp in the US. Content creators can build AIs to engage their audience by mimicking their tone and expressions. The platform provides a step-by-step guide, offering full customization and control over the AI''s behavior. It also supports the latest Generative AI capabilities, making it easy for anyone to craft conversational AIs based on personal interests.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522568/hacktiv8/blog/ai-studio-gc744ooy785.jpg',6,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','xkcd: CrowdStrike','The post informs readers that xkcd comics are licensed under the Creative Commons Attribution-NonCommercial 2.5 License, allowing free copying and sharing but restricting commercial use.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522569/hacktiv8/blog/xkcd:-crowdstrike-ag3y0deowjl.png',18,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Animations and effects for your tooltips components.','Popply is a new open-source library designed to add dynamic animations and effects to tooltips, enhancing UI and web pages. Created for the web development community, it offers a range of input and output animations for more engaging tooltips. Contributions and feedback are welcome, and the library is available on GitHub.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522570/hacktiv8/blog/animations-and-effects-for-your-tooltips-components.-hcgkn8mzi8u.jpg',1,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Perfio - Web Vitals and Performance Monitoring','Perfio is a new tool, debuted on August 3rd, 2024, designed for web vitals and performance monitoring. It caters to analytics, developer tools, and web design, offering insights to improve website performance.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522571/hacktiv8/blog/perfio-web-vitals-and-performance-monitoring-g8ye3islekp.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Why use displayName when building React components?','The displayName property in React components improves debugging and error messages by providing clear identifiers for components. It is utilized by React DevTools for better navigation and understanding of component hierarchies, and also aids in debugging context objects within the Context API. ESLint rules like react/display-name enforce the use of displayName to maintain consistency in large projects.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522572/hacktiv8/blog/why-use-displayname-when-building-react-components-6dri2y6ykm9.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The final boss of build tools','Vite has rapidly become a key foundation for higher-level innovations in the web ecosystem, with many frameworks adopting it. The Vite team plans to create a unified toolchain for handling JavaScript and TypeScript from source to production. Meanwhile, Neon offers a managed Postgres service designed to simplify database management tasks. Additionally, recent tech updates include new JavaScript tools, TypeScript 5.6 beta features, and insights from the Stack Overflow 2024 Developer Survey.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522573/hacktiv8/blog/the-final-boss-of-build-tools-78qd06ronka.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','PWABuilder','PWABuilder is a tool designed to help developers create Progressive Web Apps (PWAs) easily. It provides a user-friendly interface and various resources to streamline the process of building and deploying PWAs.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522575/hacktiv8/blog/pwabuilder-4v4jfmifo76.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','LLM Portfolio Projects Ideas to Wow Employers','Discover diverse AI project ideas that can be built using Python and various open-source tools like LangChain, FastAPI, OpenAI API, and Hugging Face. From fine-tuning Llama 3 and creating Q&A retrieval systems to building YouTube summarizers and vacation planning assistants, these projects are designed to enhance your portfolio and impress potential employers. Each project comes with guides or sample links to aid in development, making AI more accessible even to those with fundamental Python skills.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522576/hacktiv8/blog/llm-portfolio-projects-ideas-to-wow-employers-hg9c12ek78j.jpg',6,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','I Found the Best Apps for Productivity in 2024','Discover some lesser-known but highly effective productivity apps for 2024. The list includes tools like Audionotes for turning speech into text, Typeframes for AI-driven video creation, and CompressX for media compression. Additionally, explore apps like ReplyGuy for managing online conversations, Motion for organizing tasks and calendars, and Brain.fm for AI-generated focus music. Each app offers unique features designed to streamline tasks and boost productivity.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522576/hacktiv8/blog/i-found-the-best-apps-for-productivity-in-2024-9qx3kjknqri.jpg',6,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','(comic) Mindset makes all the difference','Comics about work, created with love and fueled by lots of coffee, illustrate how mindset can make a significant difference in the workplace.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522578/hacktiv8/blog/%28comic%29-mindset-makes-all-the-difference-q71cd7ee3ri.jpg',18,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Meet Reworkd: An AI Startup that Automates End-to-end Data Extraction','Reworkd AI is an AI startup that automates the entire web data extraction process. The platform can automatically create and update scraping code in response to website changes, offering a no-code, easy-to-use interface. It streamlines web data pipelines, managing website scans, code generation, data validation, and export. Additional features include self-healing scrapers, scheduling, deduplication, and automated proxy handling. Reworkd simplifies and enhances scalable data extraction, making it accessible for businesses of all sizes.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522579/hacktiv8/blog/meet-reworkd:-an-ai-startup-that-automates-end-to-end-data-extraction-t8pc06m9sh.jpg',6,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Build an Invoice SaaS App with Next.js, Resend, Clerk and Neon Postgres','This tutorial guides you through building a complete invoicing web application using Next.js, Resend, Clerk, and Neon Postgres. Key functionalities include managing customers, creating invoices, printing and sending invoices via email, and handling real-time communication between the frontend and backend. You''ll gain experience with setting up a Postgres database, implementing user authentication with Clerk, and using React-to-print for PDF generation.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522580/hacktiv8/blog/how-to-build-an-invoice-saas-app-with-next.js-resend-clerk-and-neon-postgres-r75be0hp7tp.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Twill — An open source CMS toolkit for Laravel','Twill is an open-source CMS toolkit for Laravel that offers a seamless experience for publishers, designers, and developers. It provides intuitive and powerful publishing tools, design controls, and developer-friendly configurations. Twill can streamline digital workflows, making it easier to manage digital content and launch products efficiently. It is designed to save time and involve entire teams in content management.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522581/hacktiv8/blog/twill-an-open-source-cms-toolkit-for-laravel-nvmivbhu36.png',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Productivity apps I use in 2024','The author shares their current productivity toolset for 2024, highlighting the apps they use daily across both PC and Mac platforms. Key tools include Obsidian for note-taking, Dabble.me for journaling, Raindrop for bookmark management, Notion Calendar for scheduling, Sukha for task-focused flow states, and todometer for task management. The author emphasizes the importance of reassessing and committing to your toolset regularly.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522583/hacktiv8/blog/the-productivity-apps-i-use-in-2024-kxt2vgqwks.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','System Design Interview: Design WhatsApp','This post outlines how to design a high-level system architecture for a messaging app similar to WhatsApp. Key points include handling 10 billion messages daily with plans to double, using RESTful APIs for compatibility, employing WebSockets for real-time communication, and using message queues like Kafka or RabbitMQ for efficient message distribution. The databases considered are NoSQL options like Cassandra and DynamoDB, emphasizing sharding and partitioning for scalability. End-to-end encryption, handling peak traffic, and future enhancements like group chats and media handling are also discussed.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522584/hacktiv8/blog/system-design-interview:-design-whatsapp-cb1x7n4d629.jpg',18,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','This application is built using Next.js, Shadcn, tRPC, Drizzle, and Neon. Designed as an admin interface, it provides a robust and reusable foundation for your new projects.','A comprehensive guide for setting up and running a Next.js Admin Panel Fullstack Project. This template utilizes technologies such as Shadcn, tRPC, Drizzle, and Neon, providing a strong foundation for admin interface projects. Instructions include starting the development server, configuring environment variables, and running tests.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522584/hacktiv8/blog/this-application-is-built-using-next.js-shadcn-trpc-drizzle-and-neon.-designed-as-an-admin-inter-knbq7coikbj.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How I made our React app more performant (includes INP)','The author shares steps to optimize a React app by reducing unnecessary re-renders, especially in a chat layout. Techniques include using React DevTools for profiling, moving state into the appropriate components, and understanding the browser''s rendering process through Interaction to Next Paint (INP). Key advice involves colocating state, measuring performance before optimizing, and understanding the rendering process for effective optimization.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522585/hacktiv8/blog/how-i-made-our-react-app-more-performant-%28includes-inp%29-8j90pmuec1u.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','New in Chrome 127','Chrome 127 introduces improvements for developers including the `font-size-adjust` CSS property for better fallback font legibility, user activation propagation between picture-in-picture documents and their opener, and making scroll containers keyboard focusable by default to enhance accessibility.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522587/hacktiv8/blog/new-in-chrome-127-egl4b9rvh8o.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to build a tech stack for a remote startup','Building a remote startup involves choosing the right tools for communication, organization, and collaboration. Essential tools recommended include Discord for team communication, Linear for task tracking, Figma for design and collaboration, Notion for document management, and Loom for asynchronous information sharing. Additionally, Appwrite''s own backend solutions, Attio for CRM, GitHub Teams for open source contributions, Plausible for privacy-focused analytics, and Dub.co for link-building are highlighted for enhancing remote operations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522587/hacktiv8/blog/how-to-build-a-tech-stack-for-a-remote-startup-q0qvuhsnyhi.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Announcing River UI','River UI provides a user-friendly interface for managing SQL-backed job queues, featuring a backend Go API and a frontend built with React and TypeScript. It allows users to monitor job states, interact by cancelling, retrying, or deleting jobs, and offers features like pausing queues during issues. River UI is available as a Docker image and a pre-built static binary, with future enhancements planned.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522589/hacktiv8/blog/announcing-river-ui-bnwtpgopvga.jpg',3,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','UUIDv7 in 20 languages','UUIDv7 is a 128-bit unique identifier that is time-sortable with 1 ms precision. It can be used as record identifiers in databases, including distributed ones. The post provides an implementation of UUIDv7 in 20 different programming languages.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522589/hacktiv8/blog/uuidv7-in-20-languages-7coq9wmyu3u.jpg',14,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A Gentle Intro to TypeScript','TypeScript enhances JavaScript by adding type annotations that catch errors during compilation, making code more robust and easier to read. Switching to TypeScript involves adding type annotations to your functions, which the TypeScript compiler uses to infer types and ensure only valid operations. This can prevent entire categories of bugs frequently encountered in JavaScript. Tools like Deno and Vite simplify TypeScript adoption by automatically handling TypeScript to JavaScript compilation.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522590/hacktiv8/blog/a-gentle-intro-to-typescript-nnhxf4jmteo.jpg',1,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Secret knowledge to self-host Next.js','Learn how to self-host Next.js applications outside of Vercel. The guide covers deploying to both servers and serverless functions, detailing the setup required for production readiness, including image optimization, caching, CDN configuration, middleware, and redirect and rewrite configurations. It also discusses the tradeoffs between server and serverless deployments and provides tips for efficient server management.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522592/hacktiv8/blog/secret-knowledge-to-self-host-next.js-5n9q9lt68pf.jpg',8,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Mastering Next.js and Beyond: An interview with Lee Robinson','Lee Robinson discusses the challenges and opportunities in software development, the impact of AI, machine learning, and blockchain on software engineering, and the reasons for considering Next.js.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522593/hacktiv8/blog/mastering-next.js-and-beyond:-an-interview-with-lee-robinson-xl7imddeef.jpg',5,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A JavaScript Quine Clock','A JavaScript Quine Clock is a unique clock that uses self-replicating code to display the time. The code continuously updates and generates the current time in a visually appealing way.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522594/hacktiv8/blog/a-javascript-quine-clock-dlqbs84vekh.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Web Frameworks, JavaScript Utilities, Uncats','Issue #573 of Insanely Cool Tools brings a curated collection of unique tools and utilities designed to enhance productivity and spark creativity. Highlights include a range of web frameworks like Next.js boilerplates, customizable React components, and typesafe full-stack setups. The JavaScript utilities section features tools like a rich text editor, barcode scanning, and consent banner utilities. Additionally, uncategorizable tools such as a local development tool for WordPress and an open-source alternative to Netlify are featured.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522595/hacktiv8/blog/web-frameworks-javascript-utilities-uncats-prp6aet4r4o.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Blacksmith - Faster and cheaper hosted GitHub Actions runners','Blacksmith offers faster and cheaper hosted GitHub Actions runners. It was launched on July 24th, 2024, and falls under SaaS and Developer Tools categories. This marks Blacksmith''s initial launch.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522596/hacktiv8/blog/blacksmith-faster-and-cheaper-hosted-github-actions-runners-ob0ojb4zilk.jpg',3,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The 5 Most Anticipated New Features In Strapi 5','Strapi 5 introduces several anticipated features, including content versioning, a new Document Service API, an easier data response structure, partial support for Relay-style GraphQL queries, and a CLI upgrade tool. These enhancements address common challenges and streamline the content management process, making it easier for users to manage drafts, rollback content, count documents, and upgrade versions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522597/hacktiv8/blog/the-5-most-anticipated-new-features-in-strapi-5-ak5rcqpgzgs.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Learn Asynchronous JavaScript','Mastering asynchronous programming is essential for modern JavaScript development, providing efficiencies and responsiveness. A new freeCodeCamp.org YouTube course offers a comprehensive guide, covering synchronous vs asynchronous programming, callbacks, promises, async/await, and the Fetch API. It includes practical projects with APIs like Chuck Norris API, Weather API, and Pokedex API to reinforce learning.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522598/hacktiv8/blog/learn-asynchronous-javascript-5h1ndmdsy3b.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','From ESLint and Prettier to Biome','A developer shares their experience migrating from ESLint and Prettier to Biome, highlighting the simplicity, good defaults, and error messages of Biome. They also mention the drawbacks, such as the use of JSON for configuration and the lack of some ESLint features. The post provides information on how to set up Biome and how it handles linting staged files. Overall, the migration was smooth and the developer recommends giving Biome a try.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522599/hacktiv8/blog/from-eslint-and-prettier-to-biome-ju2qczjvxx.jpg',14,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A JavaScript developer tries Go for the first time','A JavaScript developer shares their first impressions of the Go programming language, highlighting its error handling, defer statement, explicit type conversion, switch statement, pointers, simple type system, and consistent approach to coding.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522600/hacktiv8/blog/a-javascript-developer-tries-go-for-the-first-time-f0eshgj7qch.jpg',14,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Vite + React + TS','Combining Vite with React and TypeScript offers a powerful and efficient development setup. Vite provides a fast build tool while TypeScript enhances code quality in React applications. This combination ensures a smoother and more performant developer experience.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522600/hacktiv8/blog/vite-%2B-react-%2B-ts-5jf8nitv2mw.jpg',1,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','useplunk/plunk: The Open-Source Email Platform','Plunk is an open-source email platform built on AWS SES for sending emails from applications. It supports transactional emails, automations, and broadcasts. The platform can be self-hosted using the driaug/plunk Docker image, and detailed deployment instructions are available in the documentation. Contributions are encouraged, with guidelines provided in CONTRIBUTING.md.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522601/hacktiv8/blog/useplunkplunk:-the-open-source-email-platform-e8ukh7amg1.jpg',3,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Never trust Frontend code','A developer investigates an unusual error where a user attempted to purchase an item with the wrong currency, revealing vulnerabilities in client-side code. The solution uncovered shows the importance of not trusting frontend code and placing strong restrictions on what APIs can accept. The investigation emphasized using server-side code for critical operations to enhance security.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522602/hacktiv8/blog/never-trust-frontend-code-lazt3rumnt.jpg',7,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Advanced Animation Techniques with Anime.js','Learn about advanced animation techniques using the anime.js library. Discover common animations on modern websites, the importance of mastering advanced animation in web development, and explore keyframe animations, easing functions, staggering animations, path animations, and SVG morphing animations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522603/hacktiv8/blog/advanced-animation-techniques-with-anime.js-k54gfkg77z.jpg',1,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Tiny macOS utility apps I love - Part 1','This post marks the beginning of a series highlighting tiny macOS utility apps that enhance productivity. It covers three apps: PixelSnap, for precise on-screen measurements; CleanShot, a feature-rich screenshot utility; and Paletro, which consolidates keyboard shortcuts across apps into a single command palette. These apps streamline workflows and integrate seamlessly into various design and development tasks.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522604/hacktiv8/blog/tiny-macos-utility-apps-i-love-part-1-4hkckj0x2ap.jpg',18,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Web Workers, Comlink, Vite and TanStack Query','Discover how to use Web Workers with Comlink and TanStack Query in a Vite-built project. Learn to offload expensive computations to Web Workers, enhancing UI performance without blocking the main thread. The post details the setup, including using vite-plugin-comlink for smoother integration, and demonstrates using TanStack Query to manage async data interactions effectively.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522605/hacktiv8/blog/web-workers-comlink-vite-and-tanstack-query-ds1j2fvh4fa.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','7 Web Dev Tools You Didn’t Know You Needed','Discover seven lesser-known web development tools designed to enhance your coding efficiency and creativity. Tools like WhatFont for identifying web fonts, GitKraken for simplifying Git workflows, JSON Schema for validating JSON data, BrowserStack for cross-browser testing, Insomnia for API debugging, Squoosh for image optimization, and Storybook for UI component management are highlighted. These tools offer numerous features to improve your projects and streamline your development process.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522605/hacktiv8/blog/7-web-dev-tools-you-didn%27t-know-you-needed-m6fuvprp6n.jpg',1,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Build Your Own React State Management Library in Under 40 Lines of Code - With Typescript Support','Learn how to build your own React state management library in under 40 lines of code with TypeScript support. Explore the use of the useSyncExternalStore hook and why React context may not be the best option for state management.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522606/hacktiv8/blog/build-your-own-react-state-management-library-in-under-40-lines-of-code-with-typescript-support-2cmn386m79c.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Ultimate Price Tracker','RupeeSpot offers a comprehensive collection of current top deals from popular e-commerce stores such as Amazon, Flipkart, Ajio, Nike, and Croma. The platform aims to help users find significant discounts on a variety of products including fashion, beauty, and travel accessories. Highlighted deals include a wide range of products with details on discounts and ratings.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522607/hacktiv8/blog/the-ultimate-price-tracker-wjpcsofq8wm.jpg',19,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Storybook 8.2','Storybook 8.2 introduces several enhancements aimed at improving component testing, including new test hooks, portable stories for React, Vue 3, and Svelte, and consolidated dependency management. The release also features a streamlined onboarding process, an improved website with better documentation, and numerous other improvements and bug fixes. Developers can try the new version by initializing a new project or upgrading an existing one using Storybook''s CLI.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522608/hacktiv8/blog/storybook-8.2-il99k9sn8li.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','taubyte/tau: Open source distributed Platform as a Service (PaaS). A self-hosted Vercel / Netlify / Cloudflare alternative.','Tau is an open-source, distributed Platform as a Service (PaaS) designed to compete with major providers like Vercel, Netlify, and Cloudflare. It''s a developer-friendly framework focused on minimal configuration, auto-discovery, and peer-to-peer networking. Using Git for infrastructure management, Tau emphasizes local development and seamless production deployment. Features include WebAssembly support, content-addressed storage, and a plugin system for extensibility.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522609/hacktiv8/blog/taubytetau:-open-source-distributed-platform-as-a-service-%28paas%29.-a-self-hosted-vercel-netlify-su7lx3axtt.jpg',8,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','✧˚ Outstanding Portfolio for the inspiration - 05','Alana Goyal is the founder and managing partner of Basecase Capital, partnering with multiple companies such as Ashby, Astral, and Supabase. She contributes to open-source projects like Branded and Eventbase. Alana has a rich history in product management, having worked at Samsara, Greylock, Blend, AppDynamics, and Natera. She studied computer science at Columbia University.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522610/hacktiv8/blog/o-outstanding-portfolio-for-the-inspiration-05-w4kouasstq.jpg',16,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','JS Library Tools, Git/CLI, Build Tools','Discover new tools for JavaScript libraries, Git/CLI, and build tools. Highlights include Catena for type-safe APIs, Layer Cake for Svelte visualizations, several Git-related tools like ntcharts, Hookdeck CLI, superfile, and build tools including unplugin-parcel-macros and npm-check-extras. Also, learn about the Meco app for reading newsletters and commercial apps like Penify.dev and FILE0.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522610/hacktiv8/blog/js-library-tools-gitcli-build-tools-igr7j8mc3hq.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Add Facebook Pixel in Next.js 14 App Router','Learn how to integrate Facebook Pixel into your Next.js 14 app using the new App Router. The guide includes steps to create a Facebook Pixel, install it using Next.js''s <Script> component, and verify the installation to enhance your web tracking and marketing strategies.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522611/hacktiv8/blog/how-to-add-facebook-pixel-in-next.js-14-app-router-dylbnngcpt4.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Using qr-code: a customizable, animate-able HTML element','The `qr-code` library offers developers a way to create customizable, animated, and SVG-based QR codes that can be integrated into any modern web application. It provides various customization options, including color changes, custom shapes, and logo insertion. The library works across all major frontend frameworks such as React, Angular, and Svelte, and comes with a simple API for building animations. It also supports download and print features for generated QR codes, making it versatile for different use cases.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522612/hacktiv8/blog/using-qr-code:-a-customizable-animate-able-html-element-wr34pmlopi9.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Improved lazy loading','The post discusses the design and implementation of an ORM named Tempest, focusing on improved lazy loading mechanisms. The key approach includes using typed properties for static analysis, making minimal configuration necessary by inferring relations directly from property types and docblocks. It contrasts Tempest''s strict lazy loading with Laravel''s default approach which allows lazy loading, thereby preventing n+1 query problems and optimizing performance. The post also explores PHP''s technical details, including handling uninitialized properties and triggering property accessors for lazy loading.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522613/hacktiv8/blog/improved-lazy-loading-pg2corwok4.jpg',14,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Implement Directus Auth in Next.js 14','Learn how to implement Directus Auth in Next.js 14, register new users, and perform CRUD operations on posts.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522614/hacktiv8/blog/implement-directus-auth-in-next.js-14-ihhvjsgpzj.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Create a PC game using JavaScript','Learn to create a Flappy Bird-like game in JavaScript using the KAPLAY library and package it for PC installation with Tauri. The comprehensive course includes setting up the development environment, loading assets, implementing player logic, building the game, and creating a score UI. Suitable for beginners and experienced developers, this tutorial provides practical hands-on experience in game development and desktop application packaging.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522615/hacktiv8/blog/create-a-pc-game-using-javascript-9cvr4dfz9l.jpg',10,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Tried and tested, I highly recommend! 💪🏻','Codeium is a free AI-powered coding assistant that offers features similar to GitHub Copilot, including code completions, support for multiple programming languages, IDE integrations, and data encryption. It provides limitless code completions, chatbots for AI suggestions, and intelligent searches within IDEs. Unlike Copilot, it is free for individual users and offers enhanced functionalities and security compliance (SOC 2 Type II). It supports over 70 programming languages and offers various installation methods, including browser-based playground and IDE extensions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522616/hacktiv8/blog/tried-and-tested-i-highly-recommend%21-db7de3nxl2.jpg',6,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Storyblok live editing with Next.js App Router and React Server Components','Learn how to set up live editing support with Storyblok''s full React Server Components approach for Next.js. Two ways to set up a Next.js app with Storyblok. Clever solution to retain live editing support when using the server-side approach with Storyblok.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522617/hacktiv8/blog/storyblok-live-editing-with-next.js-app-router-and-react-server-components-kq49qg63knr.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Futures: await vs unawaited vs ignore','When calling a method that returns a Future, you can use ''await'', ''unawaited'', or ''ignore''. This choice affects how your code handles exceptions thrown by the Future. Understanding the differences is crucial for proper error handling in asynchronous programming.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522618/hacktiv8/blog/futures:-await-vs-unawaited-vs-ignore-xb9f7y8org.jpg',14,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','New without parentheses in PHP 8.4','PHP 8.4 introduces a feature allowing developers to create new objects without parentheses, simplifying code and enabling method chaining directly on newly created objects. This update extends to methods, properties, static methods, and even supports dynamic and anonymous classes. However, constructor brackets remain mandatory for class instantiation to avoid parsing ambiguities. Despite minor limitations, this syntactic sugar promises to enhance coding efficiency.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522619/hacktiv8/blog/new-without-parentheses-in-php-8.4-uivfs8kyq1i.jpg',14,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','SEESAW ✦ Design Inspiration','Discover a range of innovative and creative projects from diverse fields such as AI video analysis, electric road trips, sustainable living cabins, and much more. This daily updated list showcases exemplary work in web design, product design, branding, and technology, serving as a rich source of inspiration for designers and developers.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522621/hacktiv8/blog/seesaw-design-inspiration-lue5mo9kscq.jpg',18,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Uppy','Uppy is a sleek and modular open-source JavaScript file uploader that allows fetching files both locally and from remote sources like Dropbox or Instagram. It seamlessly integrates into existing stacks and offers features such as large file upload resilience, image editing, and generated thumbnails. Uppy is compatible with multiple frameworks including React and comes with Companion to simplify remote file handling and authentication. Built with accessibility and community-driven development, Uppy enhances file uploading with reliability and ease of use.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522622/hacktiv8/blog/uppy-68ji3s2p1e.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Node FINALLY Supports TypeScript',NULL,'https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522622/hacktiv8/blog/node-finally-supports-typescript-72zhf9fp2aj.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Optimizing Web Backends','The post discusses common techniques for optimizing web backend performance, focusing on issues related to high response times. It categorizes optimization strategies into three main layers: Application, Database, and Infrastructure. Key methods include optimizing algorithms, using asynchronous functions, leveraging concurrency, indexing databases, scaling databases, data compression, using CDNs, upgrading to HTTP/2 or HTTP/3, and replicating infrastructure. Continuous measurement and testing are emphasized to ensure effectiveness.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522623/hacktiv8/blog/optimizing-web-backends-f8e7oyxftka.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','(comic) Time check','Comics about work, created with love and fueled by lots of coffee. Subscribe to Work Chronicles for more entertaining and relatable comic strips.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522624/hacktiv8/blog/%28comic%29-time-check-0vn148g20hui.jpg',16,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Clean Code: 7 tips to write clean functions','Writing clean functions ensures that your code is readable, maintainable, and less prone to errors. Key tips include keeping functions small and well-named, limiting parameters, reducing nesting by returning early, writing pure functions without side effects, avoiding boolean flags, and using comments sparingly. Good coding is about communication between programmers, so clarity and simplicity are paramount.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522625/hacktiv8/blog/clean-code:-7-tips-to-write-clean-functions-sa4qcxp7f2.jpg',13,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','What’s New in React 19?','React 19 introduces async functions and the useTransition hook, revolutionizing state management and data handling. New features such as Actions for data mutations, optimistic updates with useOptimistic, streamlined form handling with useActionState, and server components enhance the development experience. The update also improves hydration error reporting, ref handling, stylesheet management, and support for custom elements and document metadata.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522626/hacktiv8/blog/what%27s-new-in-react-19-6q8n9jkrm7r.jpg',1,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Building fast, fuzzy site search with Laravel and Typesense','Learn how to create a fast and fuzzy search functionality in a Laravel application using Typesense. The author provides a step-by-step guide to setting up a Todo model, configuring Laravel Scout, and creating Laravel Controllers and Views to synchronize data with Typesense. This setup allows developers to easily implement advanced search features, including handling typographical errors, with minimal code changes.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522627/hacktiv8/blog/building-fast-fuzzy-site-search-with-laravel-and-typesense-8ctn3ffnm1n.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','7 Levels Of Engineers Describe Software’s Most Important Skill','Engineers from various levels at companies like Meta, Pinterest, Instacart, and Slack shared the most crucial skills for their positions. From learning existing patterns as a new grad to combining business acumen and technical expertise as a distinguished engineer, each level comes with unique challenges and advice for growth. Consistently, the importance of building relationships and understanding the business was emphasized as vital for career progression.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522628/hacktiv8/blog/7-levels-of-engineers-describe-software%27s-most-important-skill-6jzy0edldk6.jpg',16,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','I tried React Compiler today, and guess what… 😉','The article explores the use of React Compiler, a tool developed by the React core team, to solve the problem of unnecessary re-renders in React components. It discusses the installation process, provides examples of using React Compiler, and evaluates its effectiveness in real-world scenarios. The author concludes that while React Compiler can improve performance in some cases, manual memoization techniques such as React.memo, useMemo, and useCallback are still necessary to optimize component rendering.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522629/hacktiv8/blog/i-tried-react-compiler-today-and-guess-what...-4jp8q88oqpf.jpg',14,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Inverted border-radius using CSS mask','Learn how to use a CSS mask to create an inverted radius corner with minimal code, without the need for extra elements or pseudo-elements, and optimized with CSS variables.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522630/hacktiv8/blog/inverted-border-radius-using-css-mask-1cpymf6oiti.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Self-hosted Open Source Alternatives to Google Photos','To achieve a private Google Photos-like experience, consider using self-hosted, open-source alternatives like Immich, PhotoPrism, and Nextcloud Photos. These platforms offer varying features such as facial recognition, automatic backups, and mobile apps. Options like Chevereto and LibrePhotos cater to more simplistic needs, while Piwigo offers extensive customizability. Photoview and Lychee have their unique benefits, and Ente provides a hassle-free, encrypted cloud solution without the need for self-hosting.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522631/hacktiv8/blog/self-hosted-open-source-alternatives-to-google-photos-pu2etulehlp.jpg',8,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Explore new hooks coming up in React 19','React 19 introduces new hooks that streamline common tasks, such as handling form actions, tracking form submissions, and updating the UI with optimistic outcomes. These hooks save time, promote code reusability, and result in better user interfaces.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522632/hacktiv8/blog/explore-new-hooks-coming-up-in-react-19-7wr6jexavec.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','My Ongoing Project 🎉','RupeeSpot offers a comprehensive collection of current top deals from popular e-commerce stores such as Amazon, Flipkart, Ajio, Nike, and Croma. The platform aims to help users find significant discounts on a variety of products including fashion, beauty, and travel accessories. Highlighted deals include a wide range of products with details on discounts and ratings.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522633/hacktiv8/blog/my-ongoing-project-1zljcwnnhw8.jpg',19,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Zsh Shell Tricks I Wish I’d Known Earlier','Enhance your command-line productivity with Zsh! Zsh is a powerful Unix shell known for its robust features like command-line editing, spell checking, and programmable completion. This guide offers practical tips on cursor navigation, line editing, globbing, command history, parameter expansion, and custom commands. Learn to navigate directories efficiently, create and bind custom commands, and use Zsh’s advanced features to optimize your workflow. Whether you''re a developer, system administrator, DevOps engineer, or tech enthusiast, mastering Zsh can significantly boost your efficiency.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522634/hacktiv8/blog/the-zsh-shell-tricks-i-wish-i%27d-known-earlier-clb3wfwpbk.jpg',3,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','An Interactive guide to understanding SVG. How well do you know your SVG elements and attributes?','SVGs provide a scalable way to create graphics for the web with no loss in quality. This reference covers the most popular SVG elements like viewBox, circle, rect, line, polyline, and many more, detailing their attributes and uses. Each element is illustrated with code snippets to demonstrate its application.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522635/hacktiv8/blog/an-interactive-guide-to-understanding-svg.-how-well-do-you-know-your-svg-elements-and-attributes-mu21tdl07xh.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','click on any component to go to code.','LocatorJS is a Chrome Extension enabling developers to click on any component in their browser and directly open its code in VSCode. It supports React, Preact, Solid, Vue, and Svelte, working efficiently with Babel and modern React stacks like Vite, Next.js, or Create React App. This tool allows quick navigation within the codebase, boosting productivity. It is open-source under the MIT license and can be used in production-like environments with added support for styled-components.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522636/hacktiv8/blog/click-on-any-component-to-go-to-code.-ot8qqjt4r7s.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to set priorities?','Setting priorities is essential for achieving goals and reducing stress. Prioritization provides clarity, focus, and a better work-life balance. The post discusses several methods for prioritizing tasks: the Eisenhower Matrix helps differentiate urgent and important tasks; the 3-3-3 Rule focuses on critical work; the Ivy Lee Method involves ranking six tasks by importance. For leaders, techniques like the Pareto Principle and OKRs align team efforts with strategic goals. Teams can benefit from the ABCDE Method, MoSCoW Method, and RICE Framework. Combining these approaches can create a tailored, effective productivity system.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522637/hacktiv8/blog/how-to-set-priorities-a8x4qczub6g.jpg',16,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','6 books engineers should read','This post lists six essential books for engineers, emphasizing the depth and practical insights books provide compared to other mediums. Two recommended books are suitable for all experience levels: ''The Pragmatic Programmer'' and Dale Carnegie''s book on winning over colleagues. For senior engineers, four additional books are suggested to enhance leadership, responsibility, and decision-making skills: ''Extreme Ownership'', ''The Phoenix Project'', ''Software Engineering at Google'', and ''Thinking in Bets''. Readers are encouraged to delve deeper into these books for a comprehensive understanding.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522639/hacktiv8/blog/6-books-engineers-should-read-2pgqg93kqv2.jpg',16,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Announcing TypeScript 5.6 Beta','TypeScript 5.6 Beta introduces several new features including disallowed nullish and truthy checks, iterator helper methods, strict builtin iterator checks with the new --strictBuiltinIteratorReturn flag, support for arbitrary module identifiers, a new --noUncheckedSideEffectImports option, and a --noCheck option to skip type checking for faster builds. Region-prioritized diagnostics improve editor performance in large files, and TypeScript can now better handle complex project setups by searching ancestor configuration files for project ownership.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522640/hacktiv8/blog/announcing-typescript-5.6-beta-zmlx5me152l.jpg',14,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Differences Between ''Object'', ''{}'', and ''object'' in TypeScript','In TypeScript, ''Object'', ''{}'', and ''object'' serve distinct purposes. ''Object'' (uppercase) describes properties common to all JavaScript objects and can have boxable objects like string, boolean, etc. ''{}'' describes an object with no members and behaves similarly to ''Object'' but represents a different concept. ''object'' (lowercase) refers to any non-primitive type. ''Record<string, any>'' is also often used to represent non-primitive types and is more semantic.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522641/hacktiv8/blog/the-differences-between-%27object%27-%27%27-and-%27object%27-in-typescript-eluzdfgsm3a.jpg',14,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Practical Guide to Creating a Design System','Creating a design system involves selecting a suitable UI framework, defining both light and dark themes, and organizing the system into a reusable package. Using tools like Storybook for documentation and ensuring regression UI testing minimizes unexpected issues. Avoid custom CSS and components to reduce complexity and maintenance costs. While initially labor-intensive, this approach significantly reduces the marginal cost of developing new front-end pages.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522642/hacktiv8/blog/practical-guide-to-creating-a-design-system-o3xvbzbav7.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Benty Org - AI code generator and app builder','Benty Org is an AI-driven code generator and app builder featured on August 7th, 2024. It falls under Developer Tools, Artificial Intelligence, and Development categories. It was first launched on November 14th, 2023, but hasn''t been rated yet.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522642/hacktiv8/blog/benty-org-ai-code-generator-and-app-builder-7pvd61kfw3t.jpg',6,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Customize VS Code Settings – Real Python','Visual Studio Code is an open-source editor that can be tailored for Python development. This guide by instructor Philipp Acsany covers customizing VS Code settings to create a cleaner and more productive coding environment. Key topics include working with user settings, creating profiles, adjusting specific settings, cleaning up the interface, and exporting profiles for reuse. The course features 15 lessons, video subtitles, transcripts, downloadable resources, and a Q&A session with Python experts.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522643/hacktiv8/blog/customize-vs-code-settings-real-python-brz9axqchj.jpg',14,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Trending','Kreativa is an award-winning design studio that has been shaping digital products since 2008.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522644/hacktiv8/blog/trending-nd6abkpwya8.jpg',19,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Codeium: The Best Github Copilot Alternative','Codeium is a free AI-powered coding assistant that offers features similar to GitHub Copilot, including code completions, support for multiple programming languages, IDE integrations, and data encryption. It provides limitless code completions, chatbots for AI suggestions, and intelligent searches within IDEs. Unlike Copilot, it is free for individual users and offers enhanced functionalities and security compliance (SOC 2 Type II). It supports over 70 programming languages and offers various installation methods, including browser-based playground and IDE extensions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522646/hacktiv8/blog/codeium:-the-best-github-copilot-alternative-mqsfbamoloh.jpg',6,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Figma fiasco.','Figma''s latest updates, featuring new AI capabilities and a revamped user interface, have generated significant dissatisfaction among users. Critics argue that the changes prioritize profit over user experience, complicate simple tasks, and cater to non-designers. The restructured UI and AI functionalities are considered not only unnecessary but also detrimental to the workflow of professional designers. Many are considering alternatives like Penpot and Sketch due to these frustrations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522647/hacktiv8/blog/figma-fiasco.-y15xum1p3q.jpg',18,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Million.js adoption guide: Overview, examples, and alternatives','Million.js is an open source, minimalistic JavaScript compiler designed to enhance React performance by reducing memory usage and improving rendering speed. It uses a granular approach for DOM updates and introduces the concept of block components, which are optimized higher-order components. While it offers various advantages, including low memory usage and efficient updates, it has some drawbacks and a limited feature set compared to other frameworks like React, Preact, and Vue.js. The guide provides steps for getting started with Million.js and offers a comparison with other popular frameworks.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522648/hacktiv8/blog/million.js-adoption-guide:-overview-examples-and-alternatives-zkcp2c1akva.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to access search params in Next.js layouts','In Next.js, layouts remain the same across route changes and don''t re-render, which means they can''t directly access search parameters. To access search params, you should use client components which handle these dynamic changes without requiring the entire layout to re-render.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522649/hacktiv8/blog/how-to-access-search-params-in-next.js-layouts-kw6beaeazi.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','ChatGPT is bullshit','Large language models like ChatGPT are producing falsehoods more accurately described as ''bullshit'' rather than ''hallucinations''. These models generate human-like text by analyzing probabilities rather than aiming for truth. Describing their inaccuracies as bullshit is argued to be a more useful framework for understanding and discussing their behavior, particularly since these models are designed to produce convincing text rather than accurate information.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522650/hacktiv8/blog/chatgpt-is-bullshit-dr8mpor98sw.jpg',6,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Exploring the Creative Potential of Atropos.js for Web Design','Explore the creative potential of Atropos.js in web design. Atropos.js is a versatile JavaScript library that enhances web design with scroll-based animations, parallax effects, and seamless integration with popular frameworks. It facilitates the creation of unique and memorable user experiences, improves website performance, and offers design flexibility. Learn how to build a scroll-based gallery using Atropos.js, Axios, and React.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522651/hacktiv8/blog/exploring-the-creative-potential-of-atropos.js-for-web-design-dbds9fhs7z.jpg',1,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Private cloud for your photos, videos and more','Ente Auth is an open-source 2FA authenticator offering end-to-end encrypted backups and cross-platform sync. It allows users to view next authentication codes, easily identify tokens by icons, organize them with tags, pin favorite services, and use a search function. It supports offline mode and import of tokens via QR code, manual entry, or bulk import. Ente is fully open-source, allowing data export and import without lock-ins.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522652/hacktiv8/blog/private-cloud-for-your-photos-videos-and-more-en3djb15jvk.jpg',8,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','From Web to Native with React','React Native enables web developers with experience in React to create native mobile apps using JavaScript or TypeScript. It allows for multi-platform code sharing between iOS and Android from a single codebase. Expo is recommended as a framework to bridge the gaps in React Native core capabilities, providing essential tools for production apps. Key differences between web and native development include the use of UI primitives and styling methods. Developers should avoid certain common pitfalls, such as using array.map for rendering large lists or the logical AND operator in rendering. Key native-specific concepts include build signing, deep linking, gestures, haptics, and handling the on-screen keyboard.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522653/hacktiv8/blog/from-web-to-native-with-react-ta5k2fibxch.jpg',2,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to animate width: auto using React, Next.js and Framer Motion','Learn how to animate the ''width: auto'' property using React, Next.js, and Framer Motion. This guide walks you through setting up a Next.js project, adding necessary HTML and CSS, and implementing animations using Framer Motion to create dynamic and visually pleasing transitions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522654/hacktiv8/blog/how-to-animate-width:-auto-using-react-next.js-and-framer-motion-s1dbiveb679.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','(comic) Cold Calls','Enjoy comics about work that are made with dedication and a love for coffee. Subscribe to Work Chronicles for more amusing content.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522655/hacktiv8/blog/%28comic%29-cold-calls-dhwdwrdp6ta.jpg',20,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','🚀 Create An Attractive GitHub Profile README 📝','Enhance your GitHub profile with a standout README using a comprehensive custom template. Your README is crucial for making a great first impression on potential employers and collaborators. Start by setting up a special README repository named exactly as your GitHub username. Add a warm introduction, an ''About Me'' section, and detailed sections for resume, experience, coding handles, and tech stack. Highlight key projects, show stats and activity, and end with social links and contact information. Utilize GitHub Actions for automating recent activities and merged PRs. Incorporate additional elements like jokes or Spotify music for a personal touch. Follow the guide for a visually appealing and organized README.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522656/hacktiv8/blog/create-an-attractive-github-profile-readme-8uf7ks6pg55.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Node.js is Not Single-Threaded','Node.js, often perceived as a single-threaded platform, utilizes an event-driven, non-blocking architecture to handle I/O operations efficiently. While it manages most operations via a single thread, it also employs the libuv library, which uses an event demultiplexer and a thread pool for certain operations (like file I/O or DNS queries) that can''t be handled asynchronously. This allows Node.js to maximize resource utilization and handle multiple client requests concurrently.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522657/hacktiv8/blog/node.js-is-not-single-threaded-jhqkqg503bj.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','I''m tired of it','AI-generated content is pervasive, often creating bland, inaccurate articles that lack true value. The author criticizes this trend, emphasizing the importance of human-crafted content that showcases effort and unique perspectives. Highlighting examples of pointless AI-generated articles and the inefficiency of email communication due to AI, the appeal is to maintain authenticity and personal touch in writing.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522658/hacktiv8/blog/i%27m-tired-of-it-gja5aibc44q.png',6,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','darrenburns/posting: The modern API client that lives in your terminal.','Posting is a terminal-based HTTP client designed for efficient keyboard-centric interactions. It stores requests locally in YAML files, ensuring easy version control. Key features include ''jump mode'' navigation, environment/variable management with autocompletion, various themes, and a command palette. Installation requires Python 3.11 or later and can be done using pipx. Users can also import OpenAPI 3.x specifications to create collections. Configuration is flexible, supporting YAML files, environment variables, and .env files.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522659/hacktiv8/blog/darrenburnsposting:-the-modern-api-client-that-lives-in-your-terminal.-51i832lh2x.jpg',13,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Ascendio - Ascend a turborepo project in seconds','Ascendio is a SaaS tool launched on August 7th, 2024, designed to help developers manage turborepo projects efficiently. It is the first version of this developer tool aiming to simplify and speed up turborepo project workflows.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522660/hacktiv8/blog/ascendio-ascend-a-turborepo-project-in-seconds-seejsvdh5jl.jpg',21,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Handling file uploads in Next.js using UploadThing','UploadThing is an open-source tool designed to simplify file uploads in full-stack TypeScript applications. By leveraging this tool, developers can effortlessly handle file uploads, manage authentication, and maintain a seamless user experience. UploadThing integrates well with Next.js, and it offers customizable upload parameters, secure storage solutions, and serverless functions to handle various processes like metadata storage and callback notifications. The guide demonstrates setting up UploadThing, integrating it with Next.js, and utilizing components to upload and manage files effectively.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522660/hacktiv8/blog/handling-file-uploads-in-next.js-using-uploadthing-8uuzgcdhpc.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Announcing: A new Init. Faster. Smoother. Better.','Appwrite announced a new Init event happening from August 19 to 23, 2024. Over five days, they will reveal new products, features, and potentially new SDKs. The event includes exciting Discord sessions with special guests, a live coding session by Dennis Ivy, and exclusive swag giveaways. Participants need a unique ticket to join and can register online.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522661/hacktiv8/blog/announcing:-a-new-init.-faster.-smoother.-better.-316j656rzcx.jpg',21,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How Google handles JavaScript throughout the indexing process – Vercel','Understanding how search engines crawl, render, and index web pages is vital for optimizing sites for SEO. Google has significantly evolved in rendering capabilities over the years, now using modern Chrome for rendering all HTML pages and dynamically loaded content. Key findings debunk myths like Google''s inability to render JavaScript, and show that there is no fundamental difference in how JavaScript-heavy pages are treated compared to static HTML. Recommendations include using JavaScript frameworks freely, ensuring critical resources are not blocked, and using server-side rendering for critical SEO elements.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522662/hacktiv8/blog/how-google-handles-javascript-throughout-the-indexing-process-vercel-hrqwsxlery.png',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Talos Linux','Talos Linux is a minimal, secure, and immutable operating system designed for Kubernetes. It supports multiple platforms including cloud, bare metal, and virtualization. All system management is performed through a secure API with mutual TLS authentication, eliminating the need for SSH or console access. Talos follows a hardened, immutable infrastructure approach, runs entirely in memory, and consistently delivers the latest stable versions of Kubernetes and Linux.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522663/hacktiv8/blog/talos-linux-45bskhktyy3.jpg',3,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','ezjson - JSON parsing, formatting, sorting and comparing','ezjson is a newly launched tool designed to simplify JSON parsing, formatting, sorting, and comparing. It aims to enhance productivity for developers by providing an easy-to-use interface for working with JSON data.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522664/hacktiv8/blog/ezjson-json-parsing-formatting-sorting-and-comparing-ya5siriv2vp.jpg',21,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Using tRPC for Backend Requests with React','This post explores the integration of tRPC into React applications, emphasizing its benefits in simplifying API communication and enhancing developer productivity. Topics covered include the workflow of tRPC in the frontend context, the benefits of using tRPC compared to traditional API communication methods, setting up tRPC in a React application, and advanced features like real-time data synchronization, security, error handling, and debugging.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522665/hacktiv8/blog/using-trpc-for-backend-requests-with-react-dfrcv3ub5em.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Optimizing React Context and Re-renders','Learn how to optimize React Context to minimize re-renders. The post covers evaluating the causes of re-renders, splitting context into multiple contexts, using the useMemo hook for memoizing context values, and leveraging React.memo for state from higher components. Practical code examples are provided to demonstrate these optimization techniques.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522666/hacktiv8/blog/optimizing-react-context-and-re-renders-gknpq11pte.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A JavaScript developer tries Go for the first time','A software developer with extensive JavaScript experience shares his first impressions on learning Go. Highlights include Go''s approach to error handling with errors as values, the utility of defer statements for resource management, and the requirement for explicit type conversion. The developer appreciates Go''s simplicity, readability, and the fact that it enforces one way to do things, which is beneficial for large teams working on complex codebases.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522667/hacktiv8/blog/a-javascript-developer-tries-go-for-the-first-time-gjzl1qgty0r.jpg',14,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','50 Best Websites for Web Design Inspiration and Ideas','Discover a curated list of 50 best websites offering web design inspiration and ideas. These resources cater to various needs, from business and ecommerce to portfolios and landing pages. Sources are categorized into multipurpose, focused, and niched inspirations, including both free and paid options. Special mentions include award galleries and website builder showcases.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522668/hacktiv8/blog/50-best-websites-for-web-design-inspiration-and-ideas-wf4w7s6gr7s.jpg',21,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Xterm.js','Xterm.js allows building browser-based terminals. To get started, install it via npm and include xterm.js and xterm.css in your HTML. Then, create a div for the terminal and initialize the Terminal object with the `open` function. Xterm.js is widely used in various applications, from online IDEs like SourceLair and Visual Studio Code to cloud platforms like Proxmox VE and Azure Cloud Shell.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522669/hacktiv8/blog/xterm.js-o0i1b703be.jpg',8,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Create Dockerfiles with GenAI','The post explores the use of generative AI (GenAI) for generating Dockerfiles, highlighting how AI tools like ChatGPT can analyze projects and create Dockerfiles with improved best practices. By providing specific functions and prompts, the AI can automate Dockerfile creation, employing advanced techniques like multi-stage builds and cache mounts, aimed at enhancing efficiency and adaptability. The content emphasizes practical examples and ongoing evaluation of AI''s role in developer workflows.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522669/hacktiv8/blog/how-to-create-dockerfiles-with-genai-vb827k59o4a.jpg',3,1) RETURNING \"id\",\"created_at\",\"updated_at\",\"title\",\"content\",\"img_url\",\"category_id\",\"author_id\";"
  },
  "sql": "INSERT INTO \"Blog_Posts\" (\"id\",\"created_at\",\"updated_at\",\"title\",\"content\",\"img_url\",\"category_id\",\"author_id\") VALUES (DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Uno Platform Error & Performance Monitoring with Raygun','The post provides a detailed guide on integrating Raygun for error and performance monitoring in Uno Platform applications, aiming to help developers enhance their productivity and application reliability. It highlights setup steps, key features, and benefits of using Raygun with Uno Platform.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522544/hacktiv8/blog/uno-platform-error-and-performance-monitoring-with-raygun-a1euieujac.jpg',3,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Using Web Authentication (OAuth2) to access Figma from Windows and Uno Platform Application','This post guides you through the process of using the Uno.Extensions web authentication package to simplify OAuth2 authentication and interact with the Figma API from a Windows and Uno Platform application. It covers configuring app settings, registering authentication and API endpoints, and handling token refreshes. The application setup allows logging into Figma and retrieving user information, demonstrating the benefits of using a streamlined web authentication flow.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522545/hacktiv8/blog/using-web-authentication-%28oauth2%29-to-access-figma-from-windows-and-uno-platform-application-qdd9qh80ggn.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','5.3 Release: Full Rider Support and 350+ Enhancements','The latest update to Uno Platform introduces over 350 enhancements, with significant additions including full support for JetBrains Rider, an improved Hot Reload experience, new UI controls (ItemsView and SelectorBar), and support for SkiaSharp 3 Previews. The release also simplifies Uno Platform versioning and shifts focus to .NET 9, discontinuing support for .NET 7.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522546/hacktiv8/blog/5.3-release:-full-rider-support-and-350%2B-enhancements-z2iv9s3uzo.jpg',14,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Webstudio: Open Source Webflow Alternative','Webstudio provides a visual tool that offers complete control over CSS properties, enables quick iterations without writing code, and delivers high optimization for search engines. It supports dynamic templates that change content based on URLs and allows data binding to components. Published sites are hosted separately for better performance and stability. Webstudio is free to start, scalable without hidden costs, and compliant with GDPR regulations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522547/hacktiv8/blog/webstudio:-open-source-webflow-alternative-g52w0otnom.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Mastering Microfrontends: 9 Patterns Every Developer Should Know','Microfrontend architecture allows independent frontend pieces to be developed by separate teams and integrated into a complete system, enabling faster releases and reduced complexity. The post explores nine integration patterns, such as Micro Apps, iFrames, App Shell, and Module Federation, highlighting their strengths and weaknesses. Each pattern addresses different aspects like autonomy, fault isolation, performance, technology compatibility, and flexibility. Combining multiple patterns can help leverage their strengths to meet specific project requirements and maintain long-term application efficiency.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522548/hacktiv8/blog/mastering-microfrontends:-9-patterns-every-developer-should-know-kcej72jd3kn.jpg',1,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Create beautiful images of your code','Learn how to create visually appealing images of your code using Raycast API. Customize by adjusting themes, background, dark mode, padding, and language to enhance readability.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522549/hacktiv8/blog/create-beautiful-images-of-your-code-w6vt6ez6bai.jpg',14,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','🌍 Introducing the New \"Globe Anime\" Component in Eldora UI! 🎨✨','Eldora UI has introduced Globe Anime, a new dynamic and visually appealing globe animation component for web applications. This component aims to enhance the visual experience for developers and designers. More details and integration can be found on the official Eldora UI site.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522550/hacktiv8/blog/introducing-the-new-%22globe-anime%22-component-in-eldora-ui%21-60wd4daiooo.jpg',1,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','🧠 Understanding JavaScript Proxies: Harnessing the Power of Metaprogramming','JavaScript Proxies allow developers to intercept and redefine fundamental operations on objects, offering a powerful tool for enhancing control and flexibility in applications. They are used for tasks like validation, data binding, tracing, debugging, and creating immutable objects. Understanding and using Proxies can significantly improve the dynamism of your JavaScript code.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522551/hacktiv8/blog/understanding-javascript-proxies:-harnessing-the-power-of-metaprogramming-k4xkpe7nij.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Prepare for Coding Interviews in 2024? (with Resources)','In today''s competitive job market, preparing for coding interviews requires a systematic approach. Key areas to focus on include Data Structures and Algorithms, High-Level Design (HLD), Low-Level Design (LLD), CS Fundamentals, and Behavioral questions. Utilize resources such as DesignGuru.io, notable books, video channels, and platforms like Leetcode, Codemia, and Pramp for comprehensive preparation. Mock interviews and company-specific preparation are also essential for success.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522552/hacktiv8/blog/how-to-prepare-for-coding-interviews-in-2024-%28with-resources%29-3xnstgvphql.jpg',16,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Cache Optimization on NextJS Without Vercel','Optimizing cache in a Next.js application, even without using Vercel, can significantly enhance load times, scalability, and user experience. Next.js offers several built-in features for caching, such as Static Site Generation (SSG) and Incremental Static Regeneration (ISR), which pre-render pages and update them in the background. Utilizing Cache-Control headers and client-side caching techniques like service workers and local storage can further improve performance. Integrating a Content Delivery Network (CDN) distributes static content globally, ensuring faster load times and reduced server load.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522553/hacktiv8/blog/cache-optimization-on-nextjs-without-vercel-kyn42zr1fi.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','stack-auth/stack: Open-source Clerk/Auth0 alternative','Stack Auth is an open-source, developer-friendly user authentication solution that supports Next.js frontends and backend integrations via REST API. It offers a quick setup and the flexibility to export and self-host user data at any time. The post provides comprehensive setup instructions including dependency installation through Docker, local development execution, and Prisma database initialization. Contributors are encouraged to join their Discord and follow contribution guidelines.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522554/hacktiv8/blog/stack-authstack:-open-source-clerkauth0-alternative-ta07y0g5bir.jpg',3,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','10 modern Node.js runtime features to start using in 2024','Explore 10 modern Node.js runtime features to start using in 2024. Includes the Node.js test runner, native mocking, test coverage, watch mode, .env loader, import.meta support, native timers with promises, permissions model, and policy module.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522554/hacktiv8/blog/10-modern-node.js-runtime-features-to-start-using-in-2024-mwnkeh7jqho.jpg',13,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Pines - A beautiful UI library for Alpine and Tailwind','Pines is a library of animations, sliders, tooltips, accordions, modals, and more! It''s a set of UI elements that can be copy and pasted into any Alpine and Tailwind projects. This is Pines''s first launch.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522555/hacktiv8/blog/pines-a-beautiful-ui-library-for-alpine-and-tailwind-7xxflwk33z.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Performance Benchmarks: Comparing Query Latency across TypeScript ORMs & Databases','Performance benchmarks compare query latencies of three TypeScript ORMs (Prisma, TypeORM, Drizzle) across PostgreSQL databases on AWS RDS, Supabase, and Neon. Benchmarking methodology includes 14 queries, executed 500 times on an EC2 instance to measure query latencies. Results show that performance varies based on the specific query, dataset, schema, and infrastructure. Most queries perform similarly across different ORMs, with some exceptions like ''Nested find all'' queries. Factors such as network latency and limited API features impact the results. Prisma Optimize offers insights and recommendations for better query performance.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522556/hacktiv8/blog/performance-benchmarks:-comparing-query-latency-across-typescript-orms-and-databases-9vr3sbjqk1p.jpg',15,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Tauri 2.0 Release Candidate','Tauri 2.0 has reached its release candidate phase after extensive beta and alpha testing. The focus now is on documentation and fixing critical bugs before the stable release planned for the end of August. Significant changes include the restructuring of core plugins and improvements in mobile development capabilities. An external security audit has also been completed, with all findings addressed. The Tauri team encourages community involvement and contributions to help improve the project further.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522557/hacktiv8/blog/tauri-2.0-release-candidate-f88l6umwdvw.jpg',2,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Introducing UI Coverage','UI Coverage by Cypress introduces a visual approach to test coverage, helping development teams analyze and report on untested areas in their applications. It automatically detects which pages and elements remain untested, providing a dynamic visual map to highlight gaps. This tool simplifies setup, offers instant coverage reports without additional configuration, and enables teams to make data-driven decisions for comprehensive testing and efficient resource allocation.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522559/hacktiv8/blog/introducing-ui-coverage-zj0bxjl7j9.jpg',13,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','v0.dev by Vercel Labs','v0.dev by Vercel Labs A Tweet UI 14 hours ago A cookie consent banner 19 hours ago a sleek pricing page for a SaaS. 18 hours ago. A table of financial invoices 1 hour ago A simple music player 15 hours ago.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522562/hacktiv8/blog/v0.dev-by-vercel-labs-6wo1m0gex5a.jpg',17,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','JavaScript design patterns guide','Developers use design patterns as reusable solutions to common problems. This guide demonstrates several JavaScript design patterns, including creational (factory and builder), structural (adapter and decorator), and behavioral (chain of responsibility and strategy) patterns. Each pattern is illustrated with practical code examples to aid understanding.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522564/hacktiv8/blog/javascript-design-patterns-guide-68qka5puo0x.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','jodigiordano/gg: The software architecture simulator','gg is a light software architecture simulator designed for documentation and presentation purposes. Although still in its proof-of-concept phase, it allows users to define various software architectures and create step-by-step presentations of different usage scenarios. The tool can be started by cloning the repository, installing dependencies, and running the development server.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522565/hacktiv8/blog/jodigiordanogg:-the-software-architecture-simulator-6agl9h0jh6o.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','As a dev, sometimes what keeps me from building something is not having a design to riff off of. This seems like a super cool tool to quickly generate a UI to get things started. Feels like a good starting point and a quick way to remove that mental block!','OpenUI allows users to describe UI using their imagination and see it rendered live. It can convert HTML to various languages like React, Svelte, and Web Components.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522566/hacktiv8/blog/as-a-dev-sometimes-what-keeps-me-from-building-something-is-not-having-a-design-to-riff-off-of.-thi-r1hbprhttes.jpg',18,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','My first experience as a Tech Lead','The author shares their experiences and insights from their journey of becoming a tech lead. Emphasizing the importance of soft skills, they discuss the nuances involved in evaluating candidates, the distinction between junior and senior developers, and their personal anecdote of leading a project for the first time. Valuable lessons from various types of senior developers are also recounted.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522567/hacktiv8/blog/my-first-experience-as-a-tech-lead-1yli648p84y.jpg',16,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','AI Studio','AI Studio allows users to create custom AI characters for Instagram, Messenger, and WhatsApp in the US. Content creators can build AIs to engage their audience by mimicking their tone and expressions. The platform provides a step-by-step guide, offering full customization and control over the AI''s behavior. It also supports the latest Generative AI capabilities, making it easy for anyone to craft conversational AIs based on personal interests.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522568/hacktiv8/blog/ai-studio-gc744ooy785.jpg',6,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','xkcd: CrowdStrike','The post informs readers that xkcd comics are licensed under the Creative Commons Attribution-NonCommercial 2.5 License, allowing free copying and sharing but restricting commercial use.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522569/hacktiv8/blog/xkcd:-crowdstrike-ag3y0deowjl.png',18,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Animations and effects for your tooltips components.','Popply is a new open-source library designed to add dynamic animations and effects to tooltips, enhancing UI and web pages. Created for the web development community, it offers a range of input and output animations for more engaging tooltips. Contributions and feedback are welcome, and the library is available on GitHub.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522570/hacktiv8/blog/animations-and-effects-for-your-tooltips-components.-hcgkn8mzi8u.jpg',1,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Perfio - Web Vitals and Performance Monitoring','Perfio is a new tool, debuted on August 3rd, 2024, designed for web vitals and performance monitoring. It caters to analytics, developer tools, and web design, offering insights to improve website performance.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522571/hacktiv8/blog/perfio-web-vitals-and-performance-monitoring-g8ye3islekp.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Why use displayName when building React components?','The displayName property in React components improves debugging and error messages by providing clear identifiers for components. It is utilized by React DevTools for better navigation and understanding of component hierarchies, and also aids in debugging context objects within the Context API. ESLint rules like react/display-name enforce the use of displayName to maintain consistency in large projects.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522572/hacktiv8/blog/why-use-displayname-when-building-react-components-6dri2y6ykm9.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The final boss of build tools','Vite has rapidly become a key foundation for higher-level innovations in the web ecosystem, with many frameworks adopting it. The Vite team plans to create a unified toolchain for handling JavaScript and TypeScript from source to production. Meanwhile, Neon offers a managed Postgres service designed to simplify database management tasks. Additionally, recent tech updates include new JavaScript tools, TypeScript 5.6 beta features, and insights from the Stack Overflow 2024 Developer Survey.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522573/hacktiv8/blog/the-final-boss-of-build-tools-78qd06ronka.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','PWABuilder','PWABuilder is a tool designed to help developers create Progressive Web Apps (PWAs) easily. It provides a user-friendly interface and various resources to streamline the process of building and deploying PWAs.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522575/hacktiv8/blog/pwabuilder-4v4jfmifo76.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','LLM Portfolio Projects Ideas to Wow Employers','Discover diverse AI project ideas that can be built using Python and various open-source tools like LangChain, FastAPI, OpenAI API, and Hugging Face. From fine-tuning Llama 3 and creating Q&A retrieval systems to building YouTube summarizers and vacation planning assistants, these projects are designed to enhance your portfolio and impress potential employers. Each project comes with guides or sample links to aid in development, making AI more accessible even to those with fundamental Python skills.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522576/hacktiv8/blog/llm-portfolio-projects-ideas-to-wow-employers-hg9c12ek78j.jpg',6,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','I Found the Best Apps for Productivity in 2024','Discover some lesser-known but highly effective productivity apps for 2024. The list includes tools like Audionotes for turning speech into text, Typeframes for AI-driven video creation, and CompressX for media compression. Additionally, explore apps like ReplyGuy for managing online conversations, Motion for organizing tasks and calendars, and Brain.fm for AI-generated focus music. Each app offers unique features designed to streamline tasks and boost productivity.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522576/hacktiv8/blog/i-found-the-best-apps-for-productivity-in-2024-9qx3kjknqri.jpg',6,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','(comic) Mindset makes all the difference','Comics about work, created with love and fueled by lots of coffee, illustrate how mindset can make a significant difference in the workplace.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522578/hacktiv8/blog/%28comic%29-mindset-makes-all-the-difference-q71cd7ee3ri.jpg',18,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Meet Reworkd: An AI Startup that Automates End-to-end Data Extraction','Reworkd AI is an AI startup that automates the entire web data extraction process. The platform can automatically create and update scraping code in response to website changes, offering a no-code, easy-to-use interface. It streamlines web data pipelines, managing website scans, code generation, data validation, and export. Additional features include self-healing scrapers, scheduling, deduplication, and automated proxy handling. Reworkd simplifies and enhances scalable data extraction, making it accessible for businesses of all sizes.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522579/hacktiv8/blog/meet-reworkd:-an-ai-startup-that-automates-end-to-end-data-extraction-t8pc06m9sh.jpg',6,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Build an Invoice SaaS App with Next.js, Resend, Clerk and Neon Postgres','This tutorial guides you through building a complete invoicing web application using Next.js, Resend, Clerk, and Neon Postgres. Key functionalities include managing customers, creating invoices, printing and sending invoices via email, and handling real-time communication between the frontend and backend. You''ll gain experience with setting up a Postgres database, implementing user authentication with Clerk, and using React-to-print for PDF generation.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522580/hacktiv8/blog/how-to-build-an-invoice-saas-app-with-next.js-resend-clerk-and-neon-postgres-r75be0hp7tp.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Twill — An open source CMS toolkit for Laravel','Twill is an open-source CMS toolkit for Laravel that offers a seamless experience for publishers, designers, and developers. It provides intuitive and powerful publishing tools, design controls, and developer-friendly configurations. Twill can streamline digital workflows, making it easier to manage digital content and launch products efficiently. It is designed to save time and involve entire teams in content management.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522581/hacktiv8/blog/twill-an-open-source-cms-toolkit-for-laravel-nvmivbhu36.png',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Productivity apps I use in 2024','The author shares their current productivity toolset for 2024, highlighting the apps they use daily across both PC and Mac platforms. Key tools include Obsidian for note-taking, Dabble.me for journaling, Raindrop for bookmark management, Notion Calendar for scheduling, Sukha for task-focused flow states, and todometer for task management. The author emphasizes the importance of reassessing and committing to your toolset regularly.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522583/hacktiv8/blog/the-productivity-apps-i-use-in-2024-kxt2vgqwks.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','System Design Interview: Design WhatsApp','This post outlines how to design a high-level system architecture for a messaging app similar to WhatsApp. Key points include handling 10 billion messages daily with plans to double, using RESTful APIs for compatibility, employing WebSockets for real-time communication, and using message queues like Kafka or RabbitMQ for efficient message distribution. The databases considered are NoSQL options like Cassandra and DynamoDB, emphasizing sharding and partitioning for scalability. End-to-end encryption, handling peak traffic, and future enhancements like group chats and media handling are also discussed.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522584/hacktiv8/blog/system-design-interview:-design-whatsapp-cb1x7n4d629.jpg',18,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','This application is built using Next.js, Shadcn, tRPC, Drizzle, and Neon. Designed as an admin interface, it provides a robust and reusable foundation for your new projects.','A comprehensive guide for setting up and running a Next.js Admin Panel Fullstack Project. This template utilizes technologies such as Shadcn, tRPC, Drizzle, and Neon, providing a strong foundation for admin interface projects. Instructions include starting the development server, configuring environment variables, and running tests.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522584/hacktiv8/blog/this-application-is-built-using-next.js-shadcn-trpc-drizzle-and-neon.-designed-as-an-admin-inter-knbq7coikbj.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How I made our React app more performant (includes INP)','The author shares steps to optimize a React app by reducing unnecessary re-renders, especially in a chat layout. Techniques include using React DevTools for profiling, moving state into the appropriate components, and understanding the browser''s rendering process through Interaction to Next Paint (INP). Key advice involves colocating state, measuring performance before optimizing, and understanding the rendering process for effective optimization.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522585/hacktiv8/blog/how-i-made-our-react-app-more-performant-%28includes-inp%29-8j90pmuec1u.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','New in Chrome 127','Chrome 127 introduces improvements for developers including the `font-size-adjust` CSS property for better fallback font legibility, user activation propagation between picture-in-picture documents and their opener, and making scroll containers keyboard focusable by default to enhance accessibility.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522587/hacktiv8/blog/new-in-chrome-127-egl4b9rvh8o.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to build a tech stack for a remote startup','Building a remote startup involves choosing the right tools for communication, organization, and collaboration. Essential tools recommended include Discord for team communication, Linear for task tracking, Figma for design and collaboration, Notion for document management, and Loom for asynchronous information sharing. Additionally, Appwrite''s own backend solutions, Attio for CRM, GitHub Teams for open source contributions, Plausible for privacy-focused analytics, and Dub.co for link-building are highlighted for enhancing remote operations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522587/hacktiv8/blog/how-to-build-a-tech-stack-for-a-remote-startup-q0qvuhsnyhi.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Announcing River UI','River UI provides a user-friendly interface for managing SQL-backed job queues, featuring a backend Go API and a frontend built with React and TypeScript. It allows users to monitor job states, interact by cancelling, retrying, or deleting jobs, and offers features like pausing queues during issues. River UI is available as a Docker image and a pre-built static binary, with future enhancements planned.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522589/hacktiv8/blog/announcing-river-ui-bnwtpgopvga.jpg',3,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','UUIDv7 in 20 languages','UUIDv7 is a 128-bit unique identifier that is time-sortable with 1 ms precision. It can be used as record identifiers in databases, including distributed ones. The post provides an implementation of UUIDv7 in 20 different programming languages.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522589/hacktiv8/blog/uuidv7-in-20-languages-7coq9wmyu3u.jpg',14,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A Gentle Intro to TypeScript','TypeScript enhances JavaScript by adding type annotations that catch errors during compilation, making code more robust and easier to read. Switching to TypeScript involves adding type annotations to your functions, which the TypeScript compiler uses to infer types and ensure only valid operations. This can prevent entire categories of bugs frequently encountered in JavaScript. Tools like Deno and Vite simplify TypeScript adoption by automatically handling TypeScript to JavaScript compilation.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522590/hacktiv8/blog/a-gentle-intro-to-typescript-nnhxf4jmteo.jpg',1,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Secret knowledge to self-host Next.js','Learn how to self-host Next.js applications outside of Vercel. The guide covers deploying to both servers and serverless functions, detailing the setup required for production readiness, including image optimization, caching, CDN configuration, middleware, and redirect and rewrite configurations. It also discusses the tradeoffs between server and serverless deployments and provides tips for efficient server management.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522592/hacktiv8/blog/secret-knowledge-to-self-host-next.js-5n9q9lt68pf.jpg',8,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Mastering Next.js and Beyond: An interview with Lee Robinson','Lee Robinson discusses the challenges and opportunities in software development, the impact of AI, machine learning, and blockchain on software engineering, and the reasons for considering Next.js.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522593/hacktiv8/blog/mastering-next.js-and-beyond:-an-interview-with-lee-robinson-xl7imddeef.jpg',5,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A JavaScript Quine Clock','A JavaScript Quine Clock is a unique clock that uses self-replicating code to display the time. The code continuously updates and generates the current time in a visually appealing way.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522594/hacktiv8/blog/a-javascript-quine-clock-dlqbs84vekh.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Web Frameworks, JavaScript Utilities, Uncats','Issue #573 of Insanely Cool Tools brings a curated collection of unique tools and utilities designed to enhance productivity and spark creativity. Highlights include a range of web frameworks like Next.js boilerplates, customizable React components, and typesafe full-stack setups. The JavaScript utilities section features tools like a rich text editor, barcode scanning, and consent banner utilities. Additionally, uncategorizable tools such as a local development tool for WordPress and an open-source alternative to Netlify are featured.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522595/hacktiv8/blog/web-frameworks-javascript-utilities-uncats-prp6aet4r4o.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Blacksmith - Faster and cheaper hosted GitHub Actions runners','Blacksmith offers faster and cheaper hosted GitHub Actions runners. It was launched on July 24th, 2024, and falls under SaaS and Developer Tools categories. This marks Blacksmith''s initial launch.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522596/hacktiv8/blog/blacksmith-faster-and-cheaper-hosted-github-actions-runners-ob0ojb4zilk.jpg',3,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The 5 Most Anticipated New Features In Strapi 5','Strapi 5 introduces several anticipated features, including content versioning, a new Document Service API, an easier data response structure, partial support for Relay-style GraphQL queries, and a CLI upgrade tool. These enhancements address common challenges and streamline the content management process, making it easier for users to manage drafts, rollback content, count documents, and upgrade versions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522597/hacktiv8/blog/the-5-most-anticipated-new-features-in-strapi-5-ak5rcqpgzgs.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Learn Asynchronous JavaScript','Mastering asynchronous programming is essential for modern JavaScript development, providing efficiencies and responsiveness. A new freeCodeCamp.org YouTube course offers a comprehensive guide, covering synchronous vs asynchronous programming, callbacks, promises, async/await, and the Fetch API. It includes practical projects with APIs like Chuck Norris API, Weather API, and Pokedex API to reinforce learning.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522598/hacktiv8/blog/learn-asynchronous-javascript-5h1ndmdsy3b.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','From ESLint and Prettier to Biome','A developer shares their experience migrating from ESLint and Prettier to Biome, highlighting the simplicity, good defaults, and error messages of Biome. They also mention the drawbacks, such as the use of JSON for configuration and the lack of some ESLint features. The post provides information on how to set up Biome and how it handles linting staged files. Overall, the migration was smooth and the developer recommends giving Biome a try.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522599/hacktiv8/blog/from-eslint-and-prettier-to-biome-ju2qczjvxx.jpg',14,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A JavaScript developer tries Go for the first time','A JavaScript developer shares their first impressions of the Go programming language, highlighting its error handling, defer statement, explicit type conversion, switch statement, pointers, simple type system, and consistent approach to coding.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522600/hacktiv8/blog/a-javascript-developer-tries-go-for-the-first-time-f0eshgj7qch.jpg',14,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Vite + React + TS','Combining Vite with React and TypeScript offers a powerful and efficient development setup. Vite provides a fast build tool while TypeScript enhances code quality in React applications. This combination ensures a smoother and more performant developer experience.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522600/hacktiv8/blog/vite-%2B-react-%2B-ts-5jf8nitv2mw.jpg',1,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','useplunk/plunk: The Open-Source Email Platform','Plunk is an open-source email platform built on AWS SES for sending emails from applications. It supports transactional emails, automations, and broadcasts. The platform can be self-hosted using the driaug/plunk Docker image, and detailed deployment instructions are available in the documentation. Contributions are encouraged, with guidelines provided in CONTRIBUTING.md.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522601/hacktiv8/blog/useplunkplunk:-the-open-source-email-platform-e8ukh7amg1.jpg',3,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Never trust Frontend code','A developer investigates an unusual error where a user attempted to purchase an item with the wrong currency, revealing vulnerabilities in client-side code. The solution uncovered shows the importance of not trusting frontend code and placing strong restrictions on what APIs can accept. The investigation emphasized using server-side code for critical operations to enhance security.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522602/hacktiv8/blog/never-trust-frontend-code-lazt3rumnt.jpg',7,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Advanced Animation Techniques with Anime.js','Learn about advanced animation techniques using the anime.js library. Discover common animations on modern websites, the importance of mastering advanced animation in web development, and explore keyframe animations, easing functions, staggering animations, path animations, and SVG morphing animations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522603/hacktiv8/blog/advanced-animation-techniques-with-anime.js-k54gfkg77z.jpg',1,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Tiny macOS utility apps I love - Part 1','This post marks the beginning of a series highlighting tiny macOS utility apps that enhance productivity. It covers three apps: PixelSnap, for precise on-screen measurements; CleanShot, a feature-rich screenshot utility; and Paletro, which consolidates keyboard shortcuts across apps into a single command palette. These apps streamline workflows and integrate seamlessly into various design and development tasks.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522604/hacktiv8/blog/tiny-macos-utility-apps-i-love-part-1-4hkckj0x2ap.jpg',18,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Web Workers, Comlink, Vite and TanStack Query','Discover how to use Web Workers with Comlink and TanStack Query in a Vite-built project. Learn to offload expensive computations to Web Workers, enhancing UI performance without blocking the main thread. The post details the setup, including using vite-plugin-comlink for smoother integration, and demonstrates using TanStack Query to manage async data interactions effectively.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522605/hacktiv8/blog/web-workers-comlink-vite-and-tanstack-query-ds1j2fvh4fa.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','7 Web Dev Tools You Didn’t Know You Needed','Discover seven lesser-known web development tools designed to enhance your coding efficiency and creativity. Tools like WhatFont for identifying web fonts, GitKraken for simplifying Git workflows, JSON Schema for validating JSON data, BrowserStack for cross-browser testing, Insomnia for API debugging, Squoosh for image optimization, and Storybook for UI component management are highlighted. These tools offer numerous features to improve your projects and streamline your development process.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522605/hacktiv8/blog/7-web-dev-tools-you-didn%27t-know-you-needed-m6fuvprp6n.jpg',1,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Build Your Own React State Management Library in Under 40 Lines of Code - With Typescript Support','Learn how to build your own React state management library in under 40 lines of code with TypeScript support. Explore the use of the useSyncExternalStore hook and why React context may not be the best option for state management.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522606/hacktiv8/blog/build-your-own-react-state-management-library-in-under-40-lines-of-code-with-typescript-support-2cmn386m79c.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Ultimate Price Tracker','RupeeSpot offers a comprehensive collection of current top deals from popular e-commerce stores such as Amazon, Flipkart, Ajio, Nike, and Croma. The platform aims to help users find significant discounts on a variety of products including fashion, beauty, and travel accessories. Highlighted deals include a wide range of products with details on discounts and ratings.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522607/hacktiv8/blog/the-ultimate-price-tracker-wjpcsofq8wm.jpg',19,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Storybook 8.2','Storybook 8.2 introduces several enhancements aimed at improving component testing, including new test hooks, portable stories for React, Vue 3, and Svelte, and consolidated dependency management. The release also features a streamlined onboarding process, an improved website with better documentation, and numerous other improvements and bug fixes. Developers can try the new version by initializing a new project or upgrading an existing one using Storybook''s CLI.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522608/hacktiv8/blog/storybook-8.2-il99k9sn8li.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','taubyte/tau: Open source distributed Platform as a Service (PaaS). A self-hosted Vercel / Netlify / Cloudflare alternative.','Tau is an open-source, distributed Platform as a Service (PaaS) designed to compete with major providers like Vercel, Netlify, and Cloudflare. It''s a developer-friendly framework focused on minimal configuration, auto-discovery, and peer-to-peer networking. Using Git for infrastructure management, Tau emphasizes local development and seamless production deployment. Features include WebAssembly support, content-addressed storage, and a plugin system for extensibility.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522609/hacktiv8/blog/taubytetau:-open-source-distributed-platform-as-a-service-%28paas%29.-a-self-hosted-vercel-netlify-su7lx3axtt.jpg',8,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','✧˚ Outstanding Portfolio for the inspiration - 05','Alana Goyal is the founder and managing partner of Basecase Capital, partnering with multiple companies such as Ashby, Astral, and Supabase. She contributes to open-source projects like Branded and Eventbase. Alana has a rich history in product management, having worked at Samsara, Greylock, Blend, AppDynamics, and Natera. She studied computer science at Columbia University.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522610/hacktiv8/blog/o-outstanding-portfolio-for-the-inspiration-05-w4kouasstq.jpg',16,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','JS Library Tools, Git/CLI, Build Tools','Discover new tools for JavaScript libraries, Git/CLI, and build tools. Highlights include Catena for type-safe APIs, Layer Cake for Svelte visualizations, several Git-related tools like ntcharts, Hookdeck CLI, superfile, and build tools including unplugin-parcel-macros and npm-check-extras. Also, learn about the Meco app for reading newsletters and commercial apps like Penify.dev and FILE0.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522610/hacktiv8/blog/js-library-tools-gitcli-build-tools-igr7j8mc3hq.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Add Facebook Pixel in Next.js 14 App Router','Learn how to integrate Facebook Pixel into your Next.js 14 app using the new App Router. The guide includes steps to create a Facebook Pixel, install it using Next.js''s <Script> component, and verify the installation to enhance your web tracking and marketing strategies.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522611/hacktiv8/blog/how-to-add-facebook-pixel-in-next.js-14-app-router-dylbnngcpt4.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Using qr-code: a customizable, animate-able HTML element','The `qr-code` library offers developers a way to create customizable, animated, and SVG-based QR codes that can be integrated into any modern web application. It provides various customization options, including color changes, custom shapes, and logo insertion. The library works across all major frontend frameworks such as React, Angular, and Svelte, and comes with a simple API for building animations. It also supports download and print features for generated QR codes, making it versatile for different use cases.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522612/hacktiv8/blog/using-qr-code:-a-customizable-animate-able-html-element-wr34pmlopi9.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Improved lazy loading','The post discusses the design and implementation of an ORM named Tempest, focusing on improved lazy loading mechanisms. The key approach includes using typed properties for static analysis, making minimal configuration necessary by inferring relations directly from property types and docblocks. It contrasts Tempest''s strict lazy loading with Laravel''s default approach which allows lazy loading, thereby preventing n+1 query problems and optimizing performance. The post also explores PHP''s technical details, including handling uninitialized properties and triggering property accessors for lazy loading.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522613/hacktiv8/blog/improved-lazy-loading-pg2corwok4.jpg',14,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Implement Directus Auth in Next.js 14','Learn how to implement Directus Auth in Next.js 14, register new users, and perform CRUD operations on posts.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522614/hacktiv8/blog/implement-directus-auth-in-next.js-14-ihhvjsgpzj.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Create a PC game using JavaScript','Learn to create a Flappy Bird-like game in JavaScript using the KAPLAY library and package it for PC installation with Tauri. The comprehensive course includes setting up the development environment, loading assets, implementing player logic, building the game, and creating a score UI. Suitable for beginners and experienced developers, this tutorial provides practical hands-on experience in game development and desktop application packaging.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522615/hacktiv8/blog/create-a-pc-game-using-javascript-9cvr4dfz9l.jpg',10,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Tried and tested, I highly recommend! 💪🏻','Codeium is a free AI-powered coding assistant that offers features similar to GitHub Copilot, including code completions, support for multiple programming languages, IDE integrations, and data encryption. It provides limitless code completions, chatbots for AI suggestions, and intelligent searches within IDEs. Unlike Copilot, it is free for individual users and offers enhanced functionalities and security compliance (SOC 2 Type II). It supports over 70 programming languages and offers various installation methods, including browser-based playground and IDE extensions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522616/hacktiv8/blog/tried-and-tested-i-highly-recommend%21-db7de3nxl2.jpg',6,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Storyblok live editing with Next.js App Router and React Server Components','Learn how to set up live editing support with Storyblok''s full React Server Components approach for Next.js. Two ways to set up a Next.js app with Storyblok. Clever solution to retain live editing support when using the server-side approach with Storyblok.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522617/hacktiv8/blog/storyblok-live-editing-with-next.js-app-router-and-react-server-components-kq49qg63knr.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Futures: await vs unawaited vs ignore','When calling a method that returns a Future, you can use ''await'', ''unawaited'', or ''ignore''. This choice affects how your code handles exceptions thrown by the Future. Understanding the differences is crucial for proper error handling in asynchronous programming.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522618/hacktiv8/blog/futures:-await-vs-unawaited-vs-ignore-xb9f7y8org.jpg',14,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','New without parentheses in PHP 8.4','PHP 8.4 introduces a feature allowing developers to create new objects without parentheses, simplifying code and enabling method chaining directly on newly created objects. This update extends to methods, properties, static methods, and even supports dynamic and anonymous classes. However, constructor brackets remain mandatory for class instantiation to avoid parsing ambiguities. Despite minor limitations, this syntactic sugar promises to enhance coding efficiency.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522619/hacktiv8/blog/new-without-parentheses-in-php-8.4-uivfs8kyq1i.jpg',14,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','SEESAW ✦ Design Inspiration','Discover a range of innovative and creative projects from diverse fields such as AI video analysis, electric road trips, sustainable living cabins, and much more. This daily updated list showcases exemplary work in web design, product design, branding, and technology, serving as a rich source of inspiration for designers and developers.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522621/hacktiv8/blog/seesaw-design-inspiration-lue5mo9kscq.jpg',18,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Uppy','Uppy is a sleek and modular open-source JavaScript file uploader that allows fetching files both locally and from remote sources like Dropbox or Instagram. It seamlessly integrates into existing stacks and offers features such as large file upload resilience, image editing, and generated thumbnails. Uppy is compatible with multiple frameworks including React and comes with Companion to simplify remote file handling and authentication. Built with accessibility and community-driven development, Uppy enhances file uploading with reliability and ease of use.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522622/hacktiv8/blog/uppy-68ji3s2p1e.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Node FINALLY Supports TypeScript',NULL,'https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522622/hacktiv8/blog/node-finally-supports-typescript-72zhf9fp2aj.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Optimizing Web Backends','The post discusses common techniques for optimizing web backend performance, focusing on issues related to high response times. It categorizes optimization strategies into three main layers: Application, Database, and Infrastructure. Key methods include optimizing algorithms, using asynchronous functions, leveraging concurrency, indexing databases, scaling databases, data compression, using CDNs, upgrading to HTTP/2 or HTTP/3, and replicating infrastructure. Continuous measurement and testing are emphasized to ensure effectiveness.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522623/hacktiv8/blog/optimizing-web-backends-f8e7oyxftka.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','(comic) Time check','Comics about work, created with love and fueled by lots of coffee. Subscribe to Work Chronicles for more entertaining and relatable comic strips.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522624/hacktiv8/blog/%28comic%29-time-check-0vn148g20hui.jpg',16,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Clean Code: 7 tips to write clean functions','Writing clean functions ensures that your code is readable, maintainable, and less prone to errors. Key tips include keeping functions small and well-named, limiting parameters, reducing nesting by returning early, writing pure functions without side effects, avoiding boolean flags, and using comments sparingly. Good coding is about communication between programmers, so clarity and simplicity are paramount.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522625/hacktiv8/blog/clean-code:-7-tips-to-write-clean-functions-sa4qcxp7f2.jpg',13,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','What’s New in React 19?','React 19 introduces async functions and the useTransition hook, revolutionizing state management and data handling. New features such as Actions for data mutations, optimistic updates with useOptimistic, streamlined form handling with useActionState, and server components enhance the development experience. The update also improves hydration error reporting, ref handling, stylesheet management, and support for custom elements and document metadata.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522626/hacktiv8/blog/what%27s-new-in-react-19-6q8n9jkrm7r.jpg',1,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Building fast, fuzzy site search with Laravel and Typesense','Learn how to create a fast and fuzzy search functionality in a Laravel application using Typesense. The author provides a step-by-step guide to setting up a Todo model, configuring Laravel Scout, and creating Laravel Controllers and Views to synchronize data with Typesense. This setup allows developers to easily implement advanced search features, including handling typographical errors, with minimal code changes.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522627/hacktiv8/blog/building-fast-fuzzy-site-search-with-laravel-and-typesense-8ctn3ffnm1n.jpg',1,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','7 Levels Of Engineers Describe Software’s Most Important Skill','Engineers from various levels at companies like Meta, Pinterest, Instacart, and Slack shared the most crucial skills for their positions. From learning existing patterns as a new grad to combining business acumen and technical expertise as a distinguished engineer, each level comes with unique challenges and advice for growth. Consistently, the importance of building relationships and understanding the business was emphasized as vital for career progression.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522628/hacktiv8/blog/7-levels-of-engineers-describe-software%27s-most-important-skill-6jzy0edldk6.jpg',16,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','I tried React Compiler today, and guess what… 😉','The article explores the use of React Compiler, a tool developed by the React core team, to solve the problem of unnecessary re-renders in React components. It discusses the installation process, provides examples of using React Compiler, and evaluates its effectiveness in real-world scenarios. The author concludes that while React Compiler can improve performance in some cases, manual memoization techniques such as React.memo, useMemo, and useCallback are still necessary to optimize component rendering.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522629/hacktiv8/blog/i-tried-react-compiler-today-and-guess-what...-4jp8q88oqpf.jpg',14,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Inverted border-radius using CSS mask','Learn how to use a CSS mask to create an inverted radius corner with minimal code, without the need for extra elements or pseudo-elements, and optimized with CSS variables.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522630/hacktiv8/blog/inverted-border-radius-using-css-mask-1cpymf6oiti.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Self-hosted Open Source Alternatives to Google Photos','To achieve a private Google Photos-like experience, consider using self-hosted, open-source alternatives like Immich, PhotoPrism, and Nextcloud Photos. These platforms offer varying features such as facial recognition, automatic backups, and mobile apps. Options like Chevereto and LibrePhotos cater to more simplistic needs, while Piwigo offers extensive customizability. Photoview and Lychee have their unique benefits, and Ente provides a hassle-free, encrypted cloud solution without the need for self-hosting.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522631/hacktiv8/blog/self-hosted-open-source-alternatives-to-google-photos-pu2etulehlp.jpg',8,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Explore new hooks coming up in React 19','React 19 introduces new hooks that streamline common tasks, such as handling form actions, tracking form submissions, and updating the UI with optimistic outcomes. These hooks save time, promote code reusability, and result in better user interfaces.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522632/hacktiv8/blog/explore-new-hooks-coming-up-in-react-19-7wr6jexavec.jpg',1,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','My Ongoing Project 🎉','RupeeSpot offers a comprehensive collection of current top deals from popular e-commerce stores such as Amazon, Flipkart, Ajio, Nike, and Croma. The platform aims to help users find significant discounts on a variety of products including fashion, beauty, and travel accessories. Highlighted deals include a wide range of products with details on discounts and ratings.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522633/hacktiv8/blog/my-ongoing-project-1zljcwnnhw8.jpg',19,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Zsh Shell Tricks I Wish I’d Known Earlier','Enhance your command-line productivity with Zsh! Zsh is a powerful Unix shell known for its robust features like command-line editing, spell checking, and programmable completion. This guide offers practical tips on cursor navigation, line editing, globbing, command history, parameter expansion, and custom commands. Learn to navigate directories efficiently, create and bind custom commands, and use Zsh’s advanced features to optimize your workflow. Whether you''re a developer, system administrator, DevOps engineer, or tech enthusiast, mastering Zsh can significantly boost your efficiency.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522634/hacktiv8/blog/the-zsh-shell-tricks-i-wish-i%27d-known-earlier-clb3wfwpbk.jpg',3,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','An Interactive guide to understanding SVG. How well do you know your SVG elements and attributes?','SVGs provide a scalable way to create graphics for the web with no loss in quality. This reference covers the most popular SVG elements like viewBox, circle, rect, line, polyline, and many more, detailing their attributes and uses. Each element is illustrated with code snippets to demonstrate its application.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522635/hacktiv8/blog/an-interactive-guide-to-understanding-svg.-how-well-do-you-know-your-svg-elements-and-attributes-mu21tdl07xh.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','click on any component to go to code.','LocatorJS is a Chrome Extension enabling developers to click on any component in their browser and directly open its code in VSCode. It supports React, Preact, Solid, Vue, and Svelte, working efficiently with Babel and modern React stacks like Vite, Next.js, or Create React App. This tool allows quick navigation within the codebase, boosting productivity. It is open-source under the MIT license and can be used in production-like environments with added support for styled-components.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522636/hacktiv8/blog/click-on-any-component-to-go-to-code.-ot8qqjt4r7s.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to set priorities?','Setting priorities is essential for achieving goals and reducing stress. Prioritization provides clarity, focus, and a better work-life balance. The post discusses several methods for prioritizing tasks: the Eisenhower Matrix helps differentiate urgent and important tasks; the 3-3-3 Rule focuses on critical work; the Ivy Lee Method involves ranking six tasks by importance. For leaders, techniques like the Pareto Principle and OKRs align team efforts with strategic goals. Teams can benefit from the ABCDE Method, MoSCoW Method, and RICE Framework. Combining these approaches can create a tailored, effective productivity system.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522637/hacktiv8/blog/how-to-set-priorities-a8x4qczub6g.jpg',16,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','6 books engineers should read','This post lists six essential books for engineers, emphasizing the depth and practical insights books provide compared to other mediums. Two recommended books are suitable for all experience levels: ''The Pragmatic Programmer'' and Dale Carnegie''s book on winning over colleagues. For senior engineers, four additional books are suggested to enhance leadership, responsibility, and decision-making skills: ''Extreme Ownership'', ''The Phoenix Project'', ''Software Engineering at Google'', and ''Thinking in Bets''. Readers are encouraged to delve deeper into these books for a comprehensive understanding.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522639/hacktiv8/blog/6-books-engineers-should-read-2pgqg93kqv2.jpg',16,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Announcing TypeScript 5.6 Beta','TypeScript 5.6 Beta introduces several new features including disallowed nullish and truthy checks, iterator helper methods, strict builtin iterator checks with the new --strictBuiltinIteratorReturn flag, support for arbitrary module identifiers, a new --noUncheckedSideEffectImports option, and a --noCheck option to skip type checking for faster builds. Region-prioritized diagnostics improve editor performance in large files, and TypeScript can now better handle complex project setups by searching ancestor configuration files for project ownership.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522640/hacktiv8/blog/announcing-typescript-5.6-beta-zmlx5me152l.jpg',14,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','The Differences Between ''Object'', ''{}'', and ''object'' in TypeScript','In TypeScript, ''Object'', ''{}'', and ''object'' serve distinct purposes. ''Object'' (uppercase) describes properties common to all JavaScript objects and can have boxable objects like string, boolean, etc. ''{}'' describes an object with no members and behaves similarly to ''Object'' but represents a different concept. ''object'' (lowercase) refers to any non-primitive type. ''Record<string, any>'' is also often used to represent non-primitive types and is more semantic.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522641/hacktiv8/blog/the-differences-between-%27object%27-%27%27-and-%27object%27-in-typescript-eluzdfgsm3a.jpg',14,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Practical Guide to Creating a Design System','Creating a design system involves selecting a suitable UI framework, defining both light and dark themes, and organizing the system into a reusable package. Using tools like Storybook for documentation and ensuring regression UI testing minimizes unexpected issues. Avoid custom CSS and components to reduce complexity and maintenance costs. While initially labor-intensive, this approach significantly reduces the marginal cost of developing new front-end pages.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522642/hacktiv8/blog/practical-guide-to-creating-a-design-system-o3xvbzbav7.jpg',18,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Benty Org - AI code generator and app builder','Benty Org is an AI-driven code generator and app builder featured on August 7th, 2024. It falls under Developer Tools, Artificial Intelligence, and Development categories. It was first launched on November 14th, 2023, but hasn''t been rated yet.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522642/hacktiv8/blog/benty-org-ai-code-generator-and-app-builder-7pvd61kfw3t.jpg',6,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Customize VS Code Settings – Real Python','Visual Studio Code is an open-source editor that can be tailored for Python development. This guide by instructor Philipp Acsany covers customizing VS Code settings to create a cleaner and more productive coding environment. Key topics include working with user settings, creating profiles, adjusting specific settings, cleaning up the interface, and exporting profiles for reuse. The course features 15 lessons, video subtitles, transcripts, downloadable resources, and a Q&A session with Python experts.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522643/hacktiv8/blog/customize-vs-code-settings-real-python-brz9axqchj.jpg',14,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Trending','Kreativa is an award-winning design studio that has been shaping digital products since 2008.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522644/hacktiv8/blog/trending-nd6abkpwya8.jpg',19,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Codeium: The Best Github Copilot Alternative','Codeium is a free AI-powered coding assistant that offers features similar to GitHub Copilot, including code completions, support for multiple programming languages, IDE integrations, and data encryption. It provides limitless code completions, chatbots for AI suggestions, and intelligent searches within IDEs. Unlike Copilot, it is free for individual users and offers enhanced functionalities and security compliance (SOC 2 Type II). It supports over 70 programming languages and offers various installation methods, including browser-based playground and IDE extensions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522646/hacktiv8/blog/codeium:-the-best-github-copilot-alternative-mqsfbamoloh.jpg',6,3),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Figma fiasco.','Figma''s latest updates, featuring new AI capabilities and a revamped user interface, have generated significant dissatisfaction among users. Critics argue that the changes prioritize profit over user experience, complicate simple tasks, and cater to non-designers. The restructured UI and AI functionalities are considered not only unnecessary but also detrimental to the workflow of professional designers. Many are considering alternatives like Penpot and Sketch due to these frustrations.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522647/hacktiv8/blog/figma-fiasco.-y15xum1p3q.jpg',18,10),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Million.js adoption guide: Overview, examples, and alternatives','Million.js is an open source, minimalistic JavaScript compiler designed to enhance React performance by reducing memory usage and improving rendering speed. It uses a granular approach for DOM updates and introduces the concept of block components, which are optimized higher-order components. While it offers various advantages, including low memory usage and efficient updates, it has some drawbacks and a limited feature set compared to other frameworks like React, Preact, and Vue.js. The guide provides steps for getting started with Million.js and offers a comparison with other popular frameworks.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522648/hacktiv8/blog/million.js-adoption-guide:-overview-examples-and-alternatives-zkcp2c1akva.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to access search params in Next.js layouts','In Next.js, layouts remain the same across route changes and don''t re-render, which means they can''t directly access search parameters. To access search params, you should use client components which handle these dynamic changes without requiring the entire layout to re-render.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522649/hacktiv8/blog/how-to-access-search-params-in-next.js-layouts-kw6beaeazi.jpg',1,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','ChatGPT is bullshit','Large language models like ChatGPT are producing falsehoods more accurately described as ''bullshit'' rather than ''hallucinations''. These models generate human-like text by analyzing probabilities rather than aiming for truth. Describing their inaccuracies as bullshit is argued to be a more useful framework for understanding and discussing their behavior, particularly since these models are designed to produce convincing text rather than accurate information.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522650/hacktiv8/blog/chatgpt-is-bullshit-dr8mpor98sw.jpg',6,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Exploring the Creative Potential of Atropos.js for Web Design','Explore the creative potential of Atropos.js in web design. Atropos.js is a versatile JavaScript library that enhances web design with scroll-based animations, parallax effects, and seamless integration with popular frameworks. It facilitates the creation of unique and memorable user experiences, improves website performance, and offers design flexibility. Learn how to build a scroll-based gallery using Atropos.js, Axios, and React.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522651/hacktiv8/blog/exploring-the-creative-potential-of-atropos.js-for-web-design-dbds9fhs7z.jpg',1,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Private cloud for your photos, videos and more','Ente Auth is an open-source 2FA authenticator offering end-to-end encrypted backups and cross-platform sync. It allows users to view next authentication codes, easily identify tokens by icons, organize them with tags, pin favorite services, and use a search function. It supports offline mode and import of tokens via QR code, manual entry, or bulk import. Ente is fully open-source, allowing data export and import without lock-ins.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522652/hacktiv8/blog/private-cloud-for-your-photos-videos-and-more-en3djb15jvk.jpg',8,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','From Web to Native with React','React Native enables web developers with experience in React to create native mobile apps using JavaScript or TypeScript. It allows for multi-platform code sharing between iOS and Android from a single codebase. Expo is recommended as a framework to bridge the gaps in React Native core capabilities, providing essential tools for production apps. Key differences between web and native development include the use of UI primitives and styling methods. Developers should avoid certain common pitfalls, such as using array.map for rendering large lists or the logical AND operator in rendering. Key native-specific concepts include build signing, deep linking, gestures, haptics, and handling the on-screen keyboard.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522653/hacktiv8/blog/from-web-to-native-with-react-ta5k2fibxch.jpg',2,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to animate width: auto using React, Next.js and Framer Motion','Learn how to animate the ''width: auto'' property using React, Next.js, and Framer Motion. This guide walks you through setting up a Next.js project, adding necessary HTML and CSS, and implementing animations using Framer Motion to create dynamic and visually pleasing transitions.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522654/hacktiv8/blog/how-to-animate-width:-auto-using-react-next.js-and-framer-motion-s1dbiveb679.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','(comic) Cold Calls','Enjoy comics about work that are made with dedication and a love for coffee. Subscribe to Work Chronicles for more amusing content.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522655/hacktiv8/blog/%28comic%29-cold-calls-dhwdwrdp6ta.jpg',20,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','🚀 Create An Attractive GitHub Profile README 📝','Enhance your GitHub profile with a standout README using a comprehensive custom template. Your README is crucial for making a great first impression on potential employers and collaborators. Start by setting up a special README repository named exactly as your GitHub username. Add a warm introduction, an ''About Me'' section, and detailed sections for resume, experience, coding handles, and tech stack. Highlight key projects, show stats and activity, and end with social links and contact information. Utilize GitHub Actions for automating recent activities and merged PRs. Incorporate additional elements like jokes or Spotify music for a personal touch. Follow the guide for a visually appealing and organized README.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522656/hacktiv8/blog/create-an-attractive-github-profile-readme-8uf7ks6pg55.jpg',1,7),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Node.js is Not Single-Threaded','Node.js, often perceived as a single-threaded platform, utilizes an event-driven, non-blocking architecture to handle I/O operations efficiently. While it manages most operations via a single thread, it also employs the libuv library, which uses an event demultiplexer and a thread pool for certain operations (like file I/O or DNS queries) that can''t be handled asynchronously. This allows Node.js to maximize resource utilization and handle multiple client requests concurrently.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522657/hacktiv8/blog/node.js-is-not-single-threaded-jhqkqg503bj.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','I''m tired of it','AI-generated content is pervasive, often creating bland, inaccurate articles that lack true value. The author criticizes this trend, emphasizing the importance of human-crafted content that showcases effort and unique perspectives. Highlighting examples of pointless AI-generated articles and the inefficiency of email communication due to AI, the appeal is to maintain authenticity and personal touch in writing.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522658/hacktiv8/blog/i%27m-tired-of-it-gja5aibc44q.png',6,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','darrenburns/posting: The modern API client that lives in your terminal.','Posting is a terminal-based HTTP client designed for efficient keyboard-centric interactions. It stores requests locally in YAML files, ensuring easy version control. Key features include ''jump mode'' navigation, environment/variable management with autocompletion, various themes, and a command palette. Installation requires Python 3.11 or later and can be done using pipx. Users can also import OpenAPI 3.x specifications to create collections. Configuration is flexible, supporting YAML files, environment variables, and .env files.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522659/hacktiv8/blog/darrenburnsposting:-the-modern-api-client-that-lives-in-your-terminal.-51i832lh2x.jpg',13,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Ascendio - Ascend a turborepo project in seconds','Ascendio is a SaaS tool launched on August 7th, 2024, designed to help developers manage turborepo projects efficiently. It is the first version of this developer tool aiming to simplify and speed up turborepo project workflows.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522660/hacktiv8/blog/ascendio-ascend-a-turborepo-project-in-seconds-seejsvdh5jl.jpg',21,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Handling file uploads in Next.js using UploadThing','UploadThing is an open-source tool designed to simplify file uploads in full-stack TypeScript applications. By leveraging this tool, developers can effortlessly handle file uploads, manage authentication, and maintain a seamless user experience. UploadThing integrates well with Next.js, and it offers customizable upload parameters, secure storage solutions, and serverless functions to handle various processes like metadata storage and callback notifications. The guide demonstrates setting up UploadThing, integrating it with Next.js, and utilizing components to upload and manage files effectively.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522660/hacktiv8/blog/handling-file-uploads-in-next.js-using-uploadthing-8uuzgcdhpc.jpg',1,2),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Announcing: A new Init. Faster. Smoother. Better.','Appwrite announced a new Init event happening from August 19 to 23, 2024. Over five days, they will reveal new products, features, and potentially new SDKs. The event includes exciting Discord sessions with special guests, a live coding session by Dennis Ivy, and exclusive swag giveaways. Participants need a unique ticket to join and can register online.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522661/hacktiv8/blog/announcing:-a-new-init.-faster.-smoother.-better.-316j656rzcx.jpg',21,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How Google handles JavaScript throughout the indexing process – Vercel','Understanding how search engines crawl, render, and index web pages is vital for optimizing sites for SEO. Google has significantly evolved in rendering capabilities over the years, now using modern Chrome for rendering all HTML pages and dynamically loaded content. Key findings debunk myths like Google''s inability to render JavaScript, and show that there is no fundamental difference in how JavaScript-heavy pages are treated compared to static HTML. Recommendations include using JavaScript frameworks freely, ensuring critical resources are not blocked, and using server-side rendering for critical SEO elements.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522662/hacktiv8/blog/how-google-handles-javascript-throughout-the-indexing-process-vercel-hrqwsxlery.png',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Talos Linux','Talos Linux is a minimal, secure, and immutable operating system designed for Kubernetes. It supports multiple platforms including cloud, bare metal, and virtualization. All system management is performed through a secure API with mutual TLS authentication, eliminating the need for SSH or console access. Talos follows a hardened, immutable infrastructure approach, runs entirely in memory, and consistently delivers the latest stable versions of Kubernetes and Linux.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522663/hacktiv8/blog/talos-linux-45bskhktyy3.jpg',3,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','ezjson - JSON parsing, formatting, sorting and comparing','ezjson is a newly launched tool designed to simplify JSON parsing, formatting, sorting, and comparing. It aims to enhance productivity for developers by providing an easy-to-use interface for working with JSON data.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522664/hacktiv8/blog/ezjson-json-parsing-formatting-sorting-and-comparing-ya5siriv2vp.jpg',21,6),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Using tRPC for Backend Requests with React','This post explores the integration of tRPC into React applications, emphasizing its benefits in simplifying API communication and enhancing developer productivity. Topics covered include the workflow of tRPC in the frontend context, the benefits of using tRPC compared to traditional API communication methods, setting up tRPC in a React application, and advanced features like real-time data synchronization, security, error handling, and debugging.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522665/hacktiv8/blog/using-trpc-for-backend-requests-with-react-dfrcv3ub5em.jpg',1,5),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Optimizing React Context and Re-renders','Learn how to optimize React Context to minimize re-renders. The post covers evaluating the causes of re-renders, splitting context into multiple contexts, using the useMemo hook for memoizing context values, and leveraging React.memo for state from higher components. Practical code examples are provided to demonstrate these optimization techniques.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522666/hacktiv8/blog/optimizing-react-context-and-re-renders-gknpq11pte.jpg',1,4),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','A JavaScript developer tries Go for the first time','A software developer with extensive JavaScript experience shares his first impressions on learning Go. Highlights include Go''s approach to error handling with errors as values, the utility of defer statements for resource management, and the requirement for explicit type conversion. The developer appreciates Go''s simplicity, readability, and the fact that it enforces one way to do things, which is beneficial for large teams working on complex codebases.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522667/hacktiv8/blog/a-javascript-developer-tries-go-for-the-first-time-gjzl1qgty0r.jpg',14,1),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','50 Best Websites for Web Design Inspiration and Ideas','Discover a curated list of 50 best websites offering web design inspiration and ideas. These resources cater to various needs, from business and ecommerce to portfolios and landing pages. Sources are categorized into multipurpose, focused, and niched inspirations, including both free and paid options. Special mentions include award galleries and website builder showcases.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522668/hacktiv8/blog/50-best-websites-for-web-design-inspiration-and-ideas-wf4w7s6gr7s.jpg',21,9),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','Xterm.js','Xterm.js allows building browser-based terminals. To get started, install it via npm and include xterm.js and xterm.css in your HTML. Then, create a div for the terminal and initialize the Terminal object with the `open` function. Xterm.js is widely used in various applications, from online IDEs like SourceLair and Visual Studio Code to cloud platforms like Proxmox VE and Azure Cloud Shell.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522669/hacktiv8/blog/xterm.js-o0i1b703be.jpg',8,8),(DEFAULT,'2025-06-25 09:02:24.013 +00:00','2025-06-25 09:02:24.013 +00:00','How to Create Dockerfiles with GenAI','The post explores the use of generative AI (GenAI) for generating Dockerfiles, highlighting how AI tools like ChatGPT can analyze projects and create Dockerfiles with improved best practices. By providing specific functions and prompts, the AI can automate Dockerfile creation, employing advanced techniques like multi-stage builds and cache mounts, aimed at enhancing efficiency and adaptability. The content emphasizes practical examples and ongoing evaluation of AI''s role in developer workflows.','https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723522669/hacktiv8/blog/how-to-create-dockerfiles-with-genai-vb827k59o4a.jpg',3,1) RETURNING \"id\",\"created_at\",\"updated_at\",\"title\",\"content\",\"img_url\",\"category_id\",\"author_id\";",
  "parameters": {}
}