[
  {
    "title": "Software Engineer",
    "description": "### Job Overview:\n\n- Assess the integration documentation provided by the client.\n- Develop code utilizing low-latency techniques, ensuring clarity and conciseness in development practices.\n- Articulate a comprehensive technical perspective.\n- Support and troubleshoot any technical issues that arise.\n- Collaborate with the offshore Development Centre in China or other headquarters locations.\n- Configure solutions within the client’s environment.\n- Deploy customized solutions to clients' testing environments for verification.\n- Engage with the client’s IT personnel on infrastructure and environmental matters.\n- Provide guidance to the client’s IT personnel on technical aspects.\n- Deliver 1st and 2nd level production support for issues raised by the client.\n- Implement projects internationally as per project assignments.\n- Adhere to the client’s data confidentiality policies.\n\n### Requirements & Qualifications:\n\n- A Professional Certificate, Advance Diploma, or Bachelor's degree in Computer Science, Software Engineering, or a related field is required.\n- A minimum of 5 years' experience in a software engineering role; experience in banking IT solutions is preferred.\n- Basic understanding of software architecture and microservices concepts.\n- Proficiency in Java, including experience with J2EE-based distributed applications (specifically in Multi-Threading, JDBC/JPA, JMS, JAX-WS, RESTful and SOAP web services, Java Message Service, Spring Framework, JVM, and Garbage Collection tuning).\n- Database experience with DB2, Oracle, and MySQL.\n- Additional experience with frameworks such as Hibernate; familiarity with CTOS B2B integration and DocuSign integration is advantageous.\n- Knowledge of Front End technologies/frameworks: HTML, HTML5, JavaScript, CSS, etc.\n- Experience with CentOS/UNIX operating systems.\n\n### Added Advantage:\n\n- Strong familiarity with trending DevOps tools (e.g., Appium, Jenkins, Nexus, Selenium, JUnit, JMeter, Docker, SonarQube, JIRA, ZenTao).\n- Practical knowledge of ReactJS/AngularJS or any other JavaScript-based framework.\n- Understanding of Agile software development methodologies.\n- Solid conceptual knowledge of Object-Oriented Programming, Design Patterns, Modular Services, and Troubleshooting/Debugging.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536966/hacktiv8/career/software-engineer-a3p9cybfq84.jpg",
    "jobType": "Full-Time",
    "companyId": 1,
    "authorId": 7,
    "createdAt": "2024-08-13T08:16:07.055Z",
    "updatedAt": "2024-08-13T08:16:07.055Z"
  },
  {
    "title": "Software Engineer (Ops)",
    "description": "**Job Title: Server Operations Engineer**\n\n**Responsibilities:**\n- Automate tasks to streamline operational processes.\n- Address server incidents promptly and efficiently.\n- Maintain on-premise servers to ensure optimal performance and reliability.\n- Serve as the first-tier support for server-related issues.\n- Automate linear ticketing based on alerting systems.\n\n**Requirements:**\n- Bachelor's degree (S1) or Diploma (D3) in Computer Science, Information Technology, or a related field.\n- Proficiency in Linux system administration.\n- Strong programming skills in Python, Bash scripting, and Java Spring Boot.\n- Experience with automation tools such as Ansible.\n- Flexibility to work in shifting schedules, including middle and night shifts.\n- Strong problem-solving skills with meticulous attention to detail.\n- Ability to work effectively both independently and collaboratively within a team.\n- Previous experience or internships in a related field are advantageous.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536967/hacktiv8/career/software-engineer-%28ops%29-umnpsaqu6q.png",
    "jobType": "Project-Based",
    "companyId": 2,
    "authorId": 10,
    "createdAt": "2024-08-13T08:16:07.814Z",
    "updatedAt": "2024-08-13T08:16:07.814Z"
  },
  {
    "title": "Engineer Security",
    "description": "**Responsibility**\n- Support project implementation & documentation\n\n**Requirements**\n- Minimum Bachelor Degree in Informatics Engineering, Computer Science, or a related discipline.\n- At least 2 years of experience as a System Security Engineer.\n- Holding one or more relevant certifications (e.g., CCNA / CCNP Security, NSE 4/5/7) is an advantage.\n- A strong interest in IT Security is essential.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536968/hacktiv8/career/engineer-security-a55dx0cmhr7.png",
    "jobType": "Full-Time",
    "companyId": 3,
    "authorId": 5,
    "createdAt": "2024-08-13T08:16:08.626Z",
    "updatedAt": "2024-08-13T08:16:08.626Z"
  },
  {
    "title": "Backend Engineer",
    "description": "**Job Description:**\n\n- Design, develop, improve, and deploy high-quality backend services and APIs using Go.\n- Write high-quality, clean, and maintainable code following engineering best practices.\n- Analyze requirements and develop features based on product specifications.\n- Comprehend the product to continually optimize it, identify and resolve issues, and enhance stability and user experience.\n- Optimize applications for maximum performance and scalability.\n- Collaborate with Project Managers, Product, QA, and Frontend teams to deliver features and enhancements.\n\n**Requirements:**\n\n- Graduates of Computer Science, Informatics, or related fields.\n- Passionate about coding, programming, innovation, and solving challenging problems.\n- In-depth understanding of computer science fundamentals, including data structures, algorithms, operating systems, networks, and databases.\n- Familiarity with backend programming languages such as Go, NodeJS, or Python, with hands-on experience in Go preferred.\n- Proficient with modern version control systems, particularly Git.\n- Strong grasp of SQL and NoSQL databases.\n\n**Location:** Remote/Work From Anywhere",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536968/hacktiv8/career/backend-engineer-noa61thw7c.png",
    "jobType": "Full-Time",
    "companyId": 4,
    "authorId": 5,
    "createdAt": "2024-08-13T08:16:09.340Z",
    "updatedAt": "2024-08-13T08:16:09.340Z"
  },
  {
    "title": "Backend Developer",
    "description": "### Role Description\n\nThis is a full-time on-site role for a **Back End Developer** located in **East Jakarta**. As a Back End Developer, you will be responsible for daily tasks associated with back-end web and software development. You will collaborate closely with the front-end development team to ensure seamless integration and optimal performance of our web applications.\n\n### Qualifications\n\n- Proficient in **Back-End Web Development**, **Software Development**, and **Object-Oriented Programming (OOP)**.\n- Solid understanding of **Front-End Development** and **Programming**.\n- Exceptional **problem-solving** and **analytical skills**.\n- Strong comprehension of **database management systems**.\n- Experience with **API integration** and **version control systems** (e.g., Git).\n- Knowledge of **security** and **data protection best practices**.\n- Demonstrated ability to collaborate and work effectively in a **team environment**.\n- Excellent **written** and **verbal communication skills**.\n- Bachelor's degree in **Computer Science**, **Software Engineering**, or a related field.\n- Relevant certifications, such as **AWS Certified Developer**, are a plus.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536969/hacktiv8/career/backend-developer-da5vw654fpm.jpg",
    "jobType": "Full-Time",
    "companyId": 5,
    "authorId": 3,
    "createdAt": "2024-08-13T08:16:10.547Z",
    "updatedAt": "2024-08-13T08:16:10.547Z"
  },
  {
    "title": "Python Developer",
    "description": "Our client is seeking a qualified Java Developer to join their team. The ideal candidate will possess the following: \n\n**Requirements:**  \n- Bachelor's degree in Computer Science, Engineering, or a related field.  \n- 1-3 years of experience as a Python Developer.  \n- Strong understanding of the Python programming language and its frameworks.  \n- Experience with web frameworks such as Django or Flask.  \n- Familiarity with front-end technologies, including HTML, CSS, and JavaScript.  \n- Knowledge of database systems (SQL, NoSQL).  \n- Experience with version control systems, particularly Git.  \n- Understanding of software development methodologies, including Agile and Scrum.  \n\n**Responsibilities:**  \n- Develop and maintain Python applications and systems.  \n- Collaborate with cross-functional teams to define project requirements.  \n- Create technical specifications and design documents.  \n- Write clean, maintainable, and efficient code.  \n- Perform code reviews and provide constructive feedback.  \n- Test and debug applications to ensure optimal performance.  \n- Deploy applications to production environments.  \n- Monitor and maintain applications post-deployment.  \n- Stay up-to-date with the latest industry trends and technologies.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536970/hacktiv8/career/python-developer-vhj2cf4nck.png",
    "jobType": "Full-Time",
    "companyId": 6,
    "authorId": 6,
    "createdAt": "2024-08-13T08:16:11.389Z",
    "updatedAt": "2024-08-13T08:16:11.389Z"
  },
  {
    "title": "Systems Engineer/System Administrator",
    "description": "Our client is seeking a qualified candidate to fill the position of **Systems Engineer/System Administrator** with the following details:\n\n### **Requirements:**\n- Bachelor's degree in Computer Science, Information Technology, or a related field.\n- Minimum of 3 years of experience as a Systems Administrator, System Engineer, or in a similar role.\n- Proficient in RHEL and Windows Server.\n- Familiarity with Oracle Database, PostgreSQL, and SQL Server.\n- Strong knowledge of network and server management.\n- Experience in virtualization and cloud computing.\n- Familiarity with various operating systems and platforms.\n- Proficiency in scripting and automation tools.\n- Experience with backup and recovery solutions.\n- Knowledge of cybersecurity principles and practices.\n- Experience in database management and administration.\n- Understanding of IT compliance and regulatory requirements.\n- Willingness to stay updated with the latest industry trends and technologies.\n\n### **Responsibilities:**\n- Monitor and maintain IT systems and infrastructure.\n- Configure and install hardware and software components.\n- Manage user accounts and access permissions.\n- Ensure system security and data integrity.\n- Troubleshoot and resolve technical issues in a timely manner.\n- Perform regular system backups and recovery operations.\n- Implement and manage network security measures.\n- Collaborate with the IT team to develop and implement new solutions.\n- Monitor system performance and optimize as necessary.\n- Manage software licenses and ensure compliance standards are met.\n- Plan and execute system upgrades and patches effectively.\n- Ensure high availability and reliability of IT systems.\n- Assist in disaster recovery planning and execution.\n- Stay updated with the latest technology trends and best practices in the industry.\n- Conduct regular system audits and assessments.\n- Develop and enforce IT policies and procedures.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536971/hacktiv8/career/systems-engineersystem-administrator-sequ8gxo6ug.png",
    "jobType": "Full-Time",
    "companyId": 6,
    "authorId": 1,
    "createdAt": "2024-08-13T08:16:12.328Z",
    "updatedAt": "2024-08-13T08:16:12.328Z"
  },
  {
    "title": "Technical Manager",
    "description": "Our client is seeking a qualified candidate to fill the position of Technical Manager. Below are the details of the role:\n\n**Requirements:**\n- Bachelor's degree in Engineering or a related field.\n- 3-5 years of proven experience as an Engineering Manager, Back End Engineer, or in a similar role.\n- Strong technical background in engineering.\n- Excellent leadership and management skills.\n- Proven track record of delivering high-quality projects on time and within budget.\n- Experience with project management tools and software.\n- Knowledge of industry standards and best practices.\n- Ability to manage multiple projects simultaneously.\n- Experience with budgeting and resource allocation.\n\n**Job Description:**\n- Lead and manage engineering teams to deliver high-quality projects.\n- Oversee the day-to-day operations of the engineering department.\n- Ensure that all projects are completed to the highest standards.\n- Collaborate closely with other departments to align engineering projects with company goals.\n- Mentor and develop team members.\n- Manage resources and implement best practices to improve efficiency.\n- Set performance goals and conduct performance reviews.\n- Provide constructive feedback to team members.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536972/hacktiv8/career/technical-manager-7v10qjcjnr2.png",
    "jobType": "Full-Time",
    "companyId": 6,
    "authorId": 3,
    "createdAt": "2024-08-13T08:16:13.008Z",
    "updatedAt": "2024-08-13T08:16:13.008Z"
  },
  {
    "title": "Sr Java Developer",
    "description": "**Job Title: Java Developer**  \nOur client is looking for a Java Developer to join their team with the following qualifications and responsibilities:  \n\n**Requirements:**  \n- Minimum 3 years of experience as a Java Developer  \n- Proven experience in the Banking Industry  \n- Strong proficiency in Java programming language  \n- Expertise in the Java Spring Boot framework  \n- Familiarity with backend frameworks like Hibernate is a plus  \n- Experience with database management systems such as MySQL or PostgreSQL  \n- Knowledge of RESTful API design and development  \n- Understanding of version control systems (e.g., Git)  \n- Familiarity with Agile development methodologies  \n- Excellent problem-solving and analytical skills  \n- Strong communication and collaboration abilities  \n- Bachelor's degree in Computer Science or related field  \n- Willing to work from the office in Jakarta  \n\n**Responsibilities:**  \n- Develop and maintain scalable backend solutions using Java Spring Boot  \n- Collaborate with cross-functional teams to define and implement backend features  \n- Design and optimize database schemas and queries  \n- Create and consume RESTful APIs  \n- Write clean and maintainable code adhering to best practices  \n- Debug and resolve software defects  \n- Participate in code reviews to ensure code quality and standards adherence  \n- Stay up-to-date with industry trends and advancements in backend development",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536973/hacktiv8/career/sr-java-developer-76y8h6x08rb.png",
    "jobType": "Full-Time",
    "companyId": 6,
    "authorId": 4,
    "createdAt": "2024-08-13T08:16:13.823Z",
    "updatedAt": "2024-08-13T08:16:13.823Z"
  },
  {
    "title": "SAP FICO Support Consultant - Group Reporting",
    "description": "Our client is seeking a qualified candidate to fill the SAP FICO role. Please see the details below:\n\n**Responsibilities:**\n- Engage clients in workshops and interviews to analyze group reporting and process requirements.\n- Advise clients on leading practices and SAP recommended processes for group reporting.\n- Design target state SAP group reporting solutions, encouraging clients to adopt standard practices. Analyze application landscapes and design interfaces for SAP group reporting solutions.\n- Configure SAP group reporting, conduct tests, and develop specifications for forms, reports, and interfaces.\n- Lead teams through implementation cycles, including planning, testing, migration, and cutover.\n\n**Qualifications:**\n- Bachelor's degree in Computer Science, Information Systems, or related field.\n- 5+ years of experience working with the SAP FICO module in a large enterprise environment.\n- SAP certification is preferred.\n- Proven skills in delivering SAP group reporting projects.\n- Strong understanding of SAP implementation methodology.\n- At least 5 years of relevant experience in group reporting.\n- Excellent communication and presentation skills in English and Mandarin.\n- Willing to work from the office in Kuala Lumpur.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536974/hacktiv8/career/sap-fico-support-consultant-group-reporting-v6qa3ga5e9s.png",
    "jobType": "Full-Time",
    "companyId": 6,
    "authorId": 8,
    "createdAt": "2024-08-13T08:16:14.774Z",
    "updatedAt": "2024-08-13T08:16:14.774Z"
  },
  {
    "title": "Full Stack Engineer",
    "description": "**Anda Berpengalaman sebagai IT Developer di Perusahaan yang Memiliki Banyak Cabang? Memiliki passion di bidang programming? Memiliki pencapaian sebagai Full Stack Developer?**\n\nPT Jaya Mulia Permata adalah perusahaan grosir yang bergerak di bidang perhiasan dengan lokasi di Jakarta, Bandung, dan Surabaya. Visi kami adalah “Menjadi distributor perhiasan terkemuka di Indonesia dengan merek produk dan kualitas layanan terbaik.” Dengan pengalaman lebih dari 20 tahun, kami telah membangun hubungan dengan pelanggan setia yang tersebar di banyak kota dan daerah.\n\n### Tanggungjawab:\n- Berkolaborasi dengan developer lain untuk mengembangkan dan menerapkan aplikasi.\n- Merancang, membangun, dan memelihara aplikasi.\n- Menulis kode dan pustaka yang efisien, modular, dan dapat digunakan kembali.\n- Menemukan dan menyelesaikan masalah kinerja.\n- Melakukan pemulihan dan audit untuk merekonstruksi riwayat transaksi.\n- Berpartisipasi dalam tinjauan kode.\n- Mengomunikasikan praktik terbaik kepada tim.\n- Mendukung pemecahan masalah terkait IT.\n- Bersedia bekerja dari hari Senin sampai dengan Sabtu.\n\n### Kualifikasi:\n- Pengalaman sebagai backend/frontend developer minimal 2 tahun.\n- Menguasai bahasa pemrograman C#.\n- Ahli dalam SQL, desain database, dan familiar dengan SQL Server.\n- Berpengalaman dalam arsitektur front-end dan back-end untuk aplikasi berskala besar.\n- Berpengalaman dengan praktik terbaik dalam rekayasa perangkat lunak – Git (Github), Docker, ulasan kode, serta unit dan pengujian integrasi.\n- Kemampuan komunikasi spesifikasi teknis yang baik, baik lisan maupun tertulis.\n- Memiliki pengetahuan dasar dalam ilmu komputer — termasuk struktur data dan algoritma.\n- Paham mengenai WPF, XAML, PHP, dan HTML lebih disukai.\n- Memahami keamanan, serangan umum, dan pertahanan.\n- Mampu belajar dengan cepat dan berpikir analitis.\n- Keterampilan troubleshooting yang kuat.\n\nJika Anda tidak hanya ingin bekerja tetapi juga belajar bersama di Sekolah Kehidupan ini, kami tunggu aplikasi Anda sebelum tanggal **30 Agustus 2024. ACTION sekarang juga!**\n\n*All CVs will be handled strictly confidential and only shortlisted candidates will be contacted.*",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536975/hacktiv8/career/full-stack-engineer-1ipdqpvl32z.jpg",
    "jobType": "Full-Time",
    "companyId": 7,
    "authorId": 2,
    "createdAt": "2024-08-13T08:16:15.381Z",
    "updatedAt": "2024-08-13T08:16:15.381Z"
  },
  {
    "title": "RPA Developer [Trainer]",
    "description": "**Kualifikasi:**\n1. Memiliki pengalaman sebagai RPA Developer minimal 1 tahun.\n2. Terbiasa menggunakan tools UiPath.\n3. Terbiasa mengelola aktivitas SIT dan UAT.\n4. Pengalaman dalam SDLC Bank Mandiri lebih diutamakan.\n5. Sertifikasi UiPath lebih diutamakan.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536975/hacktiv8/career/rpa-developer-trainer-yx3pzazexvm.png",
    "jobType": "Full-Time",
    "companyId": 8,
    "authorId": 1,
    "createdAt": "2024-08-13T08:16:16.065Z",
    "updatedAt": "2024-08-13T08:16:16.065Z"
  },
  {
    "title": "Technical Writer",
    "description": "**Kualifikasi :**\n\n- **Pendidikan:** Minimal S1 Ilmu Komputer, Teknik Informatika, atau bidang terkait.\n- **Pengalaman:** Minimal 3 tahun pengalaman dalam pengembangan perangkat lunak, dengan fokus pada pengembangan fullstack.\n- **Kualifikasi Tambahan:** Pengalaman dalam membangun aplikasi web dan mobile dari awal hingga akhir sangat diutamakan.\n- **Pengalaman Khusus untuk Posisi Senior Developer:** Minimal 4 tahun.\n\n**Pengalaman dan Pemahaman Teknologi :**\n- Mahir dalam bahasa pemrograman frontend (HTML, CSS, JavaScript) dan framework populer (React, Angular, Vue.js).\n- Mahir dalam bahasa pemrograman backend (Node.js, Python, PHP, atau lainnya) dan framework terkait (Express.js, Django, Laravel).\n- Pengalaman dengan database relasional (MySQL, PostgreSQL) dan non-relasional (MongoDB).\n- Pemahaman dalam bahasa pemrograman Kotlin atau Java, SDK Android, Android Studio.\n- Pengalaman dalam membangun UI/UX yang menarik dan responsif.\n- Pemahaman yang kuat tentang REST API dan GraphQL.\n\n**Pemahaman Metodologi Pengembangan :**\n- Pengalaman dengan metodologi pengembangan Agile (Scrum, Kanban) dan memahami siklus hidup pengembangan perangkat lunak.\n\n**Keterampilan Komunikasi :**\n- Mampu berkomunikasi dengan jelas dan efektif, baik secara teknis maupun non-teknis, dengan berbagai pemangku kepentingan.\n\n**Keterampilan Kolaborasi :**\n- Mampu bekerja secara efektif dalam tim lintas disiplin.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536976/hacktiv8/career/technical-writer-ns8f945yzy.png",
    "jobType": "Full-Time",
    "companyId": 9,
    "authorId": 7,
    "createdAt": "2024-08-13T08:16:16.815Z",
    "updatedAt": "2024-08-13T08:16:16.815Z"
  },
  {
    "title": "Senior Developer",
    "description": "### Kualifikasi:\n\n- **Pendidikan:** Minimal S1 Ilmu Komputer, Teknik Informatika, atau bidang terkait.\n- **Pengalaman:** Minimal 3 tahun pengalaman dalam pengembangan perangkat lunak, dengan fokus pada pengembangan fullstack.\n- **Pengalaman dalam membangun aplikasi web dan mobile** dari awal hingga akhir sangat diutamakan.\n- **Pengalaman Khusus untuk posisi Senior Developer:** minimal 4 tahun.\n\n### Pengalaman dan Pemahaman Teknologi:\n\n- Mahir dalam bahasa pemrograman frontend (HTML, CSS, JavaScript) dan framework populer (React, Angular, Vue.js).\n- Mahir dalam bahasa pemrograman backend (Node.js, Python, PHP, atau lainnya) dan framework terkait (Express.js, Django, Laravel).\n- Pengalaman dengan database relasional (MySQL, PostgreSQL) dan non-relasional (MongoDB).\n- Pemahaman dalam bahasa pemrograman Kotlin atau Java, SDK Android, Android Studio.\n- Pengalaman dalam membangun UI/UX yang menarik dan responsif.\n- Pemahaman yang kuat tentang REST API dan GraphQL.\n\n### Pemahaman Metodologi Pengembangan:\n\n- Pengalaman dengan metodologi pengembangan Agile (Scrum, Kanban) dan memahami siklus hidup pengembangan perangkat lunak.\n\n### Keterampilan:\n\n- **Keterampilan Komunikasi:** Mampu berkomunikasi dengan jelas dan efektif, baik secara teknis maupun non-teknis, dengan berbagai pemangku kepentingan.\n- **Keterampilan Kolaborasi:** Mampu bekerja secara efektif dalam tim lintas fungsi.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536977/hacktiv8/career/senior-developer-mvcsb8ixfx.png",
    "jobType": "Full-Time",
    "companyId": 9,
    "authorId": 5,
    "createdAt": "2024-08-13T08:16:17.391Z",
    "updatedAt": "2024-08-13T08:16:17.391Z"
  },
  {
    "title": "Full Stack Developer",
    "description": "### Job Description\n\n**Position:** Mobile App Developer with Python Expertise\n\n**Requirements:**\n- Minimum of 2 years of experience in mobile app development, with a focus on Flutter.\n- Over 2 years of Python development experience, proficient in frameworks such as FastAPI.\n- Strong understanding of asynchronous processing, multithreading, and concurrent programming techniques.\n- Solid foundation in cryptographic principles, including encryption/decryption, hash functions, and digital signatures.\n- Familiarity with Json Web Tokens (JWT) for secure authentication and authorization.\n- Extensive experience in MySQL database design and optimization.\n- At least 2 years of experience working with message brokering systems, preferably RabbitMQ or Pub/Sub.\n- Hands-on experience with GitHub Actions or equivalent CI/CD tools.\n\n**Qualifications:**\n- Bachelor's degree in Computer Science, Mathematics, or a related engineering or science field from a recognized institution. Candidates with degrees in other fields who possess relevant skills are encouraged to apply.\n- Proven portfolio of application development with at least one published app on the web, Google Play Store, or Apple App Store.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536977/hacktiv8/career/full-stack-developer-x3n0tueq9c.png",
    "jobType": "Full-Time",
    "companyId": 10,
    "authorId": 8,
    "createdAt": "2024-08-13T08:16:18.042Z",
    "updatedAt": "2024-08-13T08:16:18.042Z"
  },
  {
    "title": "Full Stack Net Developer for Insurance Industry",
    "description": "### Job Title: Fullstack/Backend Developer \n\n**Requirements:**\n- Minimum of 2 years of experience as a Fullstack or Backend Developer utilizing .Net.\n- Proficient in **.Net, React Js, C#, MVC, SQL Server, API**.\n- Additional skills in using Postman and Swagger are a plus.\n- Must be able to **Work from the Office (WFO)**.\n\n**Work Scope:**\n- Responsible for fixing bugs in legacy systems and addressing technical debt.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536987/hacktiv8/career/full-stack-net-developer-for-insurance-industry-ukkm9hmxs2j.png",
    "jobType": "Project-Based",
    "companyId": 11,
    "authorId": 7,
    "createdAt": "2024-08-13T08:16:27.655Z",
    "updatedAt": "2024-08-13T08:16:27.655Z"
  },
  {
    "title": "Senior Full Stack Engineer - Python Nodejs C#",
    "description": "### Job Summary:\n\nWe are looking for a talented Software Engineer proficient in both C# and Python to join our innovative development team. The ideal candidate will possess a robust software development background, a passion for coding, and the capability to manage multiple projects concurrently.\n\n### Key Responsibilities:\n- Develop, test, and maintain high-quality software using C# and Python.\n- Collaborate with cross-functional teams to define, design, and deploy new features.\n- Debug and resolve software defects and issues.\n- Optimize and refactor existing code to enhance performance and maintainability.\n- Participate in code reviews and offer constructive feedback to teammates.\n- Contribute to the design and architecture of novel software solutions.\n- Write and maintain comprehensive documentation for software applications.\n- Stay informed about the latest industry trends and technologies.\n\n### Qualifications:\n- Bachelor’s degree in Computer Science, Engineering, or a related field, or equivalent practical experience.\n- Proven experience as a Software Engineer or in a similar role.\n- Strong proficiency in both C# and Python programming languages.\n- Familiarity with .NET framework and associated technologies.\n- Knowledge of front-end technologies (e.g., HTML, CSS, JavaScript) is a plus.\n- Experience with version control systems, such as Git.\n- Strong problem-solving abilities and attention to detail.\n- Excellent communication and teamwork skills.\n- Ability to manage multiple tasks effectively and prioritize accordingly.\n\n### Preferred Skills:\n- Experience with web development frameworks such as Django (Python) or ASP.NET (C#).\n- Familiarity with cloud platforms (e.g., AWS, Azure, GCP).\n- Experience with database management systems (e.g., SQL Server, MySQL, PostgreSQL).\n- Understanding of software development methodologies (e.g., Agile, Scrum).\n\n### Benefits:\n- Competitive salary with performance-based bonuses.\n- Comprehensive health, dental, and vision insurance.\n- Flexible work hours and remote work options.\n- Opportunities for professional development.\n- A collaborative and inclusive company culture.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536987/hacktiv8/career/senior-full-stack-engineer-python-nodejs-c-2khwobr1qb1.png",
    "jobType": "Full-Time",
    "companyId": 12,
    "authorId": 3,
    "createdAt": "2024-08-13T08:16:28.385Z",
    "updatedAt": "2024-08-13T08:16:28.385Z"
  },
  {
    "title": ".Net Developer",
    "description": "## Job Description\n\nWe are seeking a skilled Developer to enhance our product offerings through customized applications tailored to meet business needs. The ideal candidate will be responsible for the following:\n\n- Develop code and create customized applications to enhance products based on business requirements.\n- Investigate and resolve significant end-user problems, escalating issues when necessary.\n- Provide support for business system analysis and process definition to improve site functionality.\n- Research new web technologies to equip clients with state-of-the-art web capabilities.\n- Develop documentation throughout the Software Development Life Cycle (SDLC) while applying best technical practices and contributing to application architecture with a focus on scalability, maintainability, security, and performance.\n\n### Job Requirements:\n- A minimum of a Bachelor's Degree in Engineering (Computer/Telecommunication), Computer Science, Information Technology, or a related field.\n- At least 5 years of relevant work experience is required for this position.\n- Experience in business intelligence, application development, database development, ETL, and/or data analysis domains with extensive SQL knowledge.\n- Required skills include: .NET, ASP.NET, VB, C#, SQL Server, jQuery, MVC, HTML, CSS, JavaScript, Bootstrap, Talend, Microsoft SSIS, and Entity Framework Core. Proficiency in SQL Server/PostgreSQL and Stored Procedures (SP) is also essential.\n- Knowledge of Object-Oriented Programming is preferred; experience with NHibernate/C# and ASP.NET is a plus.\n- Strong communication and interpersonal skills are essential.\n- Willingness to work on a contract-based outsourcing arrangement.\n- Familiarity with the SDLC (Waterfall methodology) is required, and knowledge of Agile methodologies will be advantageous.\n- Proficiency in developing applications using the .NET Framework and .NET Core (C#).\n- Capability to collaborate effectively within a cross-functional team.\n- Excellent communication skills; ability to communicate fluently in English.\n- Strong task and time management abilities.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536989/hacktiv8/career/.net-developer-79lkunrcptc.png",
    "jobType": "Full-Time",
    "companyId": 13,
    "authorId": 8,
    "createdAt": "2024-08-13T08:16:29.599Z",
    "updatedAt": "2024-08-13T08:16:29.599Z"
  },
  {
    "title": "Internship Backend Programmer",
    "description": "**Kami mencari kandidat terbaik untuk mengisi posisi yang dibutuhkan oleh tim dengan tanggung jawab:**\n\n- Membantu membuat dan mengembangkan aplikasi web yang dibutuhkan perusahaan.\n\n**Kualifikasi:**\n\n- Freshgraduate atau mahasiswa aktif dipersilakan melamar.\n- Terbiasa menggunakan pemrograman **Node JS** dan **Framework Express JS**.\n- Memahami **Database noSQL MongoDB** (Mongoose) dan **Rest API**.\n- Lokasi Magang di area perkantoran Kelapa Gading, Jakarta Utara.\n- Durasi Magang minimal 6 bulan.\n\n**Benefit:**\n\n- Terlibat langsung dalam projek nyata.\n- Tambahan skill dan pengalaman.\n- Sertifikat Internship.\n- Peluang menjadi karyawan.\n- Uang Saku.\n\n**Apabila Anda adalah pribadi yang kami butuhkan, silahkan apply lamaran untuk mengikuti tahap tes onlinenya segera.**",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536989/hacktiv8/career/internship-backend-programmer-7pvra47wzoh.png",
    "jobType": "Full-Time",
    "companyId": 14,
    "authorId": 5,
    "createdAt": "2024-08-13T08:16:30.290Z",
    "updatedAt": "2024-08-13T08:16:30.290Z"
  },
  {
    "title": "Infrastructure and Cloud Engineer",
    "description": "**Job Description:** In this role, you will be responsible for creating and maintaining CI/CD pipelines, enhancing application monitoring, containerizing applications, and reinforcing cloud-native deployments. You will build automation tools, collaborate with various teams, participate in delivery processes, ensure compliance with industry standards, document DevOps practices, and resolve production-related issues. Additionally, you will manage and develop team members, supporting them in the application of DevOps principles.\n\n**Requirements:**\n- 5+ years of application deployment and operations experience on cloud platforms (AWS, GCP, Azure, etc.)\n- Proven experience in creating and maintaining CI/CD pipelines.\n- Familiarity with monitoring tools (Prometheus, Grafana, ELK Stack, etc.).\n- Practical knowledge of container technologies such as Docker and Kubernetes.\n- Proficiency in scripting languages such as Python and Bash.\n- Experience with infrastructure as code tools (Terraform, CloudFormation, Ansible, etc.).\n- Strong troubleshooting skills and problem-solving abilities.\n- Effective communication skills for successful teamwork.\n- Project management capabilities.\n- Exceptional documentation skills.\n- Experience in customer proposal/pre-sales.\n- Optional experience with AI, ML, and data lake implementation.\n- Ability to handle cases in English or Japanese.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536990/hacktiv8/career/infrastructure-and-cloud-engineer-xmnjfhnulg.png",
    "jobType": "Full-Time",
    "companyId": 15,
    "authorId": 10,
    "createdAt": "2024-08-13T08:16:31.150Z",
    "updatedAt": "2024-08-13T08:16:31.150Z"
  },
  {
    "title": "Full Stack Developer",
    "description": "**Tanggung Jawab:**\n\n• Mengembangkan dan memelihara aplikasi web.\n\n• Merancang, membangun, dan mengoptimalkan kode front-end dan back-end.\n\n• Berkolaborasi dengan tim desain untuk mengimplementasikan antarmuka pengguna yang responsif dan intuitif.\n\n• Melakukan pengujian dan debugging untuk memastikan kualitas aplikasi.\n\n• Mengintegrasikan API dan layanan pihak ketiga.\n\n• Memastikan aplikasi yang dibangun sesuai dengan standar keamanan dan performa.\n\n• Mengelola database dan melakukan optimasi kueri.\n\n• Menyediakan dukungan teknis dan perbaikan bug secara kontinu.\n\n• Mengikuti perkembangan teknologi terbaru dan menerapkan praktik terbaik dalam pengembangan.\n\n**Kualifikasi:**\n\n• Lulusan S1 di bidang Ilmu Komputer, Teknologi Informasi, atau bidang terkait.\n\n• Pengalaman kerja minimal 1-3 tahun sebagai Fullstack Developer.\n\n• Kemampuan dalam HTML, CSS, dan framework front-end seperti React, Angular, atau Vue.js.\n\n• Pengalaman dengan bahasa pemrograman back-end seperti Node.js, Java, Laravel, atau PHP.\n\n• Pengetahuan tentang sistem manajemen basis data seperti MySQL, PostgreSQL, OracleDB, atau MongoDB.\n\n• Pengalaman dengan penggunaan API dan layanan web (RESTful dan/atau GraphQL).\n\n• Kemampuan untuk menggunakan alat versi kontrol seperti Git.\n\n• Pengalaman dalam pengembangan dan deployment aplikasi di cloud platforms seperti AWS, Google Cloud, atau Azure.\n\n• Keterampilan problem-solving yang baik dan kemampuan untuk bekerja secara mandiri maupun dalam tim.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536991/hacktiv8/career/full-stack-developer-l0ghsnzv2sm.jpg",
    "jobType": "Full-Time",
    "companyId": 16,
    "authorId": 8,
    "createdAt": "2024-08-13T08:16:31.966Z",
    "updatedAt": "2024-08-13T08:16:31.966Z"
  },
  {
    "title": "Backend Developer",
    "description": "### Job Description\n\nWe are seeking a skilled Java Developer with a passion for web application development to join our dynamic team. The ideal candidate will possess the following qualifications:\n\n1. **Strong understanding of J2EE, Spring Boot framework, and MVC concepts.**  \n2. **Strong knowledge of REST APIs and JSON.**  \n3. **Proficient in Java web application deployment and configuration, with experience in Docker, Kubernetes, Kafka, and Microservices architecture as a significant advantage.**  \n4. **Solid understanding of databases (Oracle) and query languages (preferably PL/SQL), with a background in schema design and query optimization being a strong plus.**  \n5. **Basic understanding of Agile methodologies and Scrum practices.**  \n6. **Self-motivated with a can-do attitude and excellent communication skills.**  \n7. **Minimum of 3 years of experience in web application development using Java.**  \n\nIf you are eager to advance your career in a collaborative environment, we encourage you to apply!",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536992/hacktiv8/career/backend-developer-vp8ni60x3mc.png",
    "jobType": "Full-Time",
    "companyId": 17,
    "authorId": 7,
    "createdAt": "2024-08-13T08:16:32.687Z",
    "updatedAt": "2024-08-13T08:16:32.687Z"
  },
  {
    "title": "Lead Java Developer",
    "description": "## Deskripsi Pekerjaan:\n- Merancang dan mengembangkan aplikasi perangkat lunak menggunakan bahasa pemrograman Java.\n- Mengimplementasikan fitur-fitur baru dan memperbaiki bug yang teridentifikasi untuk meningkatkan fungsionalitas dan kinerja aplikasi.\n- Mendefinisikan dan merancang kerangka kerja (framework) yang diperlukan untuk proyek-proyek pengembangan.\n- Memilih teknologi yang tepat dan merancang arsitektur sistem untuk memastikan skalabilitas dan efisiensi aplikasi.\n- Menghasilkan spesifikasi teknis yang terperinci berdasarkan analisis kebutuhan pengguna dan persyaratan bisnis.\n- Menyediakan panduan yang jelas kepada tim pengembangan untuk memastikan pemahaman yang konsisten tentang tujuan dan detail implementasi proyek.\n- Melakukan coding, debugging, dan pengujian aplikasi secara sistematis.\n- Berkolaborasi dengan anggota tim untuk memecahkan masalah teknis dan mengoptimalkan kode aplikasi.\n- Manajemen Waktu dan Pengiriman Proyek.\n\n## Kualifikasi:\n- Lulusan Sarjana di bidang Teknologi Informasi, Sistem Informasi, atau setara.\n- Minimal 5 tahun pengalaman kerja sebagai Java Developer.\n- Diutamakan memiliki pengalaman di Industri teknologi informasi (perangkat lunak), Perbankan, atau Industri Keuangan.\n- Memiliki keahlian dalam bahasa pemrograman Java dan SQL.\n- Memahami PHP, jQuery, Javascript, dan NoSQL.\n- Mampu memimpin tim, melakukan analisis, pemecahan masalah, dan memiliki pemikiran konseptual.\n- Memiliki keterampilan komunikasi dan kolaborasi yang baik.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536992/hacktiv8/career/lead-java-developer-fa56kw3keyg.jpg",
    "jobType": "Full-Time",
    "companyId": 18,
    "authorId": 1,
    "createdAt": "2024-08-13T08:16:33.271Z",
    "updatedAt": "2024-08-13T08:16:33.271Z"
  },
  {
    "title": "IT Security",
    "description": "### Job Description\n\n**Posisi:** Spesialis Keamanan Informasi  \n\n**Kualifikasi:**  \n1. Pengalaman kerja minimal 3 tahun dalam melakukan setup, konfigurasi, dan pengelolaan perangkat firewall, Internet Access Gateway, dan Antivirus, serta mampu melaksanakan Vulnerability Assessment.  \n2. Memiliki pengalaman dalam melakukan uji penetrasi dan penyusunan laporan, serta pembuatan kebijakan dan prosedur.  \n3. Pengetahuan yang kuat dalam Manajemen Risiko.  \n4. Mampu membuat dokumen teknis dalam bahasa Inggris yang jelas dan terstruktur.  \n5. Pengalaman dalam penerapan proses/system Data Loss Prevention.  \n\nKandidat yang memenuhi kualifikasi akan memiliki kesempatan untuk bergabung dan berkontribusi dalam meningkatkan keamanan informasi di perusahaan kami.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536993/hacktiv8/career/it-security-rt0lvddch1.png",
    "jobType": "Project-Based",
    "companyId": 11,
    "authorId": 1,
    "createdAt": "2024-08-13T08:16:34.046Z",
    "updatedAt": "2024-08-13T08:16:34.046Z"
  },
  {
    "title": "Developer RPA (Robotic Process Automation)",
    "description": "### Posisi: Pengembang RPA\n\n**Kualifikasi:**\n- Berpengalaman dalam mengembangkan minimal 3 proyek/aplikasi RPA.\n- Usia maksimal 35 tahun.\n- Pendidikan minimal D3/S1 di bidang Teknologi Informasi atau yang relevan.\n- Memiliki pengetahuan mendalam tentang perancangan dan pengembangan aplikasi.\n- Pemahaman yang kuat tentang konsep database.\n- Kemampuan untuk bekerja baik secara individu maupun dalam tim.\n\n**Tanggung Jawab:**\n- Merancang, mengembangkan, dan mengimplementasikan solusi RPA yang efektif.\n- Berkoordinasi dengan tim IT untuk mengintegrasikan sistem otomasi dengan infrastruktur IT yang ada.\n- Melakukan pemeliharaan dan perbaikan pada aplikasi yang sudah ada.\n- Berpartisipasi dalam semua fase siklus pengembangan perangkat lunak.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536994/hacktiv8/career/developer-rpa-%28robotic-process-automation%29-z9cspuynwja.png",
    "jobType": "Full-Time",
    "companyId": 19,
    "authorId": 3,
    "createdAt": "2024-08-13T08:16:34.808Z",
    "updatedAt": "2024-08-13T08:16:34.808Z"
  },
  {
    "title": "Software Engineer",
    "description": "**Qualifications & Experience**\n- Candidate must possess at least a Bachelor's degree in Information Systems / Technology or a related field.\n- A minimum of 1-2 years of experience in Python programming is required.\n- Familiarity with APIs is essential.\n- A fundamental understanding of Python frameworks such as Flask API, Fast API, Django Frameworks, as well as React JS and AngularJS is desirable.\n- Proven experience in software development using PHP is a plus.\n- Knowledge of database technologies including MySQL, SQL Server, and PostgreSQL is preferred.\n- Proficiency in fundamental front-end languages, such as HTML, CSS, and JavaScript is necessary.\n\n**Tasks & Responsibilities**\n- Develop software using C# .NET based on user requirements.\n- Provide support, updates, and maintenance for deployed applications.\n- Revise, update, refactor, and debug source code as necessary.\n- Perform daily database maintenance and data updates.\n- Analyze user requirements and transform them into usable applications.\n\n**Benefits**\n- BPJS Kesehatan (Health Insurance)\n- BPJS Ketenagakerjaan (Employment Insurance)",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536995/hacktiv8/career/software-engineer-106gxfpq540d.png",
    "jobType": "Full-Time",
    "companyId": 20,
    "authorId": 6,
    "createdAt": "2024-08-13T08:16:35.553Z",
    "updatedAt": "2024-08-13T08:16:35.553Z"
  },
  {
    "title": "Backend Developer (Golang)",
    "description": "**Job Descriptions**\n- Membangun perangkat lunak yang kuat dan skalabel dengan mengembangkan fitur baru, melakukan debugging, dan mengoptimalkan aplikasi.\n- Menulis kode bersih untuk mengembangkan aplikasi web fungsional.\n- Berkolaborasi dengan pengembang front-end untuk mengintegrasikan elemen yang terlihat oleh pengguna dengan logika sisi server.\n- Mengembangkan dan mengusulkan produk atau fitur baru dengan memantau tren industri.\n- Bekerja sama dengan desainer, manajer produk, dan administrator sistem untuk mengidentifikasi dan membangun fitur baru.\n\n**Job Requirements**\n- Pendidikan minimal S1 dalam Ilmu Komputer/Sistem Informasi/Teknologi Informasi.\n- Pengalaman minimal 1 tahun di bidang yang sama.\n- Pengetahuan dan pengalaman yang kuat dalam pengembangan back-end (Golang, PHP, REST API, dll).\n- Familiaritas dengan database seperti MySQL, SQL Server.\n- Pengalaman dengan Linux/Unix dan manajemen server.\n- Keahlian dalam penggunaan alat manajemen kode seperti Git.\n- Familiar dengan layanan web hosting seperti AWS.\n- Pengetahuan tentang arsitektur MVC.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536995/hacktiv8/career/backend-developer-%28golang%29-lqflzhumgm8.jpg",
    "jobType": "Full-Time",
    "companyId": 21,
    "authorId": 6,
    "createdAt": "2024-08-13T08:16:36.282Z",
    "updatedAt": "2024-08-13T08:16:36.282Z"
  },
  {
    "title": "ERP Technical (Experienced as Fullstack Developer)",
    "description": "**Job Description**\n- Perform monitoring of ERP data.\n- Develop API (Application Programming Interface).\n- Modify applications to support business needs.\n\n**Job Requirements**\n- Currently pursuing a degree in Information Technology (S1).\n- Minimum of 1 year of experience as a Fullstack Developer (both Back-end and Front-end development are required).\n- Proficient and experienced in using Node.js and Angular.\n- Understanding the basic flow of ERP systems is a plus.\n- Willingness to work in South Jakarta.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536996/hacktiv8/career/erp-technical-%28experienced-as-fullstack-developer%29-wa61v8zzsxd.png",
    "jobType": "Full-Time",
    "companyId": 22,
    "authorId": 4,
    "createdAt": "2024-08-13T08:16:37.090Z",
    "updatedAt": "2024-08-13T08:16:37.090Z"
  },
  {
    "title": "Senior Fullstack Engineer",
    "description": "**Job Description:**\n\n- Design, develop, and maintain software applications.\n- Collaborate with engineers to build and deploy applications.\n- Work with product managers to understand and implement product requirements.\n- Partner with QA engineers to test and debug applications.\n- Stay updated on the latest technologies and trends in web development.\n\n**Requirements:**\n\n- 5+ years of relevant experience in building large-scale applications or similar experience.\n- Proficient in JavaScript, HTML5, CSS3, and other front-end technologies such as AMP and CDN.\n- Familiarity with at least one mainstream framework or library (e.g., React, Vue) and experience in architecture design and development of complex application scenarios.\n- Knowledge of server-side technologies and languages (e.g., Node.js, Python, Go) with experience in medium to large system development preferred.\n- Moderate experience with one or more CI/CD frameworks.\n- Strong focus on technology optimization with proven success in improving development quality, efficiency, and user experience.\n- Passion for technology with strong skills in learning, communication, collaboration, and problem solving.\n- Familiarity with SCRUM and Agile Software Development Life Cycle (SDLC) methodology.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536997/hacktiv8/career/senior-fullstack-engineer-vw9h67a6l9.jpg",
    "jobType": "Full-Time",
    "companyId": 23,
    "authorId": 6,
    "createdAt": "2024-08-13T08:16:37.707Z",
    "updatedAt": "2024-08-13T08:16:37.707Z"
  },
  {
    "title": "Odoo Developer",
    "description": "Kami mencari individu yang berpengalaman dan berdedikasi untuk bergabung dengan tim kami dengan tanggung jawab sebagai berikut:\n\n- Pembuatan/Pengembangan software\n- Melakukan System Integration Test (SIT) dan Unit Test (UT)\n- Mendampingi User Acceptance Test (UAT)\n- Mensupport kebutuhan technical\n- Coaching Technical Team\n\nJika Anda tertarik, silakan kirimkan lamaran Anda.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536997/hacktiv8/career/odoo-developer-e0t4denpsga.png",
    "jobType": "Full-Time",
    "companyId": 24,
    "authorId": 9,
    "createdAt": "2024-08-13T08:16:38.317Z",
    "updatedAt": "2024-08-13T08:16:38.317Z"
  },
  {
    "title": "INSTRUKTUR PENGEMBANGAN PERMAINAN SOFTWARE (SCRATCH & UNITY)",
    "description": "Oregon Cyber School, in collaboration with Euro Management Indonesia, is dedicated to providing innovative and engaging learning experiences for junior high and high school students. We are seeking a passionate and knowledgeable Software Game Development Instructor to join our team and inspire the next generation of game developers.\n\n**Kriteria:**\n1. Pria/Wanita, maks 35thn.\n2. Background pendidikan S1 Ilmu Komputer, Pengembangan Permainan, Pendidikan, atau bidang terkait, diutamakan dari berbagai perguruan tinggi negeri maupun swasta.\n3. Memiliki keahlian dalam membuat game dengan MIT Scratch & Unity.\n4. Bersedia kerja Partime atau freelance.\n5. Pengalaman mengajar minimal 1 tahun.\n6. Mampu bekerja dalam tim.\n\nJika Anda tertarik untuk bergabung dengan tim kami, silahkan datang langsung dengan membawa CV ke Kantor kami di:\n🏛 Euro Management Indonesia - Rumah Eropa\nJl. Teuku Cik Ditiro No. 61, Menteng, Jakarta Pusat 10310\n\n**Batas waktu pendaftaran: 25 Juli 2024**",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536998/hacktiv8/career/instruktur-pengembangan-permainan-software-%28scratch-and-unity%29-0kxrpjz0jyz.jpg",
    "jobType": "Part-Time",
    "companyId": 25,
    "authorId": 9,
    "createdAt": "2024-08-13T08:16:39.045Z",
    "updatedAt": "2024-08-13T08:16:39.046Z"
  },
  {
    "title": "Golang Developer",
    "description": "### Position: Golang Developer\n\n**Requirement:**\n- Diploma/Bachelor/Professional Degree in Engineering: Computer/Information/Tech/Science/Math or relevant field.\n- Minimum of 1 year of professional experience in work/project oriented towards Golang or designing and developing software applications using Golang (Go).\n- Familiarity with common Go routine and channel patterns.\n- Experience working with APIs, particularly RESTful services and gRPC with Protobuf.\n- Proficient in utilizing the full suite of Go tools and frameworks, especially the Echo Framework.\n- Ability to write clear and effective Godoc comments.\n- Knowledge of Git and Bitbucket.\n- Fast learner with strong problem-solving abilities, teamwork, and analytical skills.\n\n**Job Responsibilities:**\n- Write scalable, robust, testable, efficient, and easily maintainable code.\n- Translate software requirements into stable, working, high-performance software.\n- Participate actively in architectural and design decisions to build an efficient microservices distributed architecture.\n- Proactively identify architectural weaknesses and propose optimal solutions.\n- Conduct code reviews and approve Pull Requests to ensure compliance with good software design practices and architectural intent.\n- Debug and resolve software defects effectively.\n- Maintain high standards for code quality and refactor for optimized solutions.\n- Accurately estimate the effort required to complete tasks.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723536999/hacktiv8/career/golang-developer-nla5yxp2dz.png",
    "jobType": "Full-Time",
    "companyId": 13,
    "authorId": 9,
    "createdAt": "2024-08-13T08:16:39.855Z",
    "updatedAt": "2024-08-13T08:16:39.855Z"
  },
  {
    "title": "Java Developer",
    "description": "### Job Description: Back-End Developer\n\n**Responsibilities:**  \n1. Develop back-end services, including web APIs and schedulers, in accordance with requirements and technology standards.  \n2. Deploy tested back-end services and ensure all functionalities are performing optimally.  \n3. Maintain and troubleshoot issues related to back-end services promptly.  \n4. Monitor and ensure the availability of back-end services to guarantee uninterrupted operations.  \n5. Write high-quality, clean, and maintainable code, along with comprehensive technical documentation.  \n6. Collaborate effectively with other developers, technical leads, UI/UX designers, QA teams, product owners, tribe leaders, and other stakeholders to build robust applications.\n\n**Additional Expertise Required:**  \n1. Strong understanding of J2EE, the Spring framework, and MVC concepts.  \n2. Proficiency in REST API and JSON standards.  \n3. Solid knowledge of Java web application deployment and configuration. Familiarity with Docker, Kubernetes, and Microservices architecture is a significant advantage.  \n4. Good understanding of database querying, preferably PL/SQL, with experience in schema design and query optimization being a definite plus.  \n5. Basic understanding of Agile and Scrum methodologies.  \n6. Self-motivated with a proactive attitude and excellent communication skills.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537000/hacktiv8/career/java-developer-af4fwt1p82n.jpg",
    "jobType": "Full-Time",
    "companyId": 26,
    "authorId": 8,
    "createdAt": "2024-08-13T08:16:40.525Z",
    "updatedAt": "2024-08-13T08:16:40.525Z"
  },
  {
    "title": "IT Business Anlayst - Banking Industry",
    "description": "## Job Description\n\n### Posisi: IT Project Coordinator / Project Manager / Business Analyst\n\n**Kualifikasi:**\n- Memiliki pengalaman sebagai IT Project Coordinator, Project Manager, atau Business Analyst dan telah berhasil mengimplementasikan minimal 1 full cycle project.\n- Memiliki kemampuan interpersonal, komunikasi, kolaborasi, dan presentasi yang baik.\n- Mampu membuat dokumentasi sesuai dengan kebutuhan pengembangan proyek.\n- Dapat bekerja baik dalam tim maupun secara individual.\n- Mempunyai pengalaman dalam reporting.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537000/hacktiv8/career/it-business-anlayst-banking-industry-jkem4pcfwgr.png",
    "jobType": "Full-Time",
    "companyId": 11,
    "authorId": 5,
    "createdAt": "2024-08-13T08:16:41.151Z",
    "updatedAt": "2024-08-13T08:16:41.151Z"
  },
  {
    "title": "Software Engineer",
    "description": "We are seeking a talented Full Stack Developer to create scalable software solutions. As part of a cross-functional team, you will be responsible for the entire software development life cycle, from conception through to deployment.\n\nAs a Full Stack Developer, you should have strong proficiency in both front-end and back-end coding languages, development frameworks, and third-party libraries. Familiarity with Agile methodologies is a plus.\n\n**Responsibilities:**\n- Develop core systems using the YII Framework with expertise in PHP v.7x/8x.\n- Collaborate with development teams and product managers to brainstorm and ideate innovative software solutions, particularly in retail applications.\n- Design both client-side and server-side architecture.\n- Create engaging and visually appealing front-end applications.\n- Develop and maintain effective databases and applications.\n- Write efficient APIs.\n- Test software to ensure responsiveness and optimal performance.\n- Troubleshoot, debug, and upgrade existing software.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537001/hacktiv8/career/software-engineer-e624hwomh6d.jpg",
    "jobType": "Full-Time",
    "companyId": 27,
    "authorId": 3,
    "createdAt": "2024-08-13T08:16:42.255Z",
    "updatedAt": "2024-08-13T08:16:42.255Z"
  },
  {
    "title": "Developer Whatap",
    "description": "**Job Title: Software Developer**\n\n**Overview:**  \nWe are seeking a motivated and skilled Software Developer to join our dynamic team. The ideal candidate will be responsible for conceptualizing and executing high-quality code to create exceptional software. You will test your code, identify issues, and refine it to ensure optimal performance. Additionally, you will provide support to our customers and partners by troubleshooting any software-related concerns.\n\n**Responsibilities:**  \n- Detect and troubleshoot software issues  \n- Write clear, quality code for software applications and conduct test reviews  \n- Develop, implement, and test APIs  \n- Contribute insights on software development projects  \n- Demonstrate strong analytical and problem-solving skills  \n- Exhibit a sense of responsibility in your work  \n- Quickly learn and thrive in a fast-paced work environment  \n\n**Qualifications:**  \n- Proficiency in programming languages and relational databases  \n- Strong debugging and troubleshooting abilities  \n- Minimum of 3 years of development experience  \n- Knowledge of Business Process Finance Companies  \n- Familiarity with ITIL 4  \n- Mastery of Linux OS and Windows Server operating systems  \n- Expertise in computer networks (TCP/IP, DNS, etc.)  \n- Experience with at least one programming language (Bash, Python)  \n- Proficient in using monitoring tools (Whatap, Elastic, Dynatrace) as part of the monitoring team  \n- Demonstrated skills in the monitoring applications relevant to the role  \n\nJoin us to make a significant impact in the software development landscape.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537002/hacktiv8/career/developer-whatap-w5stzz5lft.png",
    "jobType": "Full-Time",
    "companyId": 28,
    "authorId": 7,
    "createdAt": "2024-08-13T08:16:42.960Z",
    "updatedAt": "2024-08-13T08:16:42.960Z"
  },
  {
    "title": "Engineer Onsite for Redhat  System Administrator",
    "description": "### Job Description\n\n**Key Responsibilities:**  \n- Provide administrative support on Red Hat OpenShift Container Platform (OCP), JBOSS, and Red Hat Enterprise Linux (RHEL), which includes:  \n  - Verifying dashboard operation  \n  - Managing the internal registry  \n  - Overseeing user, project, and storage container management  \n  - Monitoring the health of monitoring containers and logging systems  \n  - Logging incident tickets with Red Hat Support and following up on the progress of incident escalation and resolution  \n  - Collaborating with Level 2 and Level 3 support to communicate progress on issues  \n  - Offering expertise and assistance with rapid troubleshooting through advanced system diagnostics. In addition, providing general knowledge transfer and documentation related to the installation and configuration of relevant Red Hat technologies.\n\n**Qualifications:**  \n- Proficiency in Linux commands  \n- Experience in Red Hat System Administration  \n- Red Hat Certified System Administrator (RHCSA) or JBOSS certification is a plus  \n- Understanding of microservices architecture  \n- Experience managing Docker, Kubernetes, and Red Hat OpenShift  \n- Familiarity with Jenkins or Ansible is an added advantage  \n- Strong analytical skills to identify issues and propose effective solutions  \n- Excellent communication skills to coordinate with users and related parties regarding issues.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537003/hacktiv8/career/engineer-onsite-for-redhat-system-administrator-v3q97o6bckc.jpg",
    "jobType": "Full-Time",
    "companyId": 29,
    "authorId": 7,
    "createdAt": "2024-08-13T08:16:43.956Z",
    "updatedAt": "2024-08-13T08:16:43.956Z"
  },
  {
    "title": "Full Stack Developer",
    "description": "### Job Description:\n\n- Manage and develop company and client applications.\n- Design and implement application features based on internal user or client requests.\n- Address error findings from QA/QC during the development and repair processes.\n- Develop, maintain, and enhance web applications using PHP and the Laravel framework.\n- Write efficient SQL queries for MySQL and PostgreSQL databases.\n- Integrate and consume RESTful JSON APIs to improve application functionality.\n- Collaborate with cross-functional teams to define, design, and implement new features.\n- Troubleshoot and debug applications to ensure optimal performance and reliability.\n- Stay updated with emerging technologies and industry trends to continuously improve development processes.\n\n### Job Requirements:\n\n- Reside in Jakarta or Medan.\n- Bachelor’s degree in Computer Science or a related field (preferred).\n- Strong analytical skills.\n- Excellent communication and teamwork abilities.\n- Proven experience as a developer with expertise in the Laravel framework.\n- Solid understanding of database management systems, including MySQL and PostgreSQL.\n- Experience working with RESTful JSON APIs.\n- Proficiency in HTML, CSS, JavaScript, and related web technologies.\n- Strong problem-solving skills and attention to detail.\n- Familiarity with the GIT system / Version Control System.\n- Passionate about software development.\n- Proficiency in at least two of the following programming languages: HMVC PHP Laravel / CI (Laravel preferred), JavaScript, or React JS / Node.js.\n- Strong understanding of database concepts and proficiency in at least two of the following: MySQL, MSSQL, or No-SQL (MongoDB, Firestore).\n- Understanding of microservices.\n- Knowledge of API creation is a plus.\n- Experience with Warehouse Management Systems (WMS) is an advantage.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537004/hacktiv8/career/full-stack-developer-mjd9bj2zf4.jpg",
    "jobType": "Full-Time",
    "companyId": 30,
    "authorId": 6,
    "createdAt": "2024-08-13T08:16:44.612Z",
    "updatedAt": "2024-08-13T08:16:44.612Z"
  },
  {
    "title": "Associate Backend Developer",
    "description": "Hello everyone!\n\nBarito Technologies is currently seeking an Associate Backend Developer to join our dynamic team.\n\n**Requirements:**  \n- Minimum of 3 years of experience with Java Spring Boot.  \n- Familiarity with Scrum and Agile methodologies.  \n- Experience with Docker and microservices architectures.  \n- Strong analytical thinking and effective information retrieval skills.  \n- Proactive problem-solving attitude and a willingness to implement innovative ideas.  \n- Ability to quickly learn new programming languages or frameworks.  \n- Positive demeanor and good interpersonal skills.  \n- Open to opportunities within the insurance industry.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537004/hacktiv8/career/associate-backend-developer-75hh8i34o3h.jpg",
    "jobType": "Full-Time",
    "companyId": 31,
    "authorId": 1,
    "createdAt": "2024-08-13T08:16:45.292Z",
    "updatedAt": "2024-08-13T08:16:45.292Z"
  },
  {
    "title": "Server Engineer",
    "description": "**Deskripsi Pekerjaan:**\n\n- Melakukan Instalasi dan Konfigurasi Server Fisik (Baremetal)\n- Melakukan Instalasi Operating System Linux Server atau Microsoft Windows Server\n- Mengirim Perangkat Server ke Lokasi Data Center\n- Memasang dan Mengintegrasikan Perangkat Server\n\n**Persyaratan:**\n\n- Pendidikan Minimal S1 Jurusan Teknik Informatika atau Sistem Informatika\n- Fresh Graduate / Pengalaman 1 Tahun diutamakan\n- Memiliki Keahlian Networking: Mengerti TCP/IP, DNS, DHCP, VPNs, dan Firewalls\n- Mampu Troubleshoot Operating System\n- Soft Skills yang diperlukan: Problem Solving, Komunikasi, Kerjasama Tim",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537005/hacktiv8/career/server-engineer-1br0bidskyy.png",
    "jobType": "Full-Time",
    "companyId": 32,
    "authorId": 8,
    "createdAt": "2024-08-13T08:16:46.000Z",
    "updatedAt": "2024-08-13T08:16:46.000Z"
  },
  {
    "title": "Fullstack Developer",
    "description": "**Job Description:**\n- Designing the data model structure for the NADI Applications.\n- Coding, debugging, and monitoring document changes for the NADI Application.\n- Conducting thorough testing and debugging of the NADI API.\n- Developing Application Programming Interfaces (APIs) to enhance the functionality of the NADI Mobile Application and ensure it remains up-to-date.\n- Improving the existing data structure within the NADI Applications.\n- Reviewing and planning upgrades for future NADI applications on a scheduled and thorough basis.\n- Providing recommendations for changes and enhancements to the NADI mobile application.\n- Performing related tasks and responsibilities as requested in relation to the Front End Engineer role.\n- Monitoring integration with third-party APIs.\n\n**Requirement:**\n- Male/Female, aged between 28 – 35 years.\n- A candidate must possess at least a Bachelor's Degree in Computer Science, Information Technology, or an equivalent field.\n- At least 2-3 years of working experience with payment gateways (preferred) and related areas.\n- Familiarity with web fundamentals such as HTML, CSS, and JavaScript.\n- Experience using Node.js, Express.js, PHP, Laravel, and Flutter.\n- Familiarity with Git and repository tools, including GitLab and GitHub.\n- Knowledge of NoSQL databases like MongoDB, Redis & RabbitMQ (preferred).\n- Experience with SQL databases, such as PostgreSQL or MySQL.\n- Familiarity with RESTful APIs.\n- Knowledge of payment systems, SMTP, and Firebase Cloud Messaging.\n- Excellent time management skills and logical thinking.\n- Strong problem-solving abilities alongside verbal and written communication skills.\n- Willingness to work in Semarang, Jawa Tengah.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537006/hacktiv8/career/fullstack-developer-99ri61nqir9.jpg",
    "jobType": "Full-Time",
    "companyId": 33,
    "authorId": 7,
    "createdAt": "2024-08-13T08:16:46.613Z",
    "updatedAt": "2024-08-13T08:16:46.613Z"
  },
  {
    "title": "Software Engineer (Front End)",
    "description": "### Job Description:\n\n- Collaborate with the Marketing/Sales teams to understand project requirements, objectives, and client needs.\n- Develop and maintain responsive websites, landing pages, web applications, and other platforms utilizing HTML, CSS, JavaScript, and Vue.js.\n- Optimize website performance and enhance user experience (UX).\n- Provide troubleshooting and technical support for website-related issues and updates.\n- Implement tracking tools to monitor traffic, user behavior, and key metrics.\n- Write and maintain comprehensive software documentation.\n- Plan projects and report directly to the Manager.\n\n### Qualifications:\n\n- Bachelor's or Master's degree in Computer Science, Engineering, or a related field.\n- A minimum of 2 years of experience as a Frontend Engineer, with a strong emphasis on web development.\n- Proficiency in HTML, CSS, JavaScript, TypeScript, and modern frontend frameworks (e.g., Angular, Vue.js).\n- In-depth understanding of RESTful APIs, asynchronous programming, and GraphQL.\n- Familiarity with NPM, CI/CD environments, and container-based platforms (e.g., Docker, Kubernetes).\n- Strong communication skills with the ability to explain technical concepts to both technical and non-technical stakeholders.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537006/hacktiv8/career/software-engineer-%28front-end%29-l5m9nj4sk8s.png",
    "jobType": "Full-Time",
    "companyId": 34,
    "authorId": 8,
    "createdAt": "2024-08-13T08:16:47.256Z",
    "updatedAt": "2024-08-13T08:16:47.256Z"
  },
  {
    "title": "Software Engineer - Odoo Experienced",
    "description": "iSystem Asia is a Technology and Management Consulting Company, focusing on Customer Relationship Management (CRM), Customer Experience Management (CX), & Business Process Management (BPM).\n\n**Job Summary:**\nThe Software Engineer role involves applying engineering principles to software development. Responsibilities include analyzing and modifying existing software as well as designing, coding, constructing, and testing end-user applications that fulfill user needs, utilizing various programming languages. The position also addresses the complexities of large software systems that form the core of organizational operations.\n\nAs an Odoo Programmer, you will be tasked with designing, coding, testing, and maintaining software applications. You will work collaboratively with cross-functional teams to deliver high-quality, scalable, and effective solutions. Moreover, you will handle software projects and address any programming-related complaints or requests.\n\n**Job Description:**\n• Develop and maintain Python applications, ensuring high performance and reliability.\n• Implement Odoo applications in daily operations.\n• Collaborate with team members to design and execute software solutions.\n• Write clean, efficient, and maintainable code.\n• Test and debug code to promptly identify and resolve issues.\n• Contribute to the enhancement of existing software applications.\n• Stay updated on Python best practices and emerging trends.\n\n**Qualifications:**\nWe seek candidates who meet the following requirements:\n• Bachelor’s degree with a minimum GPA of 3.00 in Information System Management, Information Technology, Computer Science, or a related field.\n• Experience in implementing Odoo applications.\n• Excellent command of the English language, both written and verbal.\n• Strong attention to detail and a high degree of accuracy.\n• Ability to multitask and work under tight deadlines.\n• Excellent time management skills.\n• Good interpersonal and communication abilities.\n• Understand the expectations set and demonstrate personal accountability for maintaining performance standards.\n• Recognize how daily work aligns with the team and business priorities.\n• Show a strong commitment to personal learning and development.\n• Actively focus on developing effective communication and relationship-building skills with stakeholders, clients, and team members.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537007/hacktiv8/career/software-engineer-odoo-experienced-qdj11cd3j8j.png",
    "jobType": "Full-Time",
    "companyId": 35,
    "authorId": 8,
    "createdAt": "2024-08-13T08:16:48.051Z",
    "updatedAt": "2024-08-13T08:16:48.051Z"
  },
  {
    "title": "Senior Full Stack Engineer - Python Nodejs C#",
    "description": "### Job Summary:\n\nWe are looking for a talented Software Engineer with proficiency in both C# and Python to join our vibrant development team. The successful candidate will possess a solid foundation in software development, a passion for coding, and the capability to manage multiple projects concurrently.\n\n### Key Responsibilities:\n- Develop, test, and maintain high-quality software solutions utilizing C# and Python.\n- Collaborate with cross-functional teams to define, design, and implement new features.\n- Identify and resolve software defects and issues through debugging processes.\n- Optimize and refactor existing code to enhance performance and maintainability.\n- Participate in code reviews and offer constructive feedback to peers.\n- Contribute to the design and architecture of innovative software solutions.\n- Draft and maintain comprehensive documentation for software applications.\n- Keep abreast of the latest industry trends and technologies.\n\n### Qualifications:\n- Bachelor’s degree in Computer Science, Engineering, or related field, or equivalent practical experience.\n- Proven experience in a Software Engineer role or similar capacity.\n- Strong expertise in C# and Python programming languages.\n- Familiarity with the .NET framework and related technologies.\n- Basic knowledge of front-end technologies (e.g., HTML, CSS, JavaScript) is advantageous.\n- Experience with version control systems, particularly Git.\n- Excellent problem-solving abilities and detail-oriented mindset.\n- Strong communication and teamwork skills.\n- Ability to juggle multiple tasks and effectively prioritize.\n\n### Preferred Skills:\n- Experience with web development frameworks like Django (Python) or ASP.NET (C#).\n- Knowledge of cloud platforms such as AWS, Azure, or GCP.\n- Familiarity with database management systems like SQL Server, MySQL, or PostgreSQL.\n- Understanding of software development methodologies, including Agile and Scrum.\n\n### Benefits:\n- Competitive salary with performance-based bonuses.\n- Comprehensive health, dental, and vision insurance.\n- Flexible work hours along with remote work options.\n- Opportunities for professional development.\n- A collaborative and inclusive company culture.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537008/hacktiv8/career/senior-full-stack-engineer-python-nodejs-c-yxvnuf4zrwp.png",
    "jobType": "Full-Time",
    "companyId": 12,
    "authorId": 4,
    "createdAt": "2024-08-13T08:16:48.739Z",
    "updatedAt": "2024-08-13T08:16:48.739Z"
  },
  {
    "title": "Cybersecurity Engineer",
    "description": "**Job Title: IT Security Engineer**  \n  \n**Job Description:**  \nAs an IT Security Engineer, you will be responsible for implementing, maintaining, and enhancing security controls to safeguard our systems and data. This role requires a proactive individual with strong technical expertise in security tools and technologies, and the ability to respond to security incidents efficiently.  \n  \n**Job Requirements:**  \n- Bachelor's degree in Computer Science, Information Technology, or a related field.  \n- 2 to 6 years of experience in IT security.  \n- Proficiency with SIEM tools such as Splunk, ArcSight, QRadar, or similar platforms.  \n- Strong understanding of security concepts, including threat detection, incident response, and log management.  \n- Relevant certifications (e.g., CEH, ENSA, ECSA) are a plus.  \n- Excellent problem-solving skills and attention to detail.  \n- Strong communication and teamwork abilities.  \n  \n**Key Responsibilities:**  \n- Stay updated with the latest security threats, technologies, and industry trends, and provide recommendations to enhance security posture.  \n- Implement and maintain security controls, ensuring their effectiveness at all times.  \n- Conduct vulnerability assessments and risk assessments to identify and prioritize potential security threats and vulnerabilities.  \n- Engage in incident response activities, including mitigation, investigation, impact analysis, and post-incident recovery.  \n- Collaborate with cross-functional teams to integrate security requirements into design, development, and implementation processes of systems and networks.  \n- Implement and tune configurations on security devices such as SIEM, EDR, Antivirus, Firewall, Domain Controller, IDPS, and others.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537008/hacktiv8/career/cybersecurity-engineer-sone5r5syn9.png",
    "jobType": "Full-Time",
    "companyId": 32,
    "authorId": 1,
    "createdAt": "2024-08-13T08:16:49.687Z",
    "updatedAt": "2024-08-13T08:16:49.687Z"
  },
  {
    "title": "Refrigeration Technician",
    "description": "**Job Descriptions**\n\n- **Installation:** Responsible for installing ice machines at customer locations.\n- **Maintenance:** Conduct regular maintenance and service tasks to ensure optimal machine performance.\n- **Troubleshooting:** Diagnose and repair machine issues promptly and effectively.\n- **Customer Service:** Communicate effectively with clients and address any concerns they may have.\n- **Documentation:** Maintain accurate service and maintenance records for all repairs and installations.\n\n**Qualifications:**\n- Strong technical knowledge and problem-solving skills.\n- Good communication abilities.\n- Relevant certifications or diplomas preferred to enhance credibility.\n\n**Travel Requirements:**\n- Willingness to travel to customer sites for product installation within the city and out of town.\n\n**Job Requirements:**\n- Male candidates preferred.\n- Maximum age of 27 years.\n- Ability to read Isometric Drawings.\n- Experience in electrical and refrigeration machine technology is a plus.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537010/hacktiv8/career/refrigeration-technician-oe3no4lg6bl.jpg",
    "jobType": "Full-Time",
    "companyId": 36,
    "authorId": 5,
    "createdAt": "2024-08-13T08:16:51.221Z",
    "updatedAt": "2024-08-13T08:16:51.221Z"
  },
  {
    "title": "Sr Data Engineer",
    "description": "### Job Description:\n\n- **Design and implement** key components for a highly scalable, distributed, fault-tolerant data collection and analysis system capable of handling large-scale data.\n- **Build** scalable and reliable ETL or ELT pipelines and processes to ingest data from a diverse array of sources.\n- **Maintain and optimize** the performance of data analytics infrastructure to ensure the accurate, reliable, and timely delivery of critical insights for decision-making.\n- **Streamline data access and security** to enable data scientists and analysts to easily access data as needed.\n- **Support teams** by guiding data usage and processing, helping them leverage the platform you are building effectively.\n- **Create and maintain** robust, scalable Machine Learning pipelines that are ready for production.\n\n### Requirements:\n\n- Bachelor’s or Master’s degree from top universities in a quantitative field or STEM.\n- 3-5 years of relevant work experience, particularly in building data infrastructure from scratch (from raw data sources to analysis-ready datasets).\n- Analytical, data-driven, reliable, and results-oriented mindset.\n- Proficient in ETL tools, database design, data APIs, algorithms, and data structures.\n- Proven track record of working with database systems (SQL & NoSQL), cloud data warehousing solutions, and data architecture.\n- Familiarity with programming languages such as Python or Scala (preferred).\n- Knowledge of Google Cloud Platform and its Analytics Stack (e.g., BigQuery, Dataflow).\n- Experience with workflow orchestration tools like Airflow, DagSter, or Prefect.\n- Understanding of Data Science projects is a significant advantage.\n- An agile mindset to adapt to shifting priorities and changes.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537011/hacktiv8/career/sr-data-engineer-gznfhohcgtu.png",
    "jobType": "Full-Time",
    "companyId": 37,
    "authorId": 10,
    "createdAt": "2024-08-13T08:16:52.042Z",
    "updatedAt": "2024-08-13T08:16:52.042Z"
  },
  {
    "title": "WebMethods Developer",
    "description": "### Placement for Banking Syariah Project at Karet Semanggi, South Jakarta\n\n**Responsibilities:**\n- Utilize webMethods for application development and maintenance.\n- Understand and implement banking workflow processes.\n- Develop and maintain code using one or more programming languages.\n- Analyze and troubleshoot problems in existing codebases.\n- Create and maintain technical documentation for projects and processes.\n- Design and document workflow processes using flowcharts.\n\n**Qualifications:**\n- Minimum 1-2 years of experience using Java and webMethods.\n- General understanding of banking workflows.\n- Proficiency in one or more programming languages.\n- Ability to analyze problems and read code.\n- Capable of creating technical documentation.\n- Ability to design workflows using flowcharts.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537012/hacktiv8/career/webmethods-developer-40uoahxmxc1.png",
    "jobType": "Contract",
    "companyId": 38,
    "authorId": 6,
    "createdAt": "2024-08-13T08:16:52.961Z",
    "updatedAt": "2024-08-13T08:16:52.961Z"
  },
  {
    "title": "IT Engineer",
    "description": "### Kualifikasi:\n- **Perempuan** (Fresh graduate are welcome)\n- Maksimal usia 25 tahun (L0/L1)\n- Minimal Pendidikan D3 (L0/L1)\n- Memiliki kemampuan administrasi sistem Linux dasar (L0/L1)\n- Memiliki kemampuan dasar DevOps\n- Bersedia mengikuti pelatihan virtual:\n  - LFCA (L0/L1)\n  - LFCS (L1)\n  - LFS261 (L1)\n- Jika lulus pelatihan, bersedia mengikuti exam LFCA (L0/L1) dan LFCS (L1)\n- Bersedia ditempatkan onsite di salah satu Bank di Jakarta (L0/L1)\n- Bersedia kerja dengan penjadwalan shift (L0/L1)\n\n### Ruang Lingkup Pekerjaan:\n- Bekerja onsite dengan penjadwalan shift (L0/L1)\n- Bertugas sebagai application support helpdesk dan operator aplikasi (L0)\n- Melakukan koordinasi dengan IT engineer lainnya (L0/L1)\n- Melakukan monitoring sistem dan troubleshoot (L1)",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537013/hacktiv8/career/it-engineer-0wh7r1adgev.png",
    "jobType": "Full-Time",
    "companyId": 39,
    "authorId": 2,
    "createdAt": "2024-08-13T08:16:53.596Z",
    "updatedAt": "2024-08-13T08:16:53.596Z"
  },
  {
    "title": "Fullstack Developer",
    "description": "We are seeking a skilled Fullstack Developer with a minimum of 2 years of hands-on experience. The ideal candidate will have proficiency in the following areas:\n\n- **Java** (Spring Boot & Android)\n- **JavaScript/TypeScript** (React JS)\n- **Unit Testing**\n- **SQL Queries**\n\nJoin our team to leverage your expertise and contribute to exciting projects.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537013/hacktiv8/career/fullstack-developer-ppdbz36jt2q.png",
    "jobType": "Contract",
    "companyId": 11,
    "authorId": 5,
    "createdAt": "2024-08-13T08:16:54.257Z",
    "updatedAt": "2024-08-13T08:16:54.257Z"
  },
  {
    "title": "Internship Front End Programmer",
    "description": "**Kami mencari kandidat terbaik untuk mengisi posisi yang dibutuhkan oleh tim dengan tanggung jawab:**  \n- Membantu membuat dan mengembangkan aplikasi web yang dibutuhkan perusahaan.  \n  \n**Kualifikasi:**  \n- Freshgraduate dipersilakan melamar.  \n- Terbiasa dalam menggunakan framework **Vue JS ver.3** atau **React JS**.  \n- Memahami manipulasi DOM ke browser API dan mengintegrasikan API ke Backend.  \n- Memahami **Typescript**, **CSS & SCSS**, **Bootstrap**, dan **Git**.  \n- Lokasi Magang di area perkantoran Kelapa Gading, Jakarta Utara.  \n- Waktu magang minimal 6 bulan.  \n  \n**Benefit:**  \n- Terlibat langsung dalam proyek nyata.  \n- Tambahan skill dan pengalaman.  \n- Surat Keterangan Internship.  \n- Peluang menjadi karyawan.  \n- Uang Saku.  \n  \nApabila Anda adalah pribadi yang kami butuhkan, silahkan apply lamaran untuk mengikuti tahap tes onlinenya segera.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537014/hacktiv8/career/internship-front-end-programmer-z6ew7lno9n.png",
    "jobType": "Internship",
    "companyId": 14,
    "authorId": 10,
    "createdAt": "2024-08-13T08:16:55.231Z",
    "updatedAt": "2024-08-13T08:16:55.231Z"
  },
  {
    "title": "Golang Developer",
    "description": "**Job Title: Software Engineer**  \n\n**Qualifications:**  \n- Associate's degree in Computer Science, Information Technology, or a related field.  \n- Proven experience as a Software Engineer or in a similar role.  \n- Strong proficiency in Go programming language with at least 2 years of experience.  \n- Extensive experience with Linux operating systems.  \n- Expertise in designing and implementing Web Services APIs.  \n- Solid understanding and practical experience with Agile methodologies.  \n- In-depth knowledge of the Software Development Life Cycle (SDLC).  \n- Excellent problem-solving skills and attention to detail.  \n- Strong communication and collaboration skills.  \n\n**Preferred Qualifications:**  \n- Experience with cloud platforms such as AWS, Azure, or Google Cloud.  \n- Knowledge of containerization technologies such as Docker and Kubernetes.  \n- Familiarity with CI/CD pipelines and tools.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537015/hacktiv8/career/golang-developer-0k9vhq9qt589.png",
    "jobType": "Contract",
    "companyId": 40,
    "authorId": 2,
    "createdAt": "2024-08-13T08:16:55.911Z",
    "updatedAt": "2024-08-13T08:16:55.911Z"
  },
  {
    "title": "Presales Security",
    "description": "PT Global Infotech Solution is currently seeking a Presales Security professional with experience in managing Fortinet and Palo Alto products. \n\n**Job Description:**  \n- Collaborate with the sales team as a technical expert.  \n- Determine technical solutions that meet client requirements.  \n- Act as a liaison between the sales and engineering teams.  \n- Present solutions and conduct assessments.  \n- Collect customer requirements and identify potential issues with products or services.  \n- Prepare technical proposals.  \n- Create detailed project plans, including timeline, estimated expenses, project specifications (such as materials needed and engineering requirements).  \n- Availability to work after office hours.\n\n**Requirements:**  \n- Bachelor’s Degree in Computer Science, Information Technology, Telecommunications, or Electrical Engineering.  \n- Minimum of 2 years of experience in product management or presales.  \n- Experience in designing and handling installation and security solutions.  \n- Strong communication skills and a solid understanding of technical concepts.  \n- Passion for learning new technologies.\n\n**Benefits:**  \n- Fun and youthful working environment.  \n- Laptop provided.  \n- BPJS and insurance coverage.\n\nOnly candidates who meet the qualifications will be considered. The application deadline is June 2024. \n\nLet's apply now!",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537016/hacktiv8/career/presales-security-8k7fnzo6c9i.png",
    "jobType": "Full-Time",
    "companyId": 3,
    "authorId": 2,
    "createdAt": "2024-08-13T08:16:56.725Z",
    "updatedAt": "2024-08-13T08:16:56.725Z"
  },
  {
    "title": "Cloud Engineer Manager",
    "description": "### Job Title: Cloud Services Manager\n\n**Key Responsibilities:**  \n- Oversee the management of private cloud and open-source technology services.  \n- Ensure projects are delivered on time and within budget.  \n- Manage client relationships and ensure customer satisfaction.  \n- Lead and manage a team of cloud engineers and support staff.  \n- Develop and manage comprehensive project plans.\n\n**Qualifications:**  \n- Bachelor's degree in Computer Science, Information Technology, or a related field.  \n- Minimum of 3 years of experience in cloud computing or IT service management.  \n- Proven experience in managing private cloud and open-source technology projects.  \n- Strong understanding of cloud platforms (e.g., OpenStack, AWS, Azure, Google Cloud) and open-source technologies.  \n- Excellent leadership and team management skills.  \n- Strong project management skills.  \n- Exceptional communication and interpersonal skills.  \n- Understanding of cybersecurity best practices in cloud environments.  \n- Relevant certifications (e.g., ITIL, PMP) are a plus.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537016/hacktiv8/career/cloud-engineer-manager-m2ehxg7o6h.png",
    "jobType": "Contract",
    "companyId": 39,
    "authorId": 3,
    "createdAt": "2024-08-13T08:16:57.397Z",
    "updatedAt": "2024-08-13T08:16:57.397Z"
  },
  {
    "title": "Programmer (Web/Mobile)",
    "description": "### **Job Description:**\n- Engage in the full development life cycle, including coding, testing, troubleshooting system issues, and implementation.\n- Collaborate closely with team members to meet project targets.\n- Document processes and provide periodic reports as required by various organizational stakeholders.\n\n### **Requirements:** \n- Bachelor’s Degree in Computer Science, Information Systems, Information Technology, or a related field.\n- At least 2 years of professional experience in programming.\n- Strong logical reasoning and analytical skills in programming.\n- Proficient in web programming languages and technologies: HTML, CSS, PHP, Java, JavaScript, and Golang.\n- Experience in mobile programming for Android (Kotlin/Java) or iOS (Objective-C/Swift).\n- Skilled in database management and reporting tools: PL/SQL and SQL Server.\n- Ability to work effectively under pressure.\n- Demonstrate a positive attitude, initiative, and diligence.\n- Quick learner with a willingness to acquire new skills.\n- Experience in multi-finance and banking sectors is a plus.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537017/hacktiv8/career/programmer-%28webmobile%29-1noze25xpdf.jpg",
    "jobType": "Contract",
    "companyId": 41,
    "authorId": 10,
    "createdAt": "2024-08-13T08:16:58.164Z",
    "updatedAt": "2024-08-13T08:16:58.164Z"
  },
  {
    "title": "Software Lead Engineer",
    "description": "**Posisi:** Pengembang Aplikasi Web Senior  \n\n**Persyaratan:**  \n- Lulusan Sarjana Ilmu Komputer/IT  \n- Memiliki pengalaman minimal 5 tahun dalam pengembangan aplikasi web  \n- Mampu menulis dokumentasi teknis seperti use case, flow chart, swim lane, sequence diagram, component diagram, dan lain-lain.  \n- Memiliki pengetahuan dan pengalaman dalam pengembangan Teknologi Web (Backend & Frontend), terutama dalam kerangka kerja terkait Java & Javascript (misalnya Visual Studio, Angular, React, Node.js)  \n- Memahami progressive web apps, layanan web, dan pengembangan API  \n- Berpengalaman dengan database NoSQL, seperti MariaDB, HBase, Cassandra, MongoDB, atau sejenisnya  \n- Berpengalaman menggunakan Git dan Gitflow  \n\n**Tugas dan Tanggung Jawab:**  \n- Memberikan arahan fungsional dan bimbingan teknis kepada tim Development  \n- Melakukan analisis terhadap masalah bisnis maupun teknis dan memberikan solusi  \n- Menyusun laporan lisan dan tertulis kepada CEO/CTO secara berkala  \n- Membantu merancang program dan memimpin desain perencanaan serta tata kelola pelaksanaan proyek dalam bentuk apapun  \n- Menerapkan proses ETL (Extract, Transform, Load)  \n- Merekayasa pengembangan perangkat lunak dan Big Data secara efisien",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537018/hacktiv8/career/software-lead-engineer-qk15oz2fr.png",
    "jobType": "Contract",
    "companyId": 42,
    "authorId": 9,
    "createdAt": "2024-08-13T08:16:58.799Z",
    "updatedAt": "2024-08-13T08:16:58.799Z"
  },
  {
    "title": "Senior Data Engineer",
    "description": "### Deskripsi Pekerjaan:\n\n- Mengembangkan dan memelihara alur data serta proses ETL.\n- Bekerjasama dengan tim Business Analyst untuk memahami kebutuhan data dan merancang solusi data yang dapat diskalakan untuk mendukung kebutuhan bisnis.\n- Menerapkan pemeriksaan kualitas data dan proses pemantauan untuk memastikan akurasi, integritas, dan konsistensi data.\n- Mengoptimalkan kinerja basis data dan efisiensi query untuk meningkatkan kinerja sistem secara keseluruhan.\n- Melakukan riset tentang teknologi data terbaru untuk kepentingan bisnis.\n\n### Kualifikasi:\n\n- Lulusan sarjana di bidang teknologi informasi atau ilmu komputer.\n- Pengalaman kerja minimal 5 tahun sebagai data engineer.\n- Pengalaman kerja di industri keuangan lebih diutamakan.\n- Memiliki pengalaman dalam menggunakan SQL dan Python.\n- Menguasai konsep serta alat ETL & ELT.\n- Memahami proses pelaporan regulasi perbankan Indonesia.\n- Mampu memimpin tim, analisis, pemecahan masalah, dan pemikiran konseptual.\n- Memiliki keterampilan komunikasi dan kolaborasi yang baik.\n- Mampu bekerja secara efektif dalam lingkungan yang dinamis dan mengelola proyek dengan baik.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537019/hacktiv8/career/senior-data-engineer-qhac205t37.jpg",
    "jobType": "Full-Time",
    "companyId": 18,
    "authorId": 5,
    "createdAt": "2024-08-13T08:16:59.723Z",
    "updatedAt": "2024-08-13T08:16:59.723Z"
  },
  {
    "title": "Front End Developer Internship",
    "description": "**Kami mencari kandidat terbaik untuk mengisi posisi yang dibutuhkan oleh tim dengan tanggung jawab:**\n\n- Membantu membuat dan mengembangkan aplikasi web yang dibutuhkan perusahaan.\n\n**Kualifikasi:**\n\n- Terbiasa menggunakan framework Vue JS versi 3 atau React JS.\n- Memahami manipulasi DOM, browser API, dan mengintegrasikan API ke Backend.\n- Memahami Typescript, CSS & SCSS, Bootstrap, dan Git.\n- Freshgraduate dipersilakan melamar.\n- Lokasi Magang di area perkantoran Kelapa Gading, Jakarta Utara.\n- Waktu magang minimal 6 bulan.\n\n**Benefit:**\n\n- Terlibat langsung dalam proyek nyata.\n- Tambahan skill dan pengalaman.\n- Surat Keterangan Internship.\n- Peluang menjadi karyawan.\n- Uang Saku.\n\n**Apabila Anda adalah pribadi yang kami butuhkan, silahkan apply lamaran untuk mengikuti tahap tes onlinenya segera.**",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537020/hacktiv8/career/front-end-developer-internship-m81ndg6pfwk.png",
    "jobType": "Internship",
    "companyId": 14,
    "authorId": 8,
    "createdAt": "2024-08-13T08:17:01.219Z",
    "updatedAt": "2024-08-13T08:17:01.219Z"
  },
  {
    "title": "Senior DevOps Engineer",
    "description": "### Job Title: Infrastructure Engineer\n\n#### **Qualifications:**\n- Bachelor's degree or above in Computer Science, Engineering, or related fields.\n- Minimum of 2 years' experience managing production infrastructure with orchestration systems (e.g., Docker, Kubernetes).\n- At least 2 years' experience using Helm Charts.\n- Familiarity with Linux and *nix systems, along with a proven track record in managing cloud infrastructure (e.g., Alibaba Cloud, AWS).\n- Experience in handling service mesh challenges, including but not limited to load balancing, service discovery, and failure recovery.\n- Knowledge of Nginx (Ingress and Reverse Proxy).\n- Solid understanding of CI/CD pipelines and tools such as GitLab CI, Jenkins, or Travis CI.\n- Familiarity with monitoring and logging tools like the ELK stack.\n\n#### **Responsibilities:**\n- Deploy updates and fixes while providing Level 3 technical support.\n- Build and maintain highly available systems.\n- Ability to visually present and communicate architectural designs.\n- Collaborate with teams to evaluate and identify optimal infrastructure solutions.\n- Ensure efficient functioning of data storage and processing while adhering to company security policies and best practices in cloud security.\n\n#### **Working Conditions:**\n**On-site (Work from Office)**",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537024/hacktiv8/career/senior-devops-engineer-apbde12k3c.jpg",
    "jobType": "Full-Time",
    "companyId": 43,
    "authorId": 10,
    "createdAt": "2024-08-13T08:17:05.242Z",
    "updatedAt": "2024-08-13T08:17:05.242Z"
  },
  {
    "title": "Teknisi Supervisor",
    "description": "### Tugas dan Tanggung Jawab:\n- Bertanggung jawab dalam pembuatan laporan Technical KPI untuk cabang.\n- Mengelola laporan hasil pekerjaan dan menyampaikannya kepada atasan serta Principle.\n- Menjalin komunikasi yang efektif dengan cabang, ASP, dan Principle.\n- Memberikan pelatihan teknis kepada tim teknisi.\n\n### Kualifikasi:\n- Pria, usia maksimal 30 tahun.\n- Pendidikan minimal S1 Teknik Elektro.\n- Memiliki pengalaman sebagai teknisi komputer, notebook, dan perangkat elektronik lainnya.\n- Memiliki pengalaman minimal 2 tahun sebagai leader/supervisor teknisi.\n- Memiliki pengalaman dalam memimpin tim.\n- Mampu berkomunikasi dengan baik, baik secara lisan maupun tulisan.\n- Terbiasa bekerja dengan KPI serta melakukan administrasi laporan.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537025/hacktiv8/career/teknisi-supervisor-kz14tljg88.png",
    "jobType": "Full-Time",
    "companyId": 44,
    "authorId": 4,
    "createdAt": "2024-08-13T08:17:05.875Z",
    "updatedAt": "2024-08-13T08:17:05.875Z"
  },
  {
    "title": "Senior Cyber Security Analyst",
    "description": "### Kualifikasi:\n1. Pendidikan minimal D3/setara atau jika tidak D3/setara minimal memiliki Sertifikasi ECIH/CHFI.\n2. Memiliki minimal sertifikasi tentang Security Operator, Pentest Tester, dan/atau Vulnerability Assessment Analyst (misal. CEH, CIHE, dan sejenisnya).\n3. Memiliki pengalaman dalam bidang Incident Response atau bidang Keamanan Siber minimal 2 tahun.\n\n### Deskripsi:\n1. Membuat perencanaan program penanganan insiden, eskalasi insiden, dan perbaikan berdasarkan masukan dari IT Operation & Monitoring (L1).\n2. Mengidentifikasi serangan-serangan terhadap kontrol akses.\n3. Mendeteksi kerentanan (vulnerability) keamanan dan potensi pelanggaran.\n4. Melakukan analisa tren postur keamanan siber dan memberikan laporan advisory kepada internal dan klien.\n5. Melakukan koordinasi penanganan insiden dan manajemen krisis baik kepada pihak internal, khususnya IT Operation & Monitoring (L1), Cyber Security Section Head, MSS Operation Dept. Head, maupun untuk eksternal Perusahaan/klien.\n6. Melakukan eskalasi insiden atau issue sesuai dengan tingkat prioritas penanganan yaitu Cyber Security Section Head, MSS Operation Dept. Head, dan fungsi terkait untuk berkoordinasi dengan klien.\n7. Memberikan arahan mengenai solusi masalah keamanan siber yang teridentifikasi kepada IT Operation & Monitoring (L1).\n8. Menyusun laporan insiden rinci dan ringkasan teknis serta mempresentasikan atau mengkomunikasikan kepada Manajemen, Administrator, dan End-user/klien serta entitas analisis ancaman siber lainnya.\n9. Membuat use case dan mengintegrasikannya ke dalam SIEM dengan berkolaborasi bersama Infrastructure Engineer.\n10. Bertanggung jawab atas operasional di klien dan menghadiri meeting rutin.\n11. Membuat closing report atas insiden yang telah selesai dan berkoordinasi dengan klien.\n12. Menjaga SLA, kualitas layanan, dan kepuasan klien dengan cara menjaga komunikasi dengan L1, PMO, klien, dan pihak lain yang berkepentingan.\n13. Melaksanakan program dan mengelola bahan/media peningkatan kepedulian dan pelatihan terkait keamanan siber.\n14. Melakukan analisis IT Security Risk Assessment terhadap produk dan jasa dalam kaitannya dengan kepatuhan terhadap regulasi keamanan siber.\n15. Membuat laporan (update) berkala terkait kebutuhan dan perkembangan pada sisi klien untuk disampaikan kepada pihak yang berkepentingan di Internal.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537026/hacktiv8/career/senior-cyber-security-analyst-2ufm3976ra.jpg",
    "jobType": "Full-Time",
    "companyId": 45,
    "authorId": 1,
    "createdAt": "2024-08-13T08:17:06.586Z",
    "updatedAt": "2024-08-13T08:17:06.586Z"
  },
  {
    "title": "Java Springboot Developer - Banking industry",
    "description": "We are seeking a skilled Java Developer with a strong background in developing middle to high complexity Java-based web applications. The ideal candidate will have the following qualifications and experience:\n\n- Minimum of 3 years of experience working on complex Java-based web application projects.\n- Proven experience within the financial industry utilizing AWS technologies is essential.\n- A Bachelor's degree in Information Technology or a related field.\n- Must be willing to work from the office in Bintaro.\n- Proficiency in Java, SQL, HTML5, CSS3, and JavaScript/TypeScript is required.\n- In-depth knowledge and experience in relational database design, including writing optimized queries and database administration.\n- Familiarity with the Linux operating system is a plus.\n- Experience with source code version control systems such as Git is necessary.\n\nJoin our team and contribute to innovative projects in a dynamic environment!",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537026/hacktiv8/career/java-springboot-developer-banking-industry-8f8kn50wo0u.png",
    "jobType": "Contract",
    "companyId": 11,
    "authorId": 2,
    "createdAt": "2024-08-13T08:17:07.349Z",
    "updatedAt": "2024-08-13T08:17:07.349Z"
  },
  {
    "title": "Mobile Developer",
    "description": "### Job Description:\n\n**Responsibilities:**\n1. Demonstrate strong analytical and problem-solving skills.\n2. Exhibit a strong sense of responsibility.\n3. Ability to learn quickly and adapt in a dynamic work environment.\n\n**Classification:**\n1. Minimum Bachelor’s Degree required.\n2. At least 1 year of relevant work experience (more than 1 year is preferred).\n3. Proficiency in the following programming languages:\n   - Flutter\n   - Kotlin / Java\n   - Swift\n   - React Native",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537027/hacktiv8/career/mobile-developer-xcz8fmlhcd.png",
    "jobType": "Full-Time",
    "companyId": 28,
    "authorId": 10,
    "createdAt": "2024-08-13T08:17:08.155Z",
    "updatedAt": "2024-08-13T08:17:08.155Z"
  },
  {
    "title": "Technical Consultant",
    "description": "**Minimum Qualifications and Experience**\n\n1. Minimum of 1 year of working experience in Java/Python programming; fresh graduates are encouraged to apply.\n2. Familiarity with Java Programming Language and Java-based frameworks such as JSF, Spring Boot, and JAX-RS.\n3. Strong knowledge of relational and non-relational databases, including MySQL and Solr.\n4. Experience with Git for source code control is required.\n5. A good understanding of RESTful API and WebSocket technology is a plus.\n6. Quick learner with a strong desire to explore new technologies.\n7. Excellent interpersonal skills and a positive work attitude.\n\n**Job Description**\n\n1. Collaborate with the Project Manager to define the scope of work and the project schedule.\n2. Design, build, and maintain efficient, reusable, and reliable code.\n3. Ensure the highest application performance, quality, and responsiveness.\n4. Identify bottlenecks and bugs, and develop effective solutions to address them.\n5. Assist in maintaining code quality, organization, and automation.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537028/hacktiv8/career/technical-consultant-57uekgdt6is.jpg",
    "jobType": "Full-Time",
    "companyId": 46,
    "authorId": 3,
    "createdAt": "2024-08-13T08:17:08.938Z",
    "updatedAt": "2024-08-13T08:17:08.938Z"
  },
  {
    "title": "Web Developer (Java Springboot)",
    "description": "Kami mencari seorang Pengembang All Stack yang berpengalaman dalam mengembangkan aplikasi web menggunakan **Java Springboot**, **NodeJS**, **PostgreSQL**, dan **GCP Platform**. Kandidat ideal harus memahami konsep **clean & efficient code** serta **secure code programming**. Selain itu, Anda harus memiliki kemampuan dalam membuat unit testing, serta memiliki kemampuan analisa dan logika yang baik. Kemampuan untuk bekerja dalam tim sangat dihargai. Pengalaman menggunakan **CI/CD Tools** juga menjadi nilai tambah.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537029/hacktiv8/career/web-developer-%28java-springboot%29-tlbnfmxrho8.png",
    "jobType": "Full-Time",
    "companyId": 11,
    "authorId": 1,
    "createdAt": "2024-08-13T08:17:09.765Z",
    "updatedAt": "2024-08-13T08:17:09.765Z"
  },
  {
    "title": "Account Manager",
    "description": "**Job Title:** Account Manager\n\n**Minimum Qualifications and Experience:**\n1. Possess at least a Diploma/Bachelor's Degree in Computer Science or IT field.\n2. A minimum of 2+ years of experience as an Account Manager.\n3. Excellent communication skills.\n4. Target-oriented and able to work under deadlines.\n5. Knowledge of 3Dolphins products, including Chatbot, Omni Channel, and WhatsApp Broadcast.\n6. Ability to set targets and sales strategies to deliver high-quality services to clients.\n7. Build strong relationships with all current and prospective clients.\n8. Follow up and monitor clients' needs to ensure fulfillment.\n\n**Job Description:**\n1. Serve as the primary point of contact and foster long-term relationships with customers.\n2. Assist customers through various communication channels, including email, phone, online presentations, screen-sharing, and in-person meetings.\n3. Develop trusted advisor relationships with key accounts, customer stakeholders, and executive sponsors.\n4. Ensure timely and successful delivery of solutions according to customer needs and objectives.\n5. Maintain client satisfaction and provide exceptional service on a daily basis.\n6. Monitor and analyze client usage of our products.\n7. Collaborate with the Sales team to onboard and integrate new clients, while nurturing existing relationships.\n8. Communicate with clients to understand their needs and articulate the value of our products.\n9. Build relationships with clients based on trust and respect. \n10. Collaborate with internal departments to facilitate the fulfillment of client needs.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537030/hacktiv8/career/account-manager-ugk5pkivhy.jpg",
    "jobType": "Full-Time",
    "companyId": 46,
    "authorId": 2,
    "createdAt": "2024-08-13T08:17:10.578Z",
    "updatedAt": "2024-08-13T08:17:10.578Z"
  },
  {
    "title": "Junior DevOps Engineer",
    "description": "**Job Title: [Position Title]**  \n  \n**Requirements:**  \n1. Minimum bachelor's degree in Computer Science or Information Technology.  \n2. At least 1 year of experience in a related field.  \n3. Proficient in programming and scripting languages.  \n  \n**Required Technical Specifications:**  \n- Minimum 1 year of experience with Docker Compose.  \n- Proficient in scripting using Python and Bash.  \n- Strong troubleshooting skills.  \n- At least 1 year of experience using Linux.  \n- Competent in utilizing Postman for API interactions.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537030/hacktiv8/career/junior-devops-engineer-wp34yieteym.jpg",
    "jobType": "Full-Time",
    "companyId": 47,
    "authorId": 8,
    "createdAt": "2024-08-13T08:17:11.302Z",
    "updatedAt": "2024-08-13T08:17:11.302Z"
  },
  {
    "title": "Backup & Linux Engineer",
    "description": "### Job Description\n\n#### Job Requirements:\n- Pendidikan minimal S1.\n- Mampu bekerja sama dengan baik dalam tim.\n- Memiliki pengalaman minimal 3 tahun sebagai Backup Software Engineer atau Linux Engineer.\n- Memiliki sertifikat produk IT Infrastructure merupakan nilai tambah.\n- Memahami Server, Storage, Linux, VMware, Networking, dan Database.\n- Mampu berbahasa Inggris.\n\n#### Job Descriptions:\n- Melakukan instalasi produk software Backup (Data Protection), Linux, dan Backup Storage.\n- Melakukan troubleshooting dan menyelesaikan permasalahan yang timbul.\n- Melakukan perbaikan berkelanjutan terhadap keterampilan yang diperlukan perusahaan.\n- Bersedia untuk mengikuti program Development dengan ikatan dinas kerja.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537031/hacktiv8/career/backup-and-linux-engineer-25qqvzj9983.png",
    "jobType": "Full-Time",
    "companyId": 48,
    "authorId": 5,
    "createdAt": "2024-08-13T08:17:12.111Z",
    "updatedAt": "2024-08-13T08:17:12.111Z"
  },
  {
    "title": ".Net Developer",
    "description": "### Tanggung Jawab:\n- Membangun aplikasi berbasis .NET dengan menggunakan Bahasa C# / ASP.NET\n- Melakukan monitoring dan kontrol berkala terhadap modul-modul yang sedang dikerjakan.\n- Menyesuaikan aplikasi dengan kebutuhan pengguna.\n- Berkoordinasi dengan tim IT QA terkait defect yang terdapat pada aplikasi.\n\n### Persyaratan:\n- Minimal 3 tahun pengalaman (pengalaman di bawah 3 tahun dapat dipertimbangkan).\n- Pendidikan minimal D3 jurusan Teknik Informatika / Sistem Informasi / Ilmu Komputer.\n- Menguasai bahasa pemrograman .NET atau .NET Core.\n- Memiliki kemampuan analisis, logika, dan troubleshooting sebuah sistem.\n- Terbiasa menggunakan sistem versioning seperti GitHub, Bitbucket, SVN, dll.\n- Memiliki pengalaman dalam pengembangan aplikasi web dan rich client application.\n- Memiliki kepribadian yang baik serta mampu bekerja sama dalam tim.\n- Memahami Bahasa pemrograman C# dengan teknologi ASP.NET / .NET Core.\n- Mampu menggunakan SQL Server.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537032/hacktiv8/career/.net-developer-8f5rwrp0c4j.jpg",
    "jobType": "Contract",
    "companyId": 49,
    "authorId": 10,
    "createdAt": "2024-08-13T08:17:12.931Z",
    "updatedAt": "2024-08-13T08:17:12.931Z"
  },
  {
    "title": "TEKNISI (MESIN KOPI)",
    "description": "**Deskripsi Pekerjaan:**\n- Merawat mesin serta memeriksa dan memperbaiki mesin apabila terjadi kerusakan.\n- Melakukan pengaturan dan instalasi mesin kopi.\n- Mengatasi troubleshooting mesin, menganalisa dan memberikan estimasi perbaikan mesin.\n- Melakukan perawatan kunjungan ke outlet bila diperlukan.\n\n**Kualifikasi:**\n- Pendidikan minimal SMK jurusan Teknik Mesin, Teknik Elektromekanikal, atau sejenisnya.\n- Menguasai berbagai jenis mesin kopi (Mesin kopi otomatis, mesin kopi semi otomatis, dan grinder).\n- Memiliki pengalaman minimal 2 tahun dalam perawatan dan perbaikan mesin kopi.\n- Memahami mesin dan mampu membaca wiring.\n- Mampu melakukan pekerjaan overhaul mesin.\n- Paham jalur dan instalasi listrik, terutama listrik dengan beban daya 3 fase.\n- Jujur, aktif, komunikatif, memiliki inisiatif, dan mampu bekerja sama dalam tim.\n- Memiliki kendaraan bermotor dan SIM C yang masih berlaku.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537053/hacktiv8/career/teknisi-%28mesin-kopi%29-lm0jq19fhpf.jpg",
    "jobType": "Full-Time",
    "companyId": 50,
    "authorId": 1,
    "createdAt": "2024-08-13T08:17:33.676Z",
    "updatedAt": "2024-08-13T08:17:33.676Z"
  },
  {
    "title": "Java Senior Programmer",
    "description": "### Job Title: Backend Developer\n\n#### Responsibilities:\n- Implement and maintain server-side applications using **Java**.\n- Work with **Google Cloud Platform** to deploy and manage applications.\n- Develop strong backend solutions using **Spring Boot** and proficiently design APIs.\n- Utilize **PostgreSQL** for database management and queries.\n- Apply Object-Oriented Programming (**OOP**) principles in software development.\n- Leverage **Spring Boot** along with **ORM Hibernate** in combination with **PostgreSQL** and **Vue.js Composition API**.\n- Create user-friendly interfaces that enhance user experience.\n\n#### Qualifications:\n- Minimum of **3 years** experience in backend development.\n- Familiarity with **Work From Office** arrangements in **Jakarta**.\n- Competitive salary range of **IDR 9 to 10 Million per Month**.\n\nJoin us to contribute to innovative solutions and grow in a dynamic environment!",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537053/hacktiv8/career/java-senior-programmer-sk8n8jxlsle.jpg",
    "jobType": "Full-Time",
    "companyId": 51,
    "authorId": 8,
    "createdAt": "2024-08-13T08:17:34.438Z",
    "updatedAt": "2024-08-13T08:17:34.438Z"
  },
  {
    "title": "Cybersecurity Engineer",
    "description": "### Job Description: Digital Identification System Manager\n\n**Kualifikasi:**\n1. Gelar sarjana minimal S1/D4 yang setara dalam Ilmu Komputer, Teknologi Informasi, Keamanan Komputer, Strategi Intelijen, atau Sistem Informasi (dibuktikan dengan ijazah).\n\n2. Minimal 8 tahun pengalaman dalam penyusunan kebijakan, pengembangan, atau pengelolaan sistem identifikasi digital, termasuk Public Key Infrastructure (PKI), autentikasi, manajemen kunci, atau pengelolaan identitas (dibuktikan dengan dokumen pendukung, seperti surat pernyataan pengalaman kerja atau kontrak kerja).\n\n3. Memiliki pengetahuan dan pengalaman yang baik dalam penyusunan kebijakan mengenai regulasi perlindungan data pribadi, keamanan data, dan privasi, seperti General Data Protection Regulation (GDPR), Health Insurance Portability and Accountability Act (HIPAA), California Consumer Privacy Act (CCPA), atau produk kebijakan lain yang relevan dengan sistem identifikasi digital (dibuktikan dengan dokumen pendukung sebagai nilai tambah).\n\n4. Diutamakan memiliki sertifikasi tambahan, seperti Certified Information Systems Security Professional (CISSP), Certified Ethical Hacker (CEH), Certified Information Security Manager (CISM), Certified Information Systems Auditor (CISA), CompTIA Security+, atau GIAC Security Essentials (GSEC).",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537054/hacktiv8/career/cybersecurity-engineer-nlvu3avj7x.png",
    "jobType": "Full-Time",
    "companyId": 11,
    "authorId": 3,
    "createdAt": "2024-08-13T08:17:35.154Z",
    "updatedAt": "2024-08-13T08:17:35.154Z"
  },
  {
    "title": "Java Developer ",
    "description": "### Job Title: Java Developer\n\n#### Qualifications:\n\n- **Minimum Experience:** At least 1 year of experience with Java 8 and above.\n- **Frameworks & Technologies:** Familiarity with Spring, Hibernate/ORM.\n- **Messaging Concepts:** Knowledge of messaging frameworks such as Kafka or similar applications.\n- **Java Proficiency:** Understanding of Java OOP principles, MVC architecture, and various implementation patterns.\n- **JavaScript Development:** Familiarity with JavaScript and its applications.\n- **Log Management Tools:** Understanding of Elastic-Logstash-Kibana stack and its functionalities.\n- **Spring Boot & Hibernate:** Practical experience using Spring Boot and Hibernate.\n- **Coding Standards:** Passionate about writing clean, maintainable code with excellent readability.\n- **Communication Skills:** Strong communication abilities to collaborate effectively with team members.\n- **Team Collaboration:** Excellent team player with the capability to work independently.\n- **Industry Knowledge:** Familiarity with the financial industry is an advantage.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537055/hacktiv8/career/java-developer-s2oegxknea.png",
    "jobType": "Full-Time",
    "companyId": 52,
    "authorId": 4,
    "createdAt": "2024-08-13T08:17:35.869Z",
    "updatedAt": "2024-08-13T08:17:35.869Z"
  },
  {
    "title": "Senior Backend Developer",
    "description": "### Kualifikasi:\n- Minimal pendidikan D3 atau S1 Jurusan Informatika Komputer\n- Pengalaman minimal 3 tahun di bidang yang sama\n- Menguasai bahasa pemrograman PHP\n- Kemampuan dalam pemrograman Front-end (HTML, CSS, Javascript, mobile Android dan IOS) menjadi nilai tambah\n- Menguasai Laravel Framework\n- Paham SQL atau MySQL\n- Memahami konsep API dan keamanan (Oauth)\n- Menguasai konsep OOP (Object Oriented Programming)\n- Mampu bekerja sama dalam tim maupun secara individu\n- Mampu menyelesaikan pekerjaan sesuai deadline\n- Berkomitmen untuk belajar dan berkembang\n- Mampu bekerja di bawah tekanan\n- Fleksibel, dinamis, kreatif, dan mudah beradaptasi\n\n### Tugas dan Tanggung Jawab:\n- Mengembangkan perangkat lunak dengan desain dan arsitektur yang berkualitas tinggi\n- Mengidentifikasi, memprioritaskan, dan menjalankan tugas dalam siklus hidup pengembangan perangkat lunak\n- Mengembangkan alat dan aplikasi dengan menghasilkan kode yang bersih dan efisien\n- Mengotomatiskan tugas dengan alat dan skrip yang sesuai\n- Melakukan review dan debugging kode\n- Melaksanakan pengujian validasi dan verifikasi\n- Berkolaborasi dengan tim internal dan vendor untuk memperbaiki dan mengembangkan produk\n- Mendokumentasikan fase pengembangan dan memantau sistem\n- Memastikan perangkat lunak yang digunakan mutakhir dengan teknologi terbaru.\n\n### Benefit:\n- PPh 21 ditanggung oleh perusahaan\n- BPJS Kesehatan dan Ketenagakerjaan\n- Pengangkatan karyawan tetap jika memenuhi kriteria dengan masa probation 6 bulan\n- Asuransi Kesehatan untuk Karyawan Tetap\n- Hari Kerja: Senin – Jumat\n\n### Lokasi:\n- Meruya (Jakarta Barat) - WFO",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537056/hacktiv8/career/senior-backend-developer-csey1pwkt44.jpg",
    "jobType": "Full-Time",
    "companyId": 53,
    "authorId": 4,
    "createdAt": "2024-08-13T08:17:36.675Z",
    "updatedAt": "2024-08-13T08:17:36.675Z"
  },
  {
    "title": "FULL STACK DEVELOPMENT",
    "description": "**Job Description:**\n\nWe are seeking a skilled and enthusiastic Full Stack Developer to become a vital part of our expanding team. In this role, you will oversee the complete development lifecycle of our web applications, from front-end design and user experience to back-end development and database management. You will closely collaborate with designers, product managers, and other developers to create robust and scalable software solutions.\n\n**Job Responsibilities:**\n\n• Design, develop, and maintain user interfaces and front-end components.\n• Create and implement back-end logic using server-side programming languages and frameworks.\n• Design and manage databases for efficient data storage and retrieval.\n• Develop and maintain secure, well-documented APIs.\n• Engage in all stages of the software development lifecycle, including requirements gathering, design, development, testing, and deployment.\n• Collaborate with designers, product managers, and other developers to ensure seamless project execution.\n• Write clean, maintainable, and well-documented code.\n• Stay informed about the latest technologies and trends in web development.\n\n**Job Requirements:**\n\n• Bachelor’s degree in Computer Science, Information Technology, or a related field (or equivalent experience).\n• Over 3 years of experience as a Full Stack Developer or in a similar role.\n• Strong proficiency in front-end technologies, including HTML, CSS, JavaScript, and a front-end framework (e.g., React, Angular, Vue.js).\n• Solid expertise in back-end technologies such as a server-side programming language (e.g., Java, Python, Node.js) and a database management system (e.g., MySQL, PostgreSQL).\n• Experience with API development and integration.\n• Proficiency in version control systems (e.g., Git).\n• Excellent problem-solving and analytical skills.\n• Strong communication and collaboration abilities.\n• Ability to work independently as well as part of a team.\n• Passion for continuous learning and keeping up with the latest technologies.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537056/hacktiv8/career/full-stack-development-hmzqrfy70e5.png",
    "jobType": "Full-Time",
    "companyId": 54,
    "authorId": 4,
    "createdAt": "2024-08-13T08:17:37.409Z",
    "updatedAt": "2024-08-13T08:17:37.409Z"
  },
  {
    "title": "Back End Developer Internship",
    "description": "**Kami mencari kandidat terbaik untuk mengisi posisi yang dibutuhkan oleh tim dengan tanggung jawab:**\n\n- Membantu membuat dan mengembangkan aplikasi web yang dibutuhkan perusahaan.\n\n**Kualifikasi:**\n\n- Freshgraduate atau mahasiswa aktif dipersilakan melamar.\n- Memahami pembuatan Restful API dengan menggunakan **Node JS**.\n- Memahami **Database noSQL MongoDB (Mongoose)** dan **Typescript**.\n- Memahami **Git**.\n- Memahami **Nest JS** merupakan nilai lebih.\n- Lokasi Magang di area perkantoran Kelapa Gading, Jakarta Utara.\n- Durasi Magang minimal 6 bulan.\n\n**Benefit:**\n\n- Terlibat langsung dalam projek nyata.\n- Tambahan skill dan pengalaman.\n- Sertifikat Internship.\n- Peluang menjadi karyawan.\n- Uang Saku.\n\n**Apabila Anda adalah pribadi yang kami butuhkan, silahkan apply lamaran untuk mengikuti tahap tes onlinenya segera.**",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537057/hacktiv8/career/back-end-developer-internship-rs0bpuu0kps.png",
    "jobType": "Internship",
    "companyId": 14,
    "authorId": 4,
    "createdAt": "2024-08-13T08:17:38.125Z",
    "updatedAt": "2024-08-13T08:17:38.125Z"
  },
  {
    "title": "Developer",
    "description": "**Kualifikasi :**\n\n- **Pendidikan:** Minimal S1 Ilmu Komputer, Teknik Informatika, atau bidang terkait.\n- **Pengalaman:** Minimal 3 tahun pengalaman dalam pengembangan perangkat lunak, dengan fokus pada pengembangan fullstack. Pengalaman dalam membangun aplikasi web dan mobile dari awal hingga akhir sangat diutamakan.\n- **Pengalaman Khusus untuk posisi Senior Developer:** minimal 4 tahun.\n- **Pengalaman dan Pemahaman Teknologi:**\n  - Mahir dalam bahasa pemrograman frontend (HTML, CSS, JavaScript) dan framework populer (React, Angular, Vue.js).\n  - Mahir dalam bahasa pemrograman backend (Node.js, Python, PHP, atau lainnya) dan framework terkait (Express.js, Django, Laravel).\n- **Pengalaman dengan database:**\n  - Relasional (MySQL, PostgreSQL) dan non-relasional (MongoDB).\n  - Pemahaman dalam bahasa pemrograman Kotlin atau Java, SDK Android, Android Studio.\n- **UI/UX:** Berpengalaman dalam membangun UI/UX yang menarik dan responsif.\n- **REST API dan GraphQL:** Memahami konsep-konsep ini dengan baik.\n- **Metodologi Pengembangan:** Pengalaman dengan metodologi pengembangan Agile (Scrum, Kanban) dan memahami siklus hidup pengembangan perangkat lunak.\n- **Keterampilan Komunikasi:** Mampu berkomunikasi dengan jelas dan efektif, baik secara teknis maupun non-teknis, dengan berbagai pemangku kepentingan.\n- **Keterampilan Kolaborasi:** Mampu bekerja secara efektif dalam tim lintas fungsi.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537058/hacktiv8/career/developer-3w6l1bv2vsx.png",
    "jobType": "Full-Time",
    "companyId": 9,
    "authorId": 9,
    "createdAt": "2024-08-13T08:17:38.838Z",
    "updatedAt": "2024-08-13T08:17:38.838Z"
  },
  {
    "title": "Software Developer Engineer (Fullstack)",
    "description": "**Job Title: Fullstack Engineering Lead**  \n\n**Requirement:**  \n- Minimum of 7+ years of experience in software development, with at least 3 years in a leadership role such as Tech Lead or Engineering Manager.  \n- Proven experience as a Fullstack Engineer focusing on React, Express.js, Docker, and PostgreSQL.  \n- Strong proficiency in JavaScript and modern web development tools and practices.  \n- Experience with RESTful API design and implementation.  \n- Familiarity with containerization and orchestration tools (Docker, Kubernetes).  \n- In-depth understanding of database design and optimization techniques.  \n- Excellent problem-solving and debugging skills.  \n- Ability to work in a collaborative team environment.  \n\n**Nice to Have:**  \n- Knowledge of other front-end frameworks (Angular, Vue.js).  \n- Experience with cloud platforms (AWS, Azure, GCP).  \n- Familiarity with CI/CD pipelines.  \n- Experience with TDD practices and testing frameworks (Jest, Mocha, etc.).  \n\n**Job Description:**  \n- Guide and mentor the development team to ensure adherence to best practices in software development.  \n- Foster a collaborative and innovative team environment.  \n- Define project requirements, manage timelines, and ensure on-time delivery of features and enhancements.  \n- Communicate effectively with stakeholders and align development efforts with business goals.  \n- Design scalable and secure system architectures.  \n- Oversee the entire software development process, including code writing, implementation of CI/CD practices, and ensuring code maintainability.  \n- Conduct code reviews and ensure best practices are followed.  \n- Drive initiatives for continuous improvement within the development team.  \n- Establish quality assurance processes, conduct code reviews, and implement automated testing.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537059/hacktiv8/career/software-developer-engineer-%28fullstack%29-bv0w3omukhc.jpg",
    "jobType": "Full-Time",
    "companyId": 55,
    "authorId": 4,
    "createdAt": "2024-08-13T08:17:39.480Z",
    "updatedAt": "2024-08-13T08:17:39.480Z"
  },
  {
    "title": "Software Engineer (Backend)",
    "description": "### Job Title: Software Engineer (Backend)  \nAs a **Software Engineer (Backend)**, you will be tasked with designing, developing, and maintaining scalable and robust backend systems.  \n\n### Key Responsibilities:  \n- Design, develop, and maintain backend services and APIs using **Node.js** and **Python**.  \n- Implement and manage databases using **SQL** and **NoSQL** technologies.  \n- Develop and maintain containerized applications using **Docker**.  \n- Implement and manage message queues for efficient task processing.  \n- Collaborate with front-end developers and other team members to integrate user-facing elements with server-side logic.  \n- Ensure the performance, quality, and responsiveness of applications.  \n- Troubleshoot and resolve issues in existing backend systems.  \n- Write clean, maintainable, and efficient code.  \n- Participate in code reviews and provide constructive feedback.  \n- Stay updated with emerging technologies and industry trends.  \n\n### Requirements:  \n- Bachelor's degree in **Computer Science**, **Engineering**, or a related field.  \n- Proven experience as a **Backend Developer** or in a similar role.  \n- Strong proficiency in **Node.js** and **Python**.  \n- Experience with **SQL** databases (e.g., **PostgreSQL**, **MySQL**) and **NoSQL** databases (e.g., **MongoDB**, **Redis**).  \n- Experience with containerization and orchestration tools like **Docker**.  \n- Knowledge of message queue systems (e.g., **RabbitMQ**, **Kafka**).  \n- Familiarity with **RESTful APIs** and web services.  \n- Experience with version control systems (e.g., **Git**).  \n- Strong problem-solving skills and attention to detail.  \n- Excellent communication and teamwork skills.  \n\n### Preferred Qualifications:  \n- Experience with **cloud platforms**.  \n- Familiarity with **CI/CD** pipelines and DevOps practices.  \n- Experience with testing frameworks and tools.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537059/hacktiv8/career/software-engineer-%28backend%29-ux3jrhmca69.png",
    "jobType": "Contract",
    "companyId": 56,
    "authorId": 8,
    "createdAt": "2024-08-13T08:17:40.236Z",
    "updatedAt": "2024-08-13T08:17:40.236Z"
  },
  {
    "title": "IT Developer MICROSOFT DYNAMICS",
    "description": "**Developer/Technical Consultant, Microsoft Dynamics**\n\n**Job Requirements:**\n\n1. Bachelor’s degree in Computer Science, Information Technology, or a related field.\n2. Minimum of 1 year of experience as a developer.\n3. Solid understanding of Microsoft Dynamics products, including Dynamics 365, Dynamics CRM, and other related tools. (Microsoft offers extensive documentation and online training resources).\n4. Familiarity with Journal entry, Accounts Payable (AP), Accounts Receivable (AR), and account reconciliation.\n5. Proficient in programming languages such as AX X++, C#, and .NET.\n6. Knowledgeable in SQL Server database operations.\n7. Strong understanding of system integration techniques and tools.\n8. Familiarity with reporting services.\n9. Excellent problem-solving and analytical skills.\n10. Strong communication and interpersonal skills.\n11. Ability to work effectively in a team-oriented environment.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537060/hacktiv8/career/it-developer-microsoft-dynamics-pnemm4d7n6.jpg",
    "jobType": "Contract",
    "companyId": 57,
    "authorId": 3,
    "createdAt": "2024-08-13T08:17:40.990Z",
    "updatedAt": "2024-08-13T08:17:40.990Z"
  },
  {
    "title": "SOC ANALYST 24/7",
    "description": "## Job Title: Cyber Security Analyst\n\n### Kualifikasi:\n1. Pendidikan minimal D3/setara atau jika tidak D3/setara minimal memiliki sertifikasi profesional (misal. CEH, CIHE, Sec+, A+, dan sejenis)  \n2. Memiliki pengalaman kerja minimal 1 tahun  \n3. Prosedural, Bertanggung jawab, Komunikatif, Kolaboratif, dan Pembelajar  \n4. Memiliki pengalaman kerja minimal 1 tahun pada bidang Cyber Security  \n\n### Deskripsi Pekerjaan:\n1. Melakukan monitoring dan analisa 24/7 terhadap aset milik Perusahaan dan end user/klien.  \n2. Melakukan peninjauan dan kategorisasi terhadap insiden keamanan cyber yang terjadi.  \n3. Melakukan Threat Hunting.  \n4. Mengumpulkan data yang diperlukan untuk memenuhi persyaratan pelaporan insiden keamanan.  \n5. Membuat laporan aktivitas operasional dan hasil analisa.  \n6. Membuat tiket berdasarkan tingkat kerentanan dan melaporkan kepada L2 sesuai dengan prosedur terminasi sistem dan tata cara pelaporan insiden.  \n7. Melaksanakan prosedur atau langkah awal penanganan insiden berdasarkan SOP dan/atau Instruksi Kerja yang berlaku.  \n8. Melakukan eskalasi kepada L2 untuk dilakukan improvement yang diperlukan dalam kegiatan monitoring berdasarkan hasil riset di lapangan.  \n9. Mengelola dan menjaga kepuasan pelanggan berdasarkan SLA yang telah ditentukan.  \n10. Mengkomunikasikan dengan baik anggota tim dan klien dalam memberikan pemahaman yang lebih baik terhadap situasi atau insiden yang terjadi.  \n11. Aktif menambah kompetensi tentang Cyber Security.  \n12. Melakukan riset terhadap Trend Industry Cyber Security dan memberikan laporan advisory kepada internal dan klien.  \n13. Membuat laporan (update) berkala terkait kebutuhan dan perkembangan pada sisi klien untuk disampaikan kepada pihak yang berkepentingan di Internal.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537061/hacktiv8/career/soc-analyst-247-y11ee9h6ebc.jpg",
    "jobType": "Full-Time",
    "companyId": 45,
    "authorId": 5,
    "createdAt": "2024-08-13T08:17:41.698Z",
    "updatedAt": "2024-08-13T08:17:41.698Z"
  },
  {
    "title": "Cyber Infrastructure Engineer",
    "description": "# Job Specification (Requirement)\n\n1. **Pendidikan minimal D3/setara**  \n2. **Memiliki minimal sertifikasi bidang Infrastructure & Network Security profesional**  \n3. **Memiliki pengalaman kerja di bidang Network Security & Infrastructure minimal 1 tahun**  \n\n# Job Description\n\n1. **Menerapkan prinsip keamanan informasi untuk penggunaan jaringan internet dan infrastruktur**  \n2. **Melakukan penerapan kontrol keamanan jaringan dan infrastruktur serta keamanan sistem server sesuai dengan kebijakan yang berlaku**  \n3. **Memantau dan memelihara ketersediaan, kinerja, dan keamanan sistem jaringan dan infrastruktur**  \n4. **Mengumpulkan data peralatan jaringan dengan teknologi yang sesuai**  \n5. **Memonitor keamanan dan pengaturan akun pengguna dalam jaringan komputer/hardening, memonitor jaringan, memantau anomali, dan patching**  \n6. **Mengatasi serangan pada jaringan dan anomali/kerusakan pada infrastruktur/perangkat Perusahaan dan klien**  \n7. **Memelihara serta mengoptimalkan kinerja sistem jaringan dan infrastruktur**  \n8. **Mengelola dan membuat laporan rutin atas log milik Perusahaan dan/atau klien**  \n9. **Mengelola, mengintegrasikan dan menerapkan peningkatan konfigurasi sistem, jaringan dan infrastruktur**  \n10. **Melakukan kegiatan PoC (Proof of Concept) maupun penerapan sistem, jaringan dan infrastruktur pada pelaksanaan proyek**",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537061/hacktiv8/career/cyber-infrastructure-engineer-wn6fbuhgicn.jpg",
    "jobType": "Full-Time",
    "companyId": 45,
    "authorId": 3,
    "createdAt": "2024-08-13T08:17:42.284Z",
    "updatedAt": "2024-08-13T08:17:42.284Z"
  },
  {
    "title": "Full Stack",
    "description": "**Job Description:**\n\n• Contribute to the review and analysis of business requirements.\n\n• Collaborate on architecture and technical design discussions.\n\n• Document and review detailed design specifications.\n\n• Implement web technologies on the PHP/Laravel platform.\n\n• Perform and participate in code reviews, peer inspections, and technical design specifications.\n\n\n**Skills And Qualifications:**\n\n• Bachelor's Degree in Computer Science, Information Technology, or a related field is required.\n\n• Strong understanding of Object-Oriented Programming (OOP).\n\n• Familiarity with RESTful Web Services.\n\n• Experience working with the Laravel Framework.\n\n• Proficient in using Bootstrap or Bootstrap-Vue.\n\n• Minimum of 2 years of working experience in a related field.\n\n• Preferably specialized in IT/Computer Software (non-management & non-supervisory role).",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537062/hacktiv8/career/full-stack-6l55ojyknd.jpg",
    "jobType": "Full-Time",
    "companyId": 58,
    "authorId": 3,
    "createdAt": "2024-08-13T08:17:43.155Z",
    "updatedAt": "2024-08-13T08:17:43.155Z"
  },
  {
    "title": "Software Quality Assurance",
    "description": "**Requirements:**\n- Bachelor's degree in Information Technology, Computer Science, or a related field.\n- Minimum of 1 year of experience in Quality Assurance.\n- Experience in the banking sector is a plus.\n- Proficient in using manual testing tools.\n- Familiarity with JMeter/Micro Focus is an advantage.\n- Must be willing to work in Central Jakarta.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537063/hacktiv8/career/software-quality-assurance-3lw98wduz41.jpg",
    "jobType": "Contract",
    "companyId": 41,
    "authorId": 10,
    "createdAt": "2024-08-13T08:17:44.106Z",
    "updatedAt": "2024-08-13T08:17:44.106Z"
  },
  {
    "title": "Network Security",
    "description": "### Job Description\n\n**Position:** Network Security Specialist  \n**Location:** [Insert Location Here]  \n**Employment Type:** [Full-time/Part-time/Contract]  \n\n#### Key Responsibilities:\n- **Monitor Event Management** of Network Security Devices to ensure optimal performance and security posture.\n- **Support Incident Management** activities for the Network Security Infrastructure, ensuring prompt resolution of security incidents.\n- **Conduct Root Cause Analysis** on incidents affecting the Network Security Infrastructure to prevent future occurrences.\n- **Manage Changes** in the Network Security Infrastructure, including documentation and reporting of change activities.\n- **Perform Knowledge Management** to analyze trends in the use of security and network devices and report findings on the Network Security Infrastructure.\n- **Oversee Inventory Management** for all Network Security Infrastructure assets.\n- **Provide On-Site Assistance**, including corrective, preventive, and proactive maintenance to ensure system reliability and uptime.\n- **Generate Reports** detailing the overall results of IT Service Management activities related to Network Security maintenance.  \n\n#### Qualifications:\n- **Knowledge of Information Security and Network**: A strong understanding of information security principles and networking concepts is mandatory.\n- **Understanding of Firewalls, Routers, and Switches**: Familiarity with these systems and their concepts is required.\n- **Experience with Network Security Products**: Proven experience in dealing with network security solutions is essential.\n- **Certifications**: Possession of Network Security Product certification or Network Security Professional certification is required.\n- **Familiarity with IT Security Frameworks and Standards**: Knowledge of frameworks such as CIS or COBIT is considered a plus.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537064/hacktiv8/career/network-security-n5vof67ut4t.png",
    "jobType": "Contract",
    "companyId": 59,
    "authorId": 7,
    "createdAt": "2024-08-13T08:17:44.827Z",
    "updatedAt": "2024-08-13T08:17:44.827Z"
  },
  {
    "title": "DevOps",
    "description": "### Persyaratan:\n\n1. Minimal memiliki gelar sarjana S1 dalam ilmu komputer/teknik komputer atau bidang teknologi informasi.\n2. Memiliki kemampuan Bahasa Inggris yang memadai.\n3. Memiliki sertifikasi berikut ini menjadi nilai tambah:\n   - a. Certified DevSecOps Professional (CDP); atau\n   - b. Certified Kubernetes Security Specialist (CKS); atau\n   - c. Red Hat Certified Engineer in DevOps; atau\n   - d. Certified Information Systems Security Professional (CISSP); atau\n   - e. Sertifikat sejenis lainnya.\n4. Memiliki kemampuan dan keahlian analitis serta teknis yang kuat, dan dapat bekerja dengan baik di bawah tekanan.\n5. Memiliki keterampilan teknis yang mendalam tentang protokol dan teknologi dalam Development, Security, dan Operasional.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537065/hacktiv8/career/devops-zhfpikqhyb.png",
    "jobType": "Contract",
    "companyId": 11,
    "authorId": 2,
    "createdAt": "2024-08-13T08:17:45.904Z",
    "updatedAt": "2024-08-13T08:17:45.904Z"
  },
  {
    "title": "Frontend Engineer (iOS)",
    "description": "**Job Description**\n\nAs a Frontend Engineer (iOS), you will have the opportunity to work in an international environment and may be relocated as necessary to the United States.\n\n**About Your Responsibilities for the Role**\n- Design, develop, and maintain scalable and high-performance mobile applications for the iOS platform.\n- Collaborate with cross-functional teams to define, design, and implement new features.\n- Write clean, maintainable, and efficient code.\n- Participate in the complete application lifecycle, including design, development, testing, release, and maintenance.\n- Debug and resolve technical issues to ensure optimal performance.\n- Perform unit testing to guarantee application robustness and reliability.\n- Conduct code reviews to uphold high code quality and facilitate knowledge sharing among team members.\n- Stay updated with industry trends and technologies.\n\n**Requirements**\n\n**What You Need to Have (Minimum Qualifications)**\n- 6+ years of experience in native iOS app development.\n- Proficiency in Swift, Objective-C, and SwiftUI.\n- Experience with cross-platform frameworks like Flutter, React Native, or Kotlin Multiplatform is a plus.\n- Understanding of mobile app design patterns (MVC, MVP, MVVM, Clean Architecture, VIPER).\n- Experience with RESTful APIs, GraphQL, and integrating third-party libraries.\n- Experience in building and maintaining iOS frameworks with CocoaPods/Swift Packages.\n- Knowledge of unit and automated testing using XCUI.\n- Familiarity with tools like Jenkins, Fastlane, and version control systems (Git, GitLab).\n- Strong problem-solving skills and attention to detail.\n- Experience with Continuous Integration and Continuous Delivery (CI/CD) processes.\n- Published production-grade apps in the App Store or a portfolio demonstrating relevant work.\n- Understanding of user-friendly experience and interface design principles.\n- Adherence to security and data protection guidelines for mobile applications.\n\n**What Would Make You Stand Out from the Crowd (Preferred Qualifications)**\n- Familiarity with Bluetooth, Digital Key, Core Bluetooth, External accessories, OAuth 2.0, and iAP2.\n- Experience in Agile and Test-driven development environments.\n- Good knowledge of UX best practices and mobile accessibility standards.\n- Experience with App Store policies and app submission.\n- Strong communication skills with the ability to collaborate effectively with remote teams.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537066/hacktiv8/career/frontend-engineer-%28ios%29-bdccydxhj0p.png",
    "jobType": "Contract",
    "companyId": 60,
    "authorId": 7,
    "createdAt": "2024-08-13T08:17:46.587Z",
    "updatedAt": "2024-08-13T08:17:46.587Z"
  },
  {
    "title": "Golang Engineer",
    "description": "**Job Title: Backend Engineer**  \n\n**Job Responsibilities:**  \n1. Design, develop, test, and optimize back-end services.  \n2. Provide constructive insights on system architecture, technology selection, and research and development processes.  \n3. Participate in the design and implementation of containerization solutions, as well as Kubernetes and CI/CD (Continuous Integration and Continuous Deployment) methodologies.  \n4. Collaborate with team members to ensure the proper implementation of business technical standards.  \n5. Conduct code reviews to maintain and enhance code quality.  \n\n**Job Requirements:**  \n1. Bachelor’s degree or higher in a computer-related field.  \n2. Minimum of 3 years’ experience in Golang development; preference will be given to candidates who have led medium to large projects.  \n3. Proficiency in the Go language and associated technology stacks, along with strong programming habits.  \n4. Familiarity with Docker container technology and Kubernetes, including expertise in components like Pod, Deployment, Service, and Helm.  \n5. Understanding of CI/CD workflows with practical experience in implementing them.  \n6. Solid foundational skills in data management.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537066/hacktiv8/career/golang-engineer-hxf2lbq2pyq.png",
    "jobType": "Full-Time",
    "companyId": 61,
    "authorId": 9,
    "createdAt": "2024-08-13T08:17:47.354Z",
    "updatedAt": "2024-08-13T08:17:47.354Z"
  },
  {
    "title": "Web Developer",
    "description": "### Job Description\n\n#### Key Responsibilities:\n- **Website Development:** Create and maintain responsive, user-friendly marketplace and SaaS websites that align with Youtap's branding and technical requirements. Experience with WordPress and/or WooCommerce is a must.\n- **Graphic Design:** Design and manage images and graphics for the website.\n- **API Integration:** Seamlessly integrate Youtap APIs with third-party partners and platforms, ensuring smooth data exchange and functionality.\n- **WhatsApp for Business Integration:** Implement and manage WhatsApp for Business integration to enable customer communication, support, and transactions.\n- **Technical Expertise:** Leverage your knowledge of APIs, JavaScript, and software development best practices to optimize website performance, security, and scalability.\n- **Search Engine Optimization (SEO):** Experience with SEO practices required.\n- **Collaboration:** Work closely with cross-functional teams, including software developers, product managers, and designers, to ensure project goals are achieved.\n- **Problem-Solving:** Identify and troubleshoot technical issues, providing timely solutions for uninterrupted website operation.\n\n#### Requirements:\n- **Experience:** Proven track record in developing marketplace and SaaS websites, preferably with 3+ years of experience.\n- **Proficiency:** Demonstrable proficiency with web development environments such as WordPress, Webflow, Shopify, ChargeBee, WooCommerce, or similar. You will be required to show your portfolio.\n- **JavaScript:** Proficient in JavaScript and relevant web development frameworks.\n- **API Integration Expertise:** Expertise in API integration (RESTful, GraphQL, etc.).\n- **WhatsApp for Business API:** Experience with WhatsApp for Business API.\n- **Web Development Tools:** Familiarity with various web development tools and platforms.\n- **Language Skills:** Excellent written and spoken English and Bahasa Indonesia.\n- **Teamwork:** Ability to collaborate effectively in a remote and diverse team environment.\n- **Communication:** Strong communication skills to convey technical concepts to both technical and non-technical stakeholders.\n- **Problem-Solving Approach:** A proactive and analytical approach to problem-solving.\n\n#### Preferred Qualifications:\n- **Website Development Experience:** A portfolio of developed sites is preferred.\n- **E-commerce Platforms:** Experience with e-commerce platforms or payment gateways.\n- **Digital Financial Services:** Knowledge of the Indonesian digital financial services landscape.\n- **Agile Methodologies:** Familiarity with agile development methodologies.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537067/hacktiv8/career/web-developer-9ibq2kxdz1p.png",
    "jobType": "Contract",
    "companyId": 37,
    "authorId": 6,
    "createdAt": "2024-08-13T08:17:48.263Z",
    "updatedAt": "2024-08-13T08:17:48.263Z"
  },
  {
    "title": ".NET Developer",
    "description": "**Job Title: .NET Developer**\n\n**Responsibilities:**\n- Development of SoftwareSeni’s products.\n- Collaborate with the team to identify and resolve issues.\n\n**Requirements:**\n- Minimum 2 years of experience in .NET.\n- Proficient in .NET (Backend) development.\n- Comfortable with Linux, Apache, PM2, and IIS.\n- Experience with PHP, JavaScript, HTML, and CSS.\n\n**Nice to have:**\n- Eagerness to learn about other technology stacks.\n- Fluency in English is a plus.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537068/hacktiv8/career/.net-developer-k531f0fryq.jpg",
    "jobType": "Full-Time",
    "companyId": 62,
    "authorId": 5,
    "createdAt": "2024-08-13T08:17:49.080Z",
    "updatedAt": "2024-08-13T08:17:49.080Z"
  },
  {
    "title": "Hardware Engineer",
    "description": "\"**Hardware Engineer**\\n\\n**Tentang Kami**\\nBroilerX adalah perusahaan yang sedang berkembang di bidang Poultry-tech, berfokus pada pengembangan industri peternakan Ayam Broiler, Layer, dan Karkas dengan lebih dari 18 unit yang tersebar secara nasional. Misi kami adalah menjadi penyedia terkemuka yang hadir sebagai solusi dalam industri peternakan unggas dari hulu ke hilir, serta memberdayakan peternak secara global. Kami mencari talenta-talenta potensial yang berdedikasi untuk bergabung dan mengembangkan karir bersama BroilerX.\\n\\n**Deskripsi Pekerjaan:**\\n1. Merancang perangkat IoT BroilerX, termasuk papan utama, sistem komunikasi, dan manajemen daya yang cukup handal untuk bekerja di lingkungan yang keras.\\n2. Bertanggung jawab atas manajemen komponen elektronik dan produksi perangkat BroilerX serta kolaborasi dan komunikasi dengan vendor eksternal.\\n3. Membantu BroilerX menjalankan produksi internal.\\n4. Merancang dan memproduksi komponen mekanis internal perangkat BroilerX seperti penutup/kasing atau jig elektronik dari desain, prototipe, dan produksi.\\n5. Merancang dan memproduksi prototipe perangkat BroilerX untuk validasi dan pengujian.\\n6. Bertanggung jawab membuat dokumentasi teknis untuk komponen elektronik seperti desain PCB (skema, tata letak papan, file Gerber untuk produksi, analisis/tinjauan desain dan hasilnya, prosedur/manual perakitan).\\n7. Bekerja dengan tim teknik untuk menciptakan desain untuk manufaktur (DFM).\\n\\n**Persyaratan:**\\n1. Berpengalaman dalam pemrograman hardware/embedded seperti C/C++.\\n2. Berpengalaman menggunakan alat uji elektronik dan komponen.\\n3. Memiliki pengalaman dalam desain sirkuit analog, sirkuit digital, dan sinyal campuran.\\n4. Memiliki pengalaman dalam mikrokontroler (ARM, Cortex, Atmel).\\n5. Memiliki pengalaman bekerja dalam proyek elektronik/hardware.\\n6. Memiliki pengalaman dalam desain PCB menggunakan EagleCAD.\\n7. Memiliki pengalaman dalam implementasi protokol komunikasi serial seperti (SPI, I2C, Ethernet, RS232, Modbus, dan sebagainya).\\n\\n**Keunggulan Berkarir Bersama BroilerX:**\\n1. Berkesempatan bekerja bersama expert dalam bidang Poultry-tech dari seluruh Indonesia.\\n2. Kompensasi dan benefit yang kompetitif.\\n3. Perkembangan diri dan jenjang karir.\\n\\n**Tahapan Rekrutmen:**\\n1. HR Interview\\n2. Psikotest\\n3. Technical Test\\n4. User Interview\\n5. Offering Process\\n\\nSilahkan kumpulkan lamaran Anda sebelum 10 Agustus 2024 melalui website kami: [career.broilerx.com](http://career.broilerx.com)\\n\\nLet's Grow and Move Forward with BroilerX!\"",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537069/hacktiv8/career/hardware-engineer-9jv95jct3i4.jpg",
    "jobType": "Full-Time",
    "companyId": 63,
    "authorId": 2,
    "createdAt": "2024-08-13T08:17:49.694Z",
    "updatedAt": "2024-08-13T08:17:49.694Z"
  },
  {
    "title": "ERP SPECIALIST / SYSTEM ANALYST",
    "description": "### Job Title: ERP System Specialist\n\n#### Overview:\nWe are seeking an ERP System Specialist to oversee and optimize our ERP system, which serves as the operational backbone of our company. This role will expose you to our comprehensive business process flows, including manufacturing, sales, purchasing, and inventory management. You will work closely with users from various divisions on data input and reporting activities.\n\n#### Key Responsibilities:\n- Learn the existing ERP system and manage, optimize, and align it with actual conditions.\n- Provide solutions to users’ issues related to ERP system data input and reporting; consult with the ERP System consultant when necessary.\n- Conduct trial runs and simulations of new modules/features of the current ERP system and present them to management.\n- Create Work Instructions or Standard Operating Procedures (SOPs) to guide end users.\n- Maintain servers and PCs for users.\n\n#### Qualifications:\n**To be successful in this role, candidates will need to have:**\n- Bachelor/Diploma in Computer Science, Systems Information, or Computerized Accounting with a minimum GPA of 3.0.\n- A minimum of 2 years' experience using manufacturing ERP systems such as INFOR, EPICOR, BAAN, SAP, or MICROSOFT DYNAMICS.\n- Proficient in Excel and PowerPoint.\n- Knowledge of SQL and Reporting Tools (such as Crystal Reports, Active Reports, etc.) is a plus.\n- Willingness to work on-site on weekdays and half-day Saturdays.\n- Preferably residing in Tangerang.\n\n#### Benefits:\n- Work in a small, collaborative environment.\n- Opportunity to learn and gain new skills beyond primary responsibilities.\n- High-performing employees will be noticed faster by top management.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537069/hacktiv8/career/erp-specialist-system-analyst-vn2s99ra3uh.jpg",
    "jobType": "Full-Time",
    "companyId": 64,
    "authorId": 4,
    "createdAt": "2024-08-13T08:17:50.409Z",
    "updatedAt": "2024-08-13T08:17:50.409Z"
  },
  {
    "title": "Full Stack Developer",
    "description": "### Posisi: Developer Sistem Laporan Penjualan\n\n#### Kriteria:\n- **Pria/Wanita**: 21-28 Tahun\n- **Menguasai** HTML, CSS  \n- **Menguasai** Bahasa pemrograman: PHP, Javascript, Golang, Python\n- **Menguasai** Mysql, MariaDB\n- **Menguasai** framework seperti Laravel, CodeIgniter, React.js, dan lain-lain\n- **Mampu menganalisis** sistem berbasis penjualan\n- **Mampu berkomunikasi** dengan baik\n\n#### Uraian Tugas:\n- **Merancang** sistem laporan penjualan\n- **Memvisualisasi** data\n- **Mengelola** database laporan penjualan\n- **Membuat** sistem berbasis web\n- **Merancang** tampilan backend dan frontend",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537070/hacktiv8/career/full-stack-developer-jmh5pj7x3k.png",
    "jobType": "Full-Time",
    "companyId": 65,
    "authorId": 4,
    "createdAt": "2024-08-13T08:17:51.129Z",
    "updatedAt": "2024-08-13T08:17:51.129Z"
  },
  {
    "title": "React Js Developer",
    "description": "## SoftwareSeni Job Opportunity\n\n**Company Overview:**  \nSoftwareSeni is a leading Software Development Company situated in Yogyakarta and Sydney, Australia. We specialize in designing and developing mobile applications, websites, and engaging mobile experiences, driven by our passion for solving complex challenges in user experience, design, and coding.\n\n**Global Reach:**  \nWe build enterprise web-based solutions for clients across the globe, including Australia, Indonesia, Europe, Africa, and America. Our notable clients include:\n- **Indonesia:** Astra International, Traveloka, Angkasa Pura, Peduli Anak Foundation  \n- **Australia:** Bike Exchange, Downsizing, Red Balloon, Sectara, and many more.\n\n### Skills & Requirements:\n- Minimum 5 years of experience in ReactJS development.\n- Proficient in JavaScript, specifically ECMAScript 2015 (ES6).\n- Strong understanding of event-driven programming with JavaScript.\n- Experience with React Native and its modules.\n- Solid grasp of Object-Oriented Programming (OOP), preferably with jQuery.\n- Proficient in HTML and CSS3.\n- Excellent software engineering practices including requirement analysis, design, testing, and configuration management.\n- Strong programming skills with the capability of performing basic analysis and functional testing.\n- Fluency in English communication skills.\n- Relevant degrees (Associate and/or Bachelor) in Software Engineering or related fields.\n\n### Responsibilities:\n- Develop and enhance SoftwareSeni’s products.\n- Collaborate with team members to troubleshoot and resolve technical issues.\n\nIf you are a driven and skilled developer looking to join a dynamic team, we would love to hear from you!",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537071/hacktiv8/career/react-js-developer-u8senu18ra.jpg",
    "jobType": "Full-Time",
    "companyId": 62,
    "authorId": 3,
    "createdAt": "2024-08-13T08:17:51.808Z",
    "updatedAt": "2024-08-13T08:17:51.808Z"
  },
  {
    "title": "Backend Programmer Internship",
    "description": "Hi Millennials People,\n\n**Let's Join Our Winning Team!**\n\nKami mencari kandidat terbaik untuk mengisi posisi yang dibutuhkan oleh tim dengan tanggung jawab:\n- Membantu membuat dan mengembangkan aplikasi web yang dibutuhkan perusahaan.\n\n**Kualifikasi:**\n- Freshgraduate dipersilakan melamar.\n- Terbiasa menggunakan pemrograman **Node JS** dan **Framework Express JS**.\n- Memahami **Database noSQL MongoDB** (Mongoose) dan **Rest API**.\n- Lokasi Magang di area perkantoran **Kelapa Gading**, Jakarta Utara.\n- Waktu Magang minimal **6 bulan**.\n\n**Benefit:**\n- Upah bekerja.\n- Sertifikat Internship.\n- Peluang menjadi karyawan.\n- Waktu kerja **Senin-Jumat**.\n\nApabila Anda adalah pribadi yang kami butuhkan, silahkan apply lamaran untuk mengikuti tahap tes onlinenya segera.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537072/hacktiv8/career/backend-programmer-internship-x6vvxpkxcb.png",
    "jobType": "Internship",
    "companyId": 66,
    "authorId": 8,
    "createdAt": "2024-08-13T08:17:52.552Z",
    "updatedAt": "2024-08-13T08:17:52.552Z"
  },
  {
    "title": "Java Developer",
    "description": "**Job Title: Java Developer**\n\n**Requirements:**\n- Minimum of 3 years of experience in Java programming.\n- Strong proficiency and experience in JavaScript.\n- Familiarity with Java JDK 11, Spring Framework, MySQL, and Git.\n- Solid understanding of Object-Oriented Programming principles.\n- Knowledge of software engineering practices, including requirements analysis, design, testing, and configuration management.\n- Fluent in English with excellent communication skills.\n- Experience with Node.js and Scala programming languages is an advantage.\n\n**Responsibilities:**\n- Oversee the development of Java-based projects.\n- Provide exceptional troubleshooting and bug resolution support.\n- Accurately document project time and activities as needed.\n- Ensure commitment to meeting project deadlines.\n- Offer technical support for ongoing projects.\n- Collaborate effectively as part of a team.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537073/hacktiv8/career/java-developer-hb4da8bgs58.jpg",
    "jobType": "Full-Time",
    "companyId": 62,
    "authorId": 5,
    "createdAt": "2024-08-13T08:17:54.057Z",
    "updatedAt": "2024-08-13T08:17:54.057Z"
  },
  {
    "title": "Software Engineer",
    "description": "**Job Descriptions:**\n\n- Develop and maintain software applications for Sekolah Pelita Harapan (SPH) utilizing agile methodologies.\n- Collaborate with cross-functional teams to gather requirements, design, implement, test, and deploy software solutions.\n- Engage in the entire software development lifecycle, including analysis, coding, testing, and debugging.\n- Write clean, efficient, and maintainable code that adheres to best practices and coding standards.\n- Conduct code reviews and provide constructive feedback to ensure code quality and performance.\n- Troubleshoot and resolve software defects and issues promptly.\n- Stay updated with the latest software development trends and technologies, proposing innovative ideas to enhance system functionality and user experience.\n- Document software designs, technical specifications, and user manuals.\n\n**Job Requirements:**\n\n- Strong demonstrable faith.\n- A biblical worldview.\n- Fluency in spoken and written English.\n- A minimum of 5 years of experience as a Software Engineer, with substantial expertise in developing and delivering software solutions.\n- Highly agile, curious, driven, proactive, disciplined, and passionate about software development.\n- Proficiency in various software development languages and frameworks.\n- Experience with web development, databases, and cloud technologies.\n- Knowledge of software engineering principles, design patterns, and best practices.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537074/hacktiv8/career/software-engineer-vizt5alnm0d.png",
    "jobType": "Full-Time",
    "companyId": 67,
    "authorId": 2,
    "createdAt": "2024-08-13T08:17:54.904Z",
    "updatedAt": "2024-08-13T08:17:54.904Z"
  },
  {
    "title": "Senior Software Engineer",
    "description": "### Job Title: Software Engineer\n\n#### Overview:\nOur client is currently seeking an experienced Software Engineer to join their dynamic engineering team. In this role, you will design and build high-performance applications while also maintaining and optimizing existing software. Collaborate closely with peers from inception to production phase to deliver impactful results.\n\n#### What You Will Do:\n- Develop applications for the company, demonstrating proficiency in SQL, RUST, and ZIG.\n- Contribute to the entire system construction lifecycle, including requirement analysis, architectural discussions, roadmap planning, solution design, and iterative optimization.\n- Provide insights that influence project direction and technology choices.\n\n#### What You Will Need:\n- A Bachelor’s degree or higher in Computer Science or a related field.\n- Ability to learn business processes from existing and future applications, design Software Architecture, and create application documentation (C4 Model, BPMN, user stories).\n- Understanding of desktop, web, and mobile applications.\n- Familiarity with Inter Process Communication, including REST-API and GRPC.\n- Knowledge of Monolithic and Microservices software architecture.\n- Understanding of Function As A Service and other cloud application technologies.\n- Awareness of virtualization, containerization, and web assembly (WASI/WASM).\n- Knowledge of native and cross-platform application development.\n- Mastery of Software Development Life Cycle, Software Testing, CI/CD, TCP/IP family protocol, Data Compression, Encryption, relational databases, and graph databases.\n- Proficiency in SQL.\n- Familiarity with PRQL and Malloy.\n- Capable of reading source code in Visual Basic .NET 2008, Python, and Java for mobile applications.\n- Ability to learn new languages, frameworks, and concepts in software engineering.\n- Experience in developing applications using RUST or ZIG.\n- Strong communication skills, teamwork spirit, and the ability to collaborate effectively with developers and stakeholders.\n- Willingness to be based in Surakarta, Central Java during the development process, with an option for remote work post-implementation.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537075/hacktiv8/career/senior-software-engineer-4by16hfapsm.jpg",
    "jobType": "Full-Time",
    "companyId": 68,
    "authorId": 3,
    "createdAt": "2024-08-13T08:17:56.297Z",
    "updatedAt": "2024-08-13T08:17:56.297Z"
  },
  {
    "title": "Fullstack Developer",
    "description": "**PT. Media Digitech Indonesia** adalah perusahaan IT terpercaya di Indonesia yang sedang mencari **Fullstack Developer** berpengalaman untuk bergabung dalam tim kami. Anda akan bertanggung jawab untuk memelihara dan mengembangkan software, meningkatkan desain responsif, dan mengintegrasikan sistem.  \n\n**Kualifikasi:**  \n- Minimal lulusan D3/S1 atau setara di bidang Informatika atau sejenisnya  \n- Memiliki pengalaman minimal 3 tahun di bidangnya  \n- Terampil menggunakan OS Linux  \n- Menguasai AWS Cloud  \n- Menguasai Framework React dan Next.js  \n- Menguasai Framework Laravel - Livewire  \n- Wajib menguasai bahasa pemrograman PHP, HTML/CSS/JS, dan Typescript  \n- Wajib menguasai Git  \n- Menguasai Docker Environment  \n\n**Tanggung Jawab Utama:**  \n- Mengembangkan dan memelihara situs web backend yang dimiliki oleh klien dan internal perusahaan  \n- Membuat dokumentasi teknis sesuai dengan standar yang berlaku  \n- Mengikuti perkembangan dan tren web, praktik terbaik pemrograman, dan internet.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537076/hacktiv8/career/fullstack-developer-xf2wesglbbp.png",
    "jobType": "Full-Time",
    "companyId": 69,
    "authorId": 3,
    "createdAt": "2024-08-13T08:17:57.068Z",
    "updatedAt": "2024-08-13T08:17:57.068Z"
  },
  {
    "title": "Full Stack Engineer",
    "description": "**Job Description**\n\n- Build scalable and robust APIs and systems.\n- Develop reusable code and libraries for future use.\n- Optimize code and applications for maximum speed and scalability.\n- Ensure the stability and performance of the system.\n- Implement security measures and data protection protocols.\n- Identify and resolve bottlenecks and bugs in our systems.\n\n**Job Requirements**\n\n- Bachelor’s Degree in Computer Science, Information Technology, or a related field.\n- Minimum of 1-2 years of professional experience.\n- Proficiency in ReactJS or ReactTS, and Javascript/TypeScript.\n- Proficiency in Golang, PHP, or Node.js.\n- In-depth knowledge of frameworks such as Laravel, CodeIgniter, Gin, Fiber, Express, Next.js, or Nest.js.\n- Strong understanding of REST APIs.\n- Proficiency in code versioning tools like Git.\n- Strong attention to detail with excellent analytical and problem-solving skills.\n- Experience working effectively in team settings.\n- Strong communication and interpersonal skills.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537077/hacktiv8/career/full-stack-engineer-doxxnul2e9.jpg",
    "jobType": "Full-Time",
    "companyId": 70,
    "authorId": 10,
    "createdAt": "2024-08-13T08:17:57.737Z",
    "updatedAt": "2024-08-13T08:17:57.737Z"
  },
  {
    "title": "Frontend Developer",
    "description": "**Job Descriptions**\n\n- Mengembangkan antarmuka pengguna dengan menulis kode untuk mengimplementasikan elemen visual.\n- Membuat prototype, mockup, dan situs staging untuk ditinjau dan mendapatkan umpan balik.\n- Mengoptimalkan situs web dan aplikasi agar cepat dimuat.\n- Desain untuk optimalisasi mobile.\n- Menangani dan memecahkan berbagai masalah situs web dan masalah pemrograman.\n- Mengembangkan dan mengusulkan produk atau fitur baru dengan memantau pengguna.\n\n**Job Requirements**\n\n- Pendidikan minimal S1 Ilmu Komputer/Sistem Informasi/Informasi Teknologi.\n- Pengalaman minimal 1 tahun di bidang yang sama.\n- Bersedia bekerja dalam tim.\n- Memahami ReactJS/ReactTS, MySQL/PostgreSQL, Linux, Nginx, HTML.\n- Memahami Typescript.\n- Memahami Figma.\n- Mengerti framework Laravel/CI/Next/Express.\n- Berpengalaman dalam menggunakan Git.\n- Kemampuan untuk mengimplementasikan desain Figma menjadi web.\n- Memiliki Sertifikat BNSP/Sejenis (Optional).\n- Bersedia bekerja on-site di Jogja.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537078/hacktiv8/career/frontend-developer-fmu3ahd7wru.jpg",
    "jobType": "Full-Time",
    "companyId": 70,
    "authorId": 4,
    "createdAt": "2024-08-13T08:17:58.603Z",
    "updatedAt": "2024-08-13T08:17:58.603Z"
  },
  {
    "title": "Backend Engineer (Java Springboot)",
    "description": "**What will you do:**\n\n- Work closely with the senior backend engineer to address business problems and needs, create a product roadmap, and actively contribute to development prioritization.\n- Deliver high-quality software design.\n- Develop design specifications aligned with business requirements and issues.\n- Assess and evaluate technology trade-offs.\n- Enhance personal knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment.\n\n**Requirements:**\n\n- At least 1 year of software development experience in backend development. Fresh graduates are welcome.\n- Bachelor's degree or higher in Computer Science or related fields.\n- In-depth understanding of computer science fundamentals (data structures and algorithms, operating systems, databases, etc.).\n- Strong skills in Core JAVA, server-side Java technologies, and the Spring Boot framework.\n- Proficiency in OOP, SQL, design patterns, and software best practices.\n- Solid knowledge of multi-threading, enterprise integration patterns, event processing platforms (e.g., Kafka, Flink, Spring Cloud Data Flow), web services, and REST.\n- Knowledge of NoSQL and JMS is a plus.\n- Familiarity with CI/CD tooling and infrastructure (Jenkins, Gitlab CI) is a plus.\n- Familiarity with virtualization, containerization, and orchestration technologies (Docker, Kubernetes) is a plus.\n\n**Placement:** Bandung  \n**Full-time working hours:** Monday to Friday (Work from Office)",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537078/hacktiv8/career/backend-engineer-%28java-springboot%29-54bo2bumjvi.jpg",
    "jobType": "Full-Time",
    "companyId": 71,
    "authorId": 4,
    "createdAt": "2024-08-13T08:17:59.319Z",
    "updatedAt": "2024-08-13T08:17:59.319Z"
  },
  {
    "title": "System Analyst (Jakarta)",
    "description": "## Job Descriptions:\n\n**a. Tanggung Jawab Utama:**  \ni. Melaksanakan tugas dalam bidang tech-engineering untuk mendukung tim teknis dalam mencapai tujuan bisnis perusahaan.  \nii. Memimpin, mengelola, dan melatih tim teknis dalam pengembangan sistem.  \niii. Mendesain sistem untuk meningkatkan efisiensi, ketersediaan, skala, fleksibilitas, fungsionalitas, dan kegunaan produk perusahaan.  \niv. Memiliki pemahaman mendalam tentang arsitektur perangkat lunak, sistem operasi, dan jaringan.  \nv. Bekerja sama dengan tim teknis untuk menetapkan tolok ukur, standarisasi, dan mekanisme lain untuk memenuhi persyaratan non-fungsional.  \nvi. Bekerja sama dengan pengguna dan pemangku kepentingan untuk memahami kebutuhan bisnis.  \nvii. Menciptakan alat dan sumber daya yang membantu tim bekerja lebih efisien dan efektif.\n\n## Requirements:  \n**a. Kualifikasi:**  \ni. Lulusan S1 atau setara dari semua jurusan dengan IPK minimal 3.00.  \nii. Pengalaman minimal 1-2 tahun sebagai System Analyst atau di bidang terkait, dengan setidaknya 2 tahun pengalaman sebelumnya sebagai software developer/engineer/programmer.  \niii. Harus memiliki pengalaman sebagai System Analyst di Perusahaan Multifinance.  \niv. Mahir dalam: perencanaan, arsitektur, desain, estimasi, dan pelaksanaan untuk memastikan pengembangan perangkat lunak dapat disampaikan dengan baik kepada pelanggan.  \nv. Mampu memimpin tim, membimbing anggota tim, dan memastikan pekerjaan diselesaikan dengan baik sesuai kebutuhan bisnis.  \nvi. Mampu berkomunikasi dengan jelas, efektif, dan tepat sasaran, baik secara lisan maupun tulisan.  \nvii. Memiliki pengetahuan mendalam tentang teknologi informasi, pengembangan perangkat lunak, dan kerangka kerja terdistribusi, serta memiliki antusiasme untuk perkembangan teknologi terkini.  \nviii. Mampu menemukan dan memperbaiki masalah teknis dalam lingkungan yang sangat adaptif.  \nix. Memahami GIT, CI-CD, teknologi virtualisasi dan containerisasi, serta mampu menggunakan alat untuk pelacakan masalah.  \nx. Memahami Agile Mindset dan Scrum Framework.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537079/hacktiv8/career/system-analyst-%28jakarta%29-uon8el2rzh.jpg",
    "jobType": "Full-Time",
    "companyId": 72,
    "authorId": 8,
    "createdAt": "2024-08-13T08:18:00.012Z",
    "updatedAt": "2024-08-13T08:18:00.012Z"
  },
  {
    "title": "Backend Golang Developer",
    "description": "### Job Title: Software Developer\n\n#### Kualifikasi:\n- Pendidikan minimum: D3 jurusan Ilmu Komputer atau Teknologi Informasi  \n- Menguasai dasar programming dan algoritma  \n- Menguasai pemrograman Golang  \n- Memiliki kemampuan programming dan manipulasi data  \n- Pengalaman minimum 2 tahun sebagai tim Development  \n\nKami mencari seorang Software Developer yang berbakat untuk bergabung dengan tim kami. Jika Anda memenuhi kualifikasi di atas, silakan kirimkan lamaran Anda.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537080/hacktiv8/career/backend-golang-developer-nkzjuxu7ahb.png",
    "jobType": "Full-Time",
    "companyId": 73,
    "authorId": 7,
    "createdAt": "2024-08-13T08:18:00.760Z",
    "updatedAt": "2024-08-13T08:18:00.760Z"
  },
  {
    "title": "PHP/Laravel Developer",
    "description": "We are a growing business seeking a **PHP/Laravel Developer** to accelerate our expansion. This role presents an exciting opportunity to collaborate with clients in designing and developing applications, while also contributing to the enhancement of our development practices at SoftwareSeni.\n\n**Skills & Requirements:**\n- Previous experience with the Laravel PHP framework, SQL, and JavaScript.\n- In-depth knowledge of Object-Oriented PHP.\n- Hands-on experience with SQL schema design.\n- A team player with excellent communication skills.\n- Responsible, able to prioritize tasks, and meet deadlines.\n- Efficient problem-solving abilities.\n- Familiarity with version control systems such as Git or GitHub.\n- Proficient in English (both written and spoken).\n\n**Responsibilities:**\n- Write clean, modular, reusable, and easily maintainable code.\n- Collaborate effectively with co-developers on various projects.\n- Troubleshoot and debug web applications as needed.\n- Stay updated on new trends and best practices in web development.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537080/hacktiv8/career/phplaravel-developer-ftn19ojsdt.jpg",
    "jobType": "Full-Time",
    "companyId": 62,
    "authorId": 2,
    "createdAt": "2024-08-13T08:18:01.572Z",
    "updatedAt": "2024-08-13T08:18:01.572Z"
  },
  {
    "title": "Frontend Engineer Staff",
    "description": "### Kualifikasi\n- Berpengalaman sebagai **Flutter Developer** minimal 1 tahun.\n- Memiliki pemahaman tentang **API, GRPC, GraphQL**.\n- Berpengalaman membuat kode program dengan format yang benar, rapi, dan mengikuti standar yang jelas.\n- Familiar dengan tools desain dan prototipe **Figma**.\n- Berpengalaman mendeploy aplikasi ke production menggunakan proses **CI/CD**.\n- Memiliki pengalaman menggunakan **state management** (Bloc, Getx).",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537081/hacktiv8/career/frontend-engineer-staff-nw4zsdlusvl.jpg",
    "jobType": "Full-Time",
    "companyId": 74,
    "authorId": 2,
    "createdAt": "2024-08-13T08:18:02.291Z",
    "updatedAt": "2024-08-13T08:18:02.291Z"
  },
  {
    "title": "Backend Developer Staff",
    "description": "## Kualifikasi\n\n- Berpengalaman sebagai Backend Developer minimal 1 tahun.\n- Memiliki pemahaman tentang Golang, NodeJs, PHP, atau Python.\n- Berpengalaman dalam mengimplementasikan API, GRPC, atau GraphQL.\n- Mampu membuat kode program yang terstruktur, rapi, dan mengikuti standar yang jelas.\n- Familiar dengan tools desain dan prototipe seperti Figma.\n- Berpengalaman dalam mendeploy aplikasi ke production menggunakan proses CI/CD.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537082/hacktiv8/career/backend-developer-staff-oesinaap5dl.jpg",
    "jobType": "Full-Time",
    "companyId": 74,
    "authorId": 1,
    "createdAt": "2024-08-13T08:18:03.018Z",
    "updatedAt": "2024-08-13T08:18:03.018Z"
  },
  {
    "title": "Technical Support",
    "description": "### Kualifikasi\n\n- **Pendidikan:** SMK/S1 Sistem Informasi, Ilmu Komputer atau sejenisnya  \n- **Pengalaman Kerja:** Minimal 1 tahun di bidang IT Support atau sebagai programmer  \n- **Keahlian Pemrograman:** Menguasai salah satu dari bahasa pemrograman berikut: Golang, Node.js, PHP, Vue.js, atau Flutter  \n- **Database:** Menguasai database SQL  \n- **Pengetahuan Tambahan:** Memahami Redis, CockroachDB, dan NATS  \n- **Kemampuan Analisis:** Mampu menganalisis dan memecahkan masalah dengan baik  \n- **Kepintaran dan Kreativitas:** Memiliki rasa ingin tahu dan keinginan belajar yang tinggi.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537083/hacktiv8/career/technical-support-kraov3la92.jpg",
    "jobType": "Full-Time",
    "companyId": 74,
    "authorId": 7,
    "createdAt": "2024-08-13T08:18:03.620Z",
    "updatedAt": "2024-08-13T08:18:03.620Z"
  },
  {
    "title": "Backend Developer",
    "description": "We are seeking a talented and dedicated **Backend Developer** to join our growing team. As a Backend Developer, you will play a key role in designing, developing, and maintaining the server-side components of our applications. If you hold a bachelor's degree and possess expertise in Java Spring Boot or Java, we invite you to apply for this exciting opportunity to contribute to our innovative projects.\n\n**Responsibilities:**\n- Collaborate with cross-functional teams to gather and analyze requirements.\n- Design and develop scalable, high-performance backend systems.\n- Write clean, efficient, and maintainable code.\n- Implement RESTful APIs and web services.\n- Optimize backend applications for speed and efficiency.\n- Troubleshoot and resolve backend issues.\n- Ensure the security and integrity of data.\n- Stay up-to-date with the latest backend development trends and best practices.\n- Participate in code reviews to maintain code quality.\n\n**Qualifications:**\n- Bachelor's degree in a related field.\n- Strong proficiency in Java Spring Boot or Java.\n- Experience with server-side development and backend frameworks.\n- Familiarity with RESTful API design and implementation.\n- Solid understanding of databases and SQL.\n- Strong problem-solving and debugging skills.\n- Ability to work both independently and in a team.\n- Excellent communication and teamwork skills.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537083/hacktiv8/career/backend-developer-n252ri9r3pa.png",
    "jobType": "Full-Time",
    "companyId": 75,
    "authorId": 10,
    "createdAt": "2024-08-13T08:18:04.336Z",
    "updatedAt": "2024-08-13T08:18:04.336Z"
  },
  {
    "title": "Senior Frontend / Backend Developer",
    "description": "Are you a Front-End/Back-End Developer seeking exciting challenges? If so, this position may pique your interest! To support our ambitious growth and further strengthen our technology team in Indonesia, we are in search of a talented Front-End/Back-End Developer.\n\n**Key Qualifications:**\n- 2-5 years of experience with 10+ web and mobile app development projects (Mandatory).\n- Proficiency in several technology stacks: .NET, RESTful API frameworks, Kotlin, Swift, Flutter, or various JavaScript Frameworks/Libraries, as well as JavaScript, NodeJS, React, Angular, etc.\n- Knowledge of Microsoft Graph API, Azure Functions, and Cosmos DB is a significant plus.\n- Familiarity with GitHub and CI/CD tools.\n- Bachelor's degree in Computer Science or a related diploma.\n- Experience using cloud services such as Azure and AWS.\n- Experience with API Gateway solutions like Kong.\n- Capability to implement GitHub and CI/CD tools.\n- Understanding of system architecture.\n- Strong enthusiasm for technology and software development.\n- Excellent communication skills.\n- Proficient in English.\n\nOur Technology Professionals serve as the technology experts during customer engagements and the development of our own products. As a Senior Professional, you'll act as a technology referent and coach for the Software Development Teams.\n\nIn addition to your current skill set and knowledge, we are looking for passionate individuals who embody our company spirit—curious learners who can work with minimal supervision and are eager to embrace new challenges.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537084/hacktiv8/career/senior-frontend-backend-developer-g6hop2xcszn.jpg",
    "jobType": "Full-Time",
    "companyId": 76,
    "authorId": 4,
    "createdAt": "2024-08-13T08:18:04.975Z",
    "updatedAt": "2024-08-13T08:18:04.975Z"
  },
  {
    "title": "iOS Developer",
    "description": "**Roles and Responsibilities**\n\n• Execute application development in alignment with business needs and the Bank’s standards.\n\n• Monitor applications, address bugs promptly, and enhance application performance regularly.\n\n• Implement and manage code or application versions by applying pair programming, conducting code reviews, utilizing branching models, and participating in the deployment of applications to the Artifact Repository and Google Play Store.\n\n• Conduct continuous research and development on new technologies to enhance the efficiency and effectiveness of development processes.\n\n• Implement Agile methodology and act as an Agent of Change towards the Bank’s digital transformation.\n\n• Collaborate with Product Owners to develop applications, understand the business objectives, and analyze alternative solutions to achieve these goals.\n\n• Work closely with the Chief Information Security Officer (CISO) to ensure that applications meet the Bank’s security standards.\n\n• Partner with IT STA to establish technological standards in application development.\n\n• Set work plans and manage subordinates under supervision, focusing on productivity, selection processes, capability development, performance assessment, and potential evaluations.\n\n\n**Desired Candidate Profile**\n\n• A minimum of 3 years of experience in Front End or equivalent roles.\n\n• Proficient in Swift programming.\n\n• Familiarity with Apple Design Interface guidelines.\n\n• Experienced with git flow, Agile methodologies, Jira, and Confluence.\n\n• Knowledgeable in Modular Architecture.\n\n• Understanding of Swift OOP and SOLID Principles.\n\n• Experienced with MVVM/VIPER Design Patterns and Reactive Programming.\n\n• Proven experience in developing iOS applications using Swift.\n\n• Skilled in creating Custom View Components.\n\n• Proficient in utilizing Design Tools (e.g., Zeplin/Figma) and Modular Architecture.\n\n• Experienced in CI/CD practices and Code Quality Checking (e.g., SAST).\n\n• Familiar with Git version control system.\n\n• Experienced in deploying applications to Testflight, Firebase, and the Apple Store.\n\n• Knowledgeable in integrating Firebase SDK.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537085/hacktiv8/career/ios-developer-7gklrcanhnx.jpg",
    "jobType": "Contract",
    "companyId": 77,
    "authorId": 4,
    "createdAt": "2024-08-13T08:18:05.607Z",
    "updatedAt": "2024-08-13T08:18:05.607Z"
  },
  {
    "title": "Full Stack Engineer",
    "description": "### Job Title: Fullstack Developer\n\n#### **Education:**  \nBachelor’s degree in Computer Science, Information Technology, or a related field.\n\n#### **Experience:**  \n- Minimum 3 years of professional experience as a Fullstack Developer.  \n- Proven experience with Python and Django framework.\n\n#### **Technical Skills:**  \n\n**Frontend Development:**  \n- Proficient in HTML5, CSS3, and JavaScript.  \n- Experience with frontend frameworks/libraries such as React.js or Angular.js.  \n- Knowledge of responsive design principles and mobile-first development.\n\n**Backend Development:**  \n- Strong proficiency in Python and Django.  \n- Experience in designing and implementing RESTful APIs.  \n- Familiarity with asynchronous programming in Python.\n\n**Database Management:**  \n- Experience with relational databases such as PostgreSQL or MySQL.  \n- Ability to design and manage database schemas.\n\n**Version Control:**  \n- Proficient with Git and version control practices.\n\n#### **Additional Skills:**  \n- Understanding of the entire web development process, including design, development, and deployment.  \n- Experience with containerization technologies such as Docker.  \n- Familiarity with cloud services (AWS, GCP, or Azure) is a plus.  \n- Knowledge of CI/CD pipelines and DevOps practices is a plus.  \n- Strong problem-solving skills and ability to troubleshoot issues efficiently.\n\n#### **Soft Skills:**  \n- Excellent communication and teamwork skills.  \n- Ability to work independently and as part of a team.  \n- Strong attention to detail and commitment to quality.  \n- Eagerness to learn new technologies and stay updated with industry trends.\n\n#### **Preferred Qualifications:**  \n- Experience with other backend frameworks (e.g., Flask, FastAPI) is a plus.  \n- Experience in Agile/Scrum development methodologies.  \n- Previous experience in a similar role in a fast-paced environment.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537085/hacktiv8/career/full-stack-engineer-8vmv447o4rk.png",
    "jobType": "Full-Time",
    "companyId": 11,
    "authorId": 10,
    "createdAt": "2024-08-13T08:18:06.216Z",
    "updatedAt": "2024-08-13T08:18:06.216Z"
  },
  {
    "title": "Engineering Staff",
    "description": "## Job Requirements:\n- Minimum 1 year of experience.\n- Positive attitude and pleasant personality.\n- Ability to join immediately.\n- Residing in Bali.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537086/hacktiv8/career/engineering-staff-1v1vm8e4qiy.jpg",
    "jobType": "Full-Time",
    "companyId": 78,
    "authorId": 4,
    "createdAt": "2024-08-13T08:18:07.068Z",
    "updatedAt": "2024-08-13T08:18:07.068Z"
  },
  {
    "title": "Software Engineer - Frontend",
    "description": "**Job Description**\n\n- Design, develop, and enhance software for robotic systems from the ground up.\n- Utilize research and development skills to create prototypes addressing complex challenges in scheduling, synchronization, machine vision, and machine control.\n- Analyze challenges and propose options along with realistic timelines for resolution.\n- Collaborate with a global team of software engineers as well as mechanical and electrical engineers to deliver timely solutions.\n- Prioritize customer satisfaction by providing exceptional support and user-friendly applications that simplify complex solutions.\n- Stay updated with new technologies in the field and adopt them as necessary.\n\n**Requirements**\n\n- A minimum of a Bachelor's Degree in Computer Science, Information Technology, Electronic Engineering, or equivalent professional software development experience.\n- At least 1 year of experience in software development, delivery, and post-implementation processes.\n- Strong experience in React; familiarity with additional JavaScript frameworks such as Angular 2+, Vue, Express, or Node.js is beneficial.\n- Knowledge of C# or other object-oriented programming languages is a plus.\n- Familiarity with programming best practices.\n- Commitment to writing clean, high-performance code.\n- No color vision deficiency.\n- Strong logical thinking and attention to detail.\n- Passion for creating exceptional solutions that impress both colleagues and clients.\n- A strong “Can Do” attitude.\n- Proactive, highly motivated team player who can multi-task and adjust priorities as needed.\n- Excellent communication skills in English, both verbal and written.\n- Applicants must be willing to work in Salatiga.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537087/hacktiv8/career/software-engineer-frontend-qwofut5d99.jpg",
    "jobType": "Full-Time",
    "companyId": 79,
    "authorId": 5,
    "createdAt": "2024-08-13T08:18:07.864Z",
    "updatedAt": "2024-08-13T08:18:07.864Z"
  },
  {
    "title": "Software Engineer - Backend",
    "description": "**Job Description:**\n- Design, develop, and improve robotic systems software from the ground up.\n- Utilize research and development skills to create prototypes that address challenging issues in areas such as scheduling, synchronization, machine vision, and machine control.\n- Analyze challenges and propose options and timelines for resolution.\n- Collaborate with a global team of software engineers and professionals from mechanical and electrical disciplines to devise timely solutions.\n- Provide exceptional support and intuitive applications to our customers, simplifying complex solutions.\n- Stay updated on new technologies in your field and adopt them as necessary.\n\n**Requirements:**\n- A Bachelor's Degree in Computer Science, Information Technology, Electronic Engineering, or equivalent professional software development experience is required.\n- At least 1 year of experience in software development, delivery, and post-implementation.\n- Proficiency in any Object-Oriented Programming language (C#, C++, Java, Python, etc.) is essential.\n- Strong candidates should have a solid understanding of Linux, embedded systems, and C++.\n- Fundamental knowledge in computer science areas such as object-oriented programming, model-driven development, and algorithms is crucial.\n- Familiarity with best practices in programming is preferred.\n- Commitment to producing high-quality, high-performance code is expected.\n- Strong logical thinking and attention to detail are necessary traits.\n- A passion for creating excellent solutions that impress colleagues and customers alike.\n- A 'Can Do' attitude is essential.\n- Candidates should be proactive, highly motivated, and possess strong teamwork abilities while demonstrating effective multi-tasking and re-prioritization skills as needed.\n- Proficiency in both oral and written English communication skills is required.\n- Applicants must be willing to work in Salatiga.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537088/hacktiv8/career/software-engineer-backend-53dgk655gyj.jpg",
    "jobType": "Full-Time",
    "companyId": 79,
    "authorId": 3,
    "createdAt": "2024-08-13T08:18:08.686Z",
    "updatedAt": "2024-08-13T08:18:08.686Z"
  },
  {
    "title": "Software Quality Assurance - Automation (Selenium Webdriver)",
    "description": "**Job Description**\n- Write, design, and execute automated tests by creating scripts that run testing functions automatically.\n- Maximize test coverage for the most critical features of the system.\n- Document automated processes thoroughly.\n- Collaborate with SQA Analysts and Software Developers to develop effective solutions.\n\n**Requirements**\n- Bachelor’s Degree in Computer Science, Software Development, or a related field.\n- Proficiency in C# or Java programming languages.\n- Experience in test automation using Selenium Webdriver.\n- Familiarity with testing strategies and test execution methodologies.\n- Excellent communication skills in English, both oral and written.\n- Willingness to work in Salatiga.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537088/hacktiv8/career/software-quality-assurance-automation-%28selenium-webdriver%29-12setl1az3cg.jpg",
    "jobType": "Full-Time",
    "companyId": 79,
    "authorId": 2,
    "createdAt": "2024-08-13T08:18:09.359Z",
    "updatedAt": "2024-08-13T08:18:09.359Z"
  },
  {
    "title": "Cyber Security Analyst Specialist",
    "description": "### Job Specification (Requirement)\n1. Pendidikan minimal D3/setara  \n2. Memiliki minimal sertifikasi bidang Infrastructure & Network Security profesional  \n3. Memiliki pengalaman kerja di bidang Network Security & Infrastructure minimal 1 tahun  \n\n### Job Description\n1. Menerapkan prinsip keamanan informasi untuk penggunaan jaringan internet dan infrastruktur.  \n2. Melakukan penerapan kontrol keamanan jaringan dan infrastruktur serta keamanan sistem server sesuai dengan kebijakan yang berlaku.  \n3. Memantau dan memelihara ketersediaan, kinerja, dan keamanan sistem jaringan dan infrastruktur.  \n4. Mengumpulkan data peralatan jaringan dengan teknologi yang sesuai.  \n5. Memonitor keamanan dan pengaturan akun pengguna dalam jaringan komputer/hardening, memonitor jaringan, memantau anomali, dan patching.  \n6. Mengatasi serangan pada jaringan serta anomali/kerusakan pada infrastruktur/perangkat Perusahaan dan klien.  \n7. Memelihara serta mengoptimalkan kinerja sistem jaringan dan infrastruktur.  \n8. Mengelola dan membuat laporan rutin atas log milik Perusahaan dan/atau klien.  \n9. Mengelola, mengintegrasikan, dan menerapkan peningkatan konfigurasi sistem, jaringan dan infrastruktur.  \n10. Melakukan kegiatan PoC (Proof of Concept) maupun penerapan sistem, jaringan dan infrastruktur pada pelaksanaan proyek.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537089/hacktiv8/career/cyber-security-analyst-specialist-btieviumg9r.jpg",
    "jobType": "Full-Time",
    "companyId": 45,
    "authorId": 8,
    "createdAt": "2024-08-13T08:18:09.977Z",
    "updatedAt": "2024-08-13T08:18:09.977Z"
  },
  {
    "title": "System Engineer",
    "description": "**Job Description:**\n- Responsible for the operational function of fiber optic networks (DWDM Technology).\n- Implementation responsibilities including maintenance, activation, provisioning, and troubleshooting.\n- Prepare operational reports on the performance and operation of optical networks and DWDM networks.\n- Conduct initial analyses of optical network performance and DWDM conditions.\n- Analyze and evaluate the overall work system.\n- Proficient in reading and understanding the DWDM network topology plan.\n- Familiarity with DC electrical systems.\n\n**Requirements:**\n- Bachelor's degree (S1) in Electrical Engineering, Telecommunications, or IT. \n- Strong understanding of network concepts and implementation.\n- Excellent communication skills.\n- CCNA Certification.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537090/hacktiv8/career/system-engineer-54zvphlit26.jpg",
    "jobType": "Full-Time",
    "companyId": 80,
    "authorId": 9,
    "createdAt": "2024-08-13T08:18:10.789Z",
    "updatedAt": "2024-08-13T08:18:10.789Z"
  },
  {
    "title": "IT Security",
    "description": "We are seeking a skilled professional for the following role:\n\n**Key Responsibilities and Requirements**:\n\n- Minimum of 1 year of relevant experience in the field.\n- Strong application logic testing skills to ensure the integrity of our systems.\n- Expertise in various hacking techniques, specifically in Mobile, API, Infrastructure, Web, and Cryptography.\n- **Top Priority**: Successfully pass the hacking machine lab test.\n- **Second Priority**: Familiarity with Cloud Infrastructure.\n- **Third Priority**: Possession of a Cyber Security certification.\n- Willingness to work from the office (WFO).",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537097/hacktiv8/career/it-security-3xc0xkwjw3h.png",
    "jobType": "Full-Time",
    "companyId": 81,
    "authorId": 7,
    "createdAt": "2024-08-13T08:18:18.470Z",
    "updatedAt": "2024-08-13T08:18:18.470Z"
  },
  {
    "title": "DevOps Engineer",
    "description": "### Job Title: DevOps Engineer\n\n#### Requirements:\n- Minimum Bachelor's degree in IT, Information Systems, Computer Science, Management Information Systems, or a related field.\n- A minimum of **3 years of experience** as a DevOps Engineer.\n- Expertise with **Red Hat OpenShift**, **Red Hat Ansible**, **Bash/Linux Scripting**, CI/CD pipelines using **Jenkins** for OCP/VM, **Docker**, **Podman**, and **Kubernetes**.\n- Strong understanding of **Windows Server** and **Linux Operating Systems**, including Virtual Machines (VM).\n- Proficient in **RDBMS** including **Oracle**, **SQL Server**, **MySQL**, and **PostgreSQL**.\n- Familiarity with version control systems such as **GIT** and **SVN**.\n- Basic understanding of **Continuous Integration** and **Continuous Delivery** practices.\n\n#### Responsibilities:\n- Set up and manage DevOps tools utilized in software development.\n- Prepare and establish development environments for software projects.\n- Plan, lead, and monitor both continuous integration and delivery processes.\n- Collect and analyze software build metrics to support ongoing maintenance activities.\n- Train software engineers in the effective use of configuration management tools and procedures.\n- Support multiple releases and baselines concurrently, troubleshooting issues raised by developers and configuration management analysts.\n- Maintain software configuration management tools to facilitate configuration identification, control, reporting, and delivery of all software in production.\n- Ensure that individual reporting obligations are met in a timely, accurate, and efficient manner.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537099/hacktiv8/career/devops-engineer-e1wzwt9y8ld.jpg",
    "jobType": "Full-Time",
    "companyId": 82,
    "authorId": 6,
    "createdAt": "2024-08-13T08:18:19.741Z",
    "updatedAt": "2024-08-13T08:18:19.741Z"
  },
  {
    "title": "Delphi Developer",
    "description": "### Job Title: Delphi Developer\n\n**Requirements:**  \n- Minimum S1 degree  \n- At least 2 years of experience as a Delphi Developer  \n\nJoin our dynamic team and contribute to exciting projects utilizing your Delphi expertise!",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537103/hacktiv8/career/delphi-developer-sv83lqkzryg.png",
    "jobType": "Project-Based",
    "companyId": 11,
    "authorId": 7,
    "createdAt": "2024-08-13T08:18:23.807Z",
    "updatedAt": "2024-08-13T08:18:23.807Z"
  },
  {
    "title": "Java Developer",
    "description": "### Job Title: Overseas Platform Operations Developer\n\n#### Key Responsibilities:\n1. **Platform Service Management:** Oversee operations and development for the overseas platform (Pay'sGift), excluding customer service functions.\n2. **Mobile Coupon Platform Enhancement:** Improve the mobile coupon issuance platform through API development and enhancements in internal processes, including issuance, dispatch, and cancellation.\n3. **API Integration:** Design and implement tasks related to issuing and sending coupons via APIs for overseas sales channels and partner brands.\n4. **Product Synchronization:** Develop integration tasks to synchronize products provided to sales channels using APIs from overseas brands.\n5. **Admin Page Development:** Create and enhance the admin page to improve user experience and efficiency.\n6. **Coupon Verification Development:** Develop and refine coupon verification pages and related functionalities.\n\n#### Qualifications:\n1. Proficient in Java asynchronous processing and Lambda.\n2. Strong understanding of Multi-Threading within the Vert.x asynchronous framework.\n3. Capable of developing solutions with an emphasis on database integrity and managing contention in asynchronous processes.\n4. Skilled in writing SQL queries and experienced with MyBatis.\n5. Eligible and willing to travel abroad without restrictions.\n\n#### Development Environment:\n- **Technologies:** Java, Vert.x, AWS EC2, Spring Boot, Spring, Oracle, jQuery, JavaScript.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537104/hacktiv8/career/java-developer-bnr57zk693.jpg",
    "jobType": "Full-Time",
    "companyId": 83,
    "authorId": 9,
    "createdAt": "2024-08-13T08:18:24.649Z",
    "updatedAt": "2024-08-13T08:18:24.649Z"
  },
  {
    "title": "L1 IT Security Engineer",
    "description": "We are seeking a diligent and detail-oriented L1 IT Security Engineer to join our team. In this role, you will be responsible for developing, implementing, and maintaining robust security measures for various operating systems, network devices, and databases within the Permata Data Center. You will closely collaborate with system owners to ensure that all security protocols are thoroughly tested and remain up-to-date.\n\n**Key Responsibilities:**\n- Prepare a draft standard hardening system for all types of operating systems (OS), network devices, and databases in the Permata Data Center.\n- Create command scripts and system hardening file programs according to the prepared standards.\n- Test the command scripts in conjunction with the system owners until they are fully applicable for implementation.\n- Update existing standard hardening documents to ensure they reflect current best practices.\n- Review and adjust command scripts in the Nessus application to align with the parameters in the standard hardening document.\n\n**Qualifications:**\n- Bachelor's degree in System Information Technology or a related field.\n- Strong knowledge of Security Orchestration, Automation, and Response (SOAR) services.\n- Experience in Security Operations Center (SOC) operations.\n- Proficiency with Splunk for security information and event management (SIEM).\n- Familiarity with system hardening and security script preparation.\n- Knowledge of various operating systems, network devices, and database hardening techniques.\n- Experience with security tools such as Nessus.\n- Excellent problem-solving and analytical skills.\n- Strong attention to detail and ability to work collaboratively with system owners and other stakeholders.\n- Effective communication and documentation skills.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537104/hacktiv8/career/l1-it-security-engineer-js9fy5v3nio.png",
    "jobType": "Full-Time",
    "companyId": 75,
    "authorId": 4,
    "createdAt": "2024-08-13T08:18:25.333Z",
    "updatedAt": "2024-08-13T08:18:25.333Z"
  },
  {
    "title": ".NET Developer",
    "description": "**Job Title: Experienced .NET Developer**  \nWe are currently seeking an experienced .NET Developer to join our Awesome Engineering Team. In this role, you will build, analyze, design, develop, and maintain software solutions for our clients. You will collaborate within an agile, cross-functional, and multinational team, contributing to every phase of the Software Development Life Cycle.  \n\n**The Role**  \nIn this role, you will:  \n- Build high-quality software that complies with coding standards and meets tailored feature specifications.  \n- Write clean, testable code using .NET/C# programming languages.  \n- Analyze system requirements and prioritize tasks.  \n- Collaborate with our QA team when testing bugs to ensure smooth, fully operational software.  \n- Partner with DevOps Engineers to deploy fully functional applications.  \n- Review and/or refactor code while upgrading existing programs.  \n- (Senior) Guide and support junior members of the team.  \n- Contribute to internal or external learning activities.  \n\n**Technical Requirements:**  \n- More than 3 years of experience as a .NET developer using C#, ASP.NET, ASP.NET Core, .NET Framework, Web Forms, and MVC.  \n- Proficient in SQL and NoSQL database technologies.  \n- Experience with Web Technologies (ReactJS/AngularJS/Vue.js).  \n- Understanding of Agile methodologies.  \n- Familiarity with Source Control Management (Git/SVN).  \n- Comprehensive understanding of Object-Oriented Programming concepts.  \n- In-depth knowledge of the Software Development Life Cycle.  \n- Fluent in English, both written and oral.  \n- Strong communication skills.  \n\n**Considered Advantageous:**  \n- Extensive experience or interest in code refactoring or software design patterns.  \n- Broad knowledge of the Software Development Process.  \n- Experience with Agile Development Methodologies.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537105/hacktiv8/career/.net-developer-fo8vba5cd6q.png",
    "jobType": "Full-Time",
    "companyId": 84,
    "authorId": 6,
    "createdAt": "2024-08-13T08:18:26.059Z",
    "updatedAt": "2024-08-13T08:18:26.059Z"
  },
  {
    "title": "Senior Java Developer",
    "description": "### Job Description: \n\n**Job Responsibilities:**  \n- Develop components, back-end services, and microservices using established frameworks and standards.  \n- Create test automation scenarios to enhance testing efficiency.  \n- Collaborate with front-end development teams to ensure seamless integration and execution.  \n- Execute test automation and regression testing to maintain quality standards.  \n- Deploy services to testing and staging environments as part of the development cycle.  \n- Create and maintain comprehensive API documentation for all services.  \n- Provide support for bug fixing and issue resolution.  \n- Assist in daily operations to meet service level agreements of the digital platform.  \n\n**Job Requirements:**  \n- Bachelor's Degree in Computer Science, Software Engineering, or a related field.  \n- Minimum of 5 years of experience in a similar role.  \n- Proficient in middleware and microservices development using Java (Spring and Microservices).  \n- Familiarity with technologies such as Java, Spring Boot, MVC, Node.js, SOA, API Management, Web services, JSON, SOAP, JavaScript, CSS, Containerization, and Agile/Scrum methodologies.  \n- Strong understanding of both relational (MySQL, Oracle) and non-relational (Redis, MongoDB) databases.  \n- Knowledge of version control and build tools including GitHub, Subversion, Maven, Nexus, Sonarqube, Jenkins, and experience with Platform-as-a-Service and the 12 Factors App methodology.  \n- Experience with middleware and API management software is a plus.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537106/hacktiv8/career/senior-java-developer-f594x3qmw0c.jpg",
    "jobType": "Full-Time",
    "companyId": 82,
    "authorId": 4,
    "createdAt": "2024-08-13T08:18:26.685Z",
    "updatedAt": "2024-08-13T08:18:26.685Z"
  },
  {
    "title": "Software Project Manager",
    "description": "**Kami mencari kandidat terbaik untuk mengisi posisi yang dibutuhkan oleh tim dengan tanggung jawab:**\n- Memimpin pembuatan aplikasi mulai dari desain, pengembangan, koding, testing, hingga debugging\n- Memberikan arahan dan memastikan tim mematuhi standar pengembangan\n- Mengelola semua aktivitas tim developer dan menetapkan target untuk setiap anggota tim agar sesuai lingkup projek dan selesai tepat waktu\n- Mengukur kinerja proyek menggunakan sistem, alat, dan teknik yang tepat\n- Menghasilkan dan menyajikan laporan kemajuan proyek\n\n**Kualifikasi**\n- Pendidikan minimal S1 jurusan IT\n- Memiliki pengalaman minimal 1 tahun sebagai Project Manager\n- 3 tahun pengalaman pengembangan perangkat lunak \n- Memiliki kemampuan manajemen proyek pengembangan aplikasi yang baik \n- Mampu berpikir kritis dan kemampuan problem solving yang baik\n- Lokasi Kerja di Kelapa Gading, Jakarta Utara",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537106/hacktiv8/career/software-project-manager-ruihjyvhf9.png",
    "jobType": "Full-Time",
    "companyId": 14,
    "authorId": 7,
    "createdAt": "2024-08-13T08:18:27.419Z",
    "updatedAt": "2024-08-13T08:18:27.419Z"
  },
  {
    "title": "IOS Developer",
    "description": "**Job Purpose**: \nTo scope, design, and deliver pixel-perfect mobile applications based on wireframes and design requirements, collaborating with backend developers to create comprehensive digital solutions that fulfill the customer’s business needs.\n\n**Responsibilities**: \n- Architect and implement web/mobile UI/UX based on provided wireframes and business requirements.\n- Gather, document, and analyze business requirements to define the scope of software development initiatives, including mobile mock-ups and interaction prototyping.\n- Produce and maintain technical documentation related to front-end modules (e.g., scope requirements, logical and technical designs, testing and implementation plans).\n- Troubleshoot and implement bug fixes for client and user-reported issues.\n- Play a proactive support role, taking ownership of technical issues and collaborating with internal, cross-functional, and external teams to resolve advanced issues as necessary.\n- Collaborate with team members in all aspects of software design, coding, testing, documentation, and deployment.\n- Deliver results using an agile scrum approach.\n\n**Qualifications**: \n1. Bachelor’s Degree in IT or Computer Science-related fields with a minimum GPA of 3.0 (on a scale of 4.0).\n2. Minimum 3 years of experience as an iOS (Swift / Objective-C) Developer.\n3. Experience in mobile application development frameworks (React Native) & environment.\n4. Experience in developing enterprise applications.\n5. Proficiency with the latest programming structures and versions.\n6. Familiarity with layout design, information hierarchy, organization, and UI/UX design.\n7. Proficient understanding of code versioning tools (Git).\n8. Familiarity with JIRA or other project tracking software.\n9. Ability to manage multiple competing priorities under pressure.\n10. Willingness to work occasional overtime and maintain a flexible schedule as needed to meet objectives and deadlines.\n11. Ability to work independently, as well as part of a team.\n12. Strong written and verbal communication skills.\n13. Proficient in English.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537107/hacktiv8/career/ios-developer-7q7lzo4ch3r.jpg",
    "jobType": "Full-Time",
    "companyId": 85,
    "authorId": 1,
    "createdAt": "2024-08-13T08:18:28.318Z",
    "updatedAt": "2024-08-13T08:18:28.318Z"
  },
  {
    "title": "Mobile Developer",
    "description": "## Software Engineer\n\n### Job Descriptions\n\n1. Mengidentifikasi kebutuhan dan solusi perangkat lunak dari konsultasi tim marketing.\n2. Menulis kode perangkat lunak yang dirancang dengan baik dan dapat diuji.\n3. Menghasilkan perangkat lunak sesuai spesifikasi dan menentukan kelayakan operasional.\n4. Mendokumentasikan dan memelihara fungsionalitas perangkat lunak.\n5. Melakukan uji verifikasi perangkat lunak dan prosedur jaminan kualitas.\n6. Mengatasi, men-debug, dan meningkatkan sistem yang sudah ada.\n7. Memastikan perangkat lunak diperbarui dengan fitur terbaru.\n\n### Job Requirements\n\n1. Pengalaman minimal 1 tahun.\n2. Menguasai bahasa pemrograman **Flutter**.\n3. Jujur dan bertanggung jawab.\n4. Bisa bekerja dalam tim.\n5. Memiliki skill komunikasi yang baik.\n6. Menguasai Version Control (GITHUB, GITLAB, SVN).\n7. Bersedia ditempatkan di seluruh kantor cabang dan pusat*.\n\n*NB: Tanda *) tidak wajib.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537108/hacktiv8/career/mobile-developer-1fixpo30qyz.png",
    "jobType": "Full-Time",
    "companyId": 86,
    "authorId": 4,
    "createdAt": "2024-08-13T08:18:28.910Z",
    "updatedAt": "2024-08-13T08:18:28.910Z"
  },
  {
    "title": "Odoo Developer",
    "description": "We are seeking a skilled Odoo Specialist to join our team. The primary responsibilities include:\n\n1. Overseeing the implementation of existing Odoo modules and assisting users in transitioning to Odoo across our office branches.\n2. Designing and developing enhancements and customizations on Odoo modules based on user feedback and requirements.\n3. Analyzing, diagnosing, and resolving errors or bugs in the system.\n4. Integrating multiple data sources, databases, and middleware into the company's Odoo system.\n5. Actively proposing and implementing solutions to improve and streamline overall workflow processes.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537109/hacktiv8/career/odoo-developer-21p8yy1h74y.png",
    "jobType": "Full-Time",
    "companyId": 87,
    "authorId": 9,
    "createdAt": "2024-08-13T08:18:29.736Z",
    "updatedAt": "2024-08-13T08:18:29.736Z"
  },
  {
    "title": "Senior Android Developer",
    "description": "**Job Title: Android Developer**\n\n**Responsibilities:**\n- Design and develop Android-based applications using Java and/or Kotlin.\n- Analyze and optimize app performance to ensure a fast and smooth user experience.\n- Ensure quality and compatibility with the existing codebase.\n- Stay up-to-date with the latest Android technologies and trends.\n\n**Qualifications:**\n- Bachelor’s Degree in Information Technology or a related field from a reputable university with a GPA greater than 3.00.\n- A minimum of 3 years of full-time, production-level mobile development experience in Android using Java/Kotlin.\n- Experience in Flutter for cross-platform applications is a plus.\n- Working knowledge of at least one of the following: SQL or MySQL.\n- Excellent problem-solving skills and strong analytical capabilities.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537110/hacktiv8/career/senior-android-developer-qu0hlfanc7.png",
    "jobType": "Full-Time",
    "companyId": 88,
    "authorId": 1,
    "createdAt": "2024-08-13T08:18:30.452Z",
    "updatedAt": "2024-08-13T08:18:30.452Z"
  },
  {
    "title": "Full Stack Programmer",
    "description": "**Bantu kami mencari tim yang hebat!**\n\nWe need people who, when they hear \"it can't be done\", then they FIGURE OUT how to do it anyway.\n\nKami membutuhkan kandidat yang mampu untuk mengembangkan Front-End Website architecture & Back-End Website Application. Tugas utama kamu adalah merancang User Interaction pada Web Pages. Selain itu, kamu akan membuat server dan database untuk fungsionalitas perusahaan, serta memastikan optimasi lintas platform untuk mobile phone dan daya tanggap (responsiveness) dari aplikasi. \n\nKerjasama dengan Graphic Designer untuk fitur desain website merupakan salah satu tanggung jawab kamu. Kamu juga akan melakukan desain dan mengembangkan API, serta terus mengikuti perkembangan pada aplikasi website dan bahasa pemrograman.\n\n**Kalau kamu memiliki kualifikasi dibawah ini:**\n\n1. Memiliki gelar minimal D3 atau sarjana dari jurusan Ilmu Komputer.\n2. Pengalaman minimal 2 tahun di posisi yang sama.\n3. Memiliki kemampuan organisasi yang baik dan manajemen proyek yang efisien.\n4. Kecakapan dengan bahasa Front-End dasar seperti HTML, CSS, dan JavaScript.\n5. Terbiasa dengan JavaScript Library React (TypeScript).\n6. Mahir dalam bahasa Server-side seperti Express, Node, dan PHP.\n7. Mengoperasikan teknologi database seperti MySQL, MongoDB, PostgreSQL, dan Rest APIs.\n8. Terbiasa dengan teknologi database dalam memori seperti Redis.\n9. Kemampuan komunikasi verbal dan non-verbal yang luar biasa.\n10. Problem solving yang baik dan perhatian pada detail.\n\n**Benefit yang akan kamu dapatkan:**\n\n1. Jenjang karir yang tidak berlandaskan senioritas; performa terbaik akan diakui.\n2. Makan siang disediakan di kantor.\n3. Bonus tahunan.\n4. Gaji & tunjangan akan diupgrade berdasarkan performa.\n\n**Waktu kerjanya:**\nSenin (07.45 - 16.45 WIB), Selasa - Jumat (08.30 - 17.30 WIB)",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537116/hacktiv8/career/full-stack-programmer-g56vhobilul.jpg",
    "jobType": "Full-Time",
    "companyId": 89,
    "authorId": 5,
    "createdAt": "2024-08-13T08:18:36.499Z",
    "updatedAt": "2024-08-13T08:18:36.499Z"
  },
  {
    "title": "Application Developer (.NET) Jakarta/Malang",
    "description": "**Job Descriptions:**\n- Developing and implementing web applications\n- Optimizing web applications\n- Writing clean, testable, and maintainable code\n- Performing unit and integration testing before launch\n- Conducting functional and non-functional testing\n\n**Requirements:**\n- Bachelor’s Degree in Computer Science / Information Systems with GPA > 3.00\n- Experience with ASP.NET, C# .NET, and SQL Server preferred\n- In-depth knowledge of programming across diverse operating systems and platforms using development tools\n- Excellent understanding of software design and programming principles\n- Strong passion for the IT industry\n- Understanding of OOP concepts preferred\n- A team player with excellent communication skills\n- Self-motivated with a positive attitude\n- Curiosity to explore and learn new technologies\n- Fresh graduates and high school graduates are encouraged to apply.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537117/hacktiv8/career/application-developer-%28.net%29-jakartamalang-snddp3fk6a9.png",
    "jobType": "Full-Time",
    "companyId": 90,
    "authorId": 9,
    "createdAt": "2024-08-13T08:18:38.200Z",
    "updatedAt": "2024-08-13T08:18:38.200Z"
  },
  {
    "title": "Java Software Engineer",
    "description": "**DUTIES AND RESPONSIBILITIES:**\n\n- Implement computer software systems using Java code, adhering to the software requirements specification established by the Development Department Manager or direct supervisor. This includes:  \n  ◦ *Researching the technology used for implementation*  \n  ◦ *Analyzing specifications for implementation*  \n  ◦ *Estimating production time for implementation*  \n  ◦ *Designing the code implementation*  \n  ◦ *Writing unit tests for the implementation*  \n  ◦ *Writing the (Java) code following 1rstWAP's coding guidelines*  \n  ◦ *Maintaining proper documentation of the code*  \n- Set up and maintain system (code) performance tests and execute code refactoring for existing code.  \n- Perform thorough code reviews of other programmers.  \n- Test implementations in a local environment, checking logs and the user interface for flaws.  \n- Participate in internal meetings, workshops, and presentations as needed.  \n- Engage in meetings with partners and clients when necessary.  \n- Ensure workplace integrity (no downloads, private code, or data, etc.).  \n- Provide training to department personnel and others on IT development issues related to your development scope and/or technical skills.  \n- Offer technical support for installations performed at the client’s site if necessary.  \n- Utilize our project management tool to report progress.  \n- Identify, analyze, and resolve reported bugs in our systems.  \n\n**Job Requirements:**\n\n- Bachelor’s degree in Computer Science or a related IT discipline.  \n- A minimum of 2 years of experience in this sector (fresh graduates may occasionally be welcomed!).  \n- Strong application development programming knowledge in Java (8).  \n- Familiarity with application servers such as JBoss and Tomcat.  \n- Experience with frameworks like Hibernate and Spring (Boot).  \n- Proficient in working within a Linux environment.  \n- Experience with Git.  \n- Strong knowledge of MySQL.  \n- Experience with RESTful programming.  \n- Experienced in writing unit tests using TestNG.  \n- Familiarity with IDEs such as NetBeans, IntelliJ, or Eclipse.  \n- Preferred: Experience with Redmine.  \n- Preferred: Experience with Docker.  \n- Ability to communicate effectively in English, both orally and in writing.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537125/hacktiv8/career/java-software-engineer-4gpstrhqnxr.jpg",
    "jobType": "Full-Time",
    "companyId": 91,
    "authorId": 8,
    "createdAt": "2024-08-13T08:18:45.816Z",
    "updatedAt": "2024-08-13T08:18:45.816Z"
  },
  {
    "title": "Programer Java",
    "description": "**Job Description:** We are seeking a talented individual to create, design, and develop Java-based applications.  \n\n**Qualifications:**  \n- Bachelor’s degree in Computer Science, Electrical Engineering, Information Technology, Physics, or Mathematics.  \n- Strong knowledge and skills in Java development, with expertise in at least two of the following: J2EE, J2SE, J2ME, Spring Framework, and Object-Oriented Programming.  \n- Experience with microservices, Kafka, Containers, JMS, EJB, JDBC, or any other leading market technologies.  \n- A hard worker and team player who thrives in a fast-paced environment.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537126/hacktiv8/career/programer-java-klj1vv3qv4l.png",
    "jobType": "Full-Time",
    "companyId": 92,
    "authorId": 2,
    "createdAt": "2024-08-13T08:18:46.646Z",
    "updatedAt": "2024-08-13T08:18:46.646Z"
  },
  {
    "title": "Programmer Go Lang",
    "description": "### Lowongan Kerja\n**DIBUKA HANYA UNTUK YANG MAMPU BERADAPTASI DENGAN JAMAN, DAN SIAP MEMBUAT KARYA PASSIVE INCOME DALAM HIDUP.**\n\n#### Persyaratan:\n1. **Keterampilan Pemrograman Go Lang yang Kuat:**\n   - Memiliki pemahaman mendalam tentang bahasa pemrograman Go Lang serta pengalaman solid dalam pengembangan perangkat lunak dengan Go.\n\n2. **Pemahaman yang Kuat tentang Konsep Pemrograman:**\n   - Memahami konsep dasar pemrograman seperti struktur data, algoritma, dan paradigma pemrograman untuk merancang solusi yang efisien.\n\n3. **Pengalaman dalam Pengembangan Perangkat Lunak:**\n   - Memiliki pengalaman yang relevan dalam mengembangkan perangkat lunak end-to-end, baik dalam proyek pribadi maupun profesional.\n\n4. **Kemampuan Analitis yang Baik:**\n   - Mampu menganalisis masalah kompleks, merancang solusi yang efisien, dan mengambil keputusan berdasarkan data.\n\n5. **Komunikasi dan Kolaborasi yang Efektif:**\n   - Kemampuan untuk berkomunikasi dengan jelas serta bekerja dalam tim untuk mencapai tujuan bersama.\n\n6. **Pendidikan dan Sertifikasi yang Relevan:**\n   - Gelar sarjana atau diploma dalam Ilmu Komputer, Teknik Perangkat Lunak, atau bidang terkait. Sertifikasi atau pelatihan dalam Go Lang akan menjadi nilai tambah.\n\n7. **Pemahaman Mendalam tentang PostgreSQL:**\n   - Memiliki pengetahuan kuat tentang konsep, fitur, dan operasi penting dalam database PostgreSQL.\n\n8. **Pengalaman dalam Pengelolaan Database:**\n   - Pengalaman praktis dalam merancang, mengimplementasikan, dan mengelola database PostgreSQL untuk aplikasi bisnis yang kompleks.\n\n9. **Kemampuan SQL yang Kuat:**\n   - Keahlian dalam menulis query SQL kompleks, membuat tata letak, dan mengoptimalkan kinerja query untuk database PostgreSQL.\n\n10. **Pemahaman tentang Model Data dan Desain Database:**\n    - Pemahaman baik tentang model data dan desain database yang efisien berdasarkan kebutuhan aplikasi.\n\n11. **Keahlian dalam Tuning dan Optimisasi Database:**\n    - Kemampuan untuk melakukan tuning kinerja, optimisasi query, mengelola indeks, dan mengoptimalkan parameter konfigurasi database PostgreSQL.\n\n#### Tanggung Jawab:\n1. **Pengembangan Aplikasi dengan Go Lang:**\n   - Merancang, mengembangkan, dan memelihara aplikasi menggunakan bahasa pemrograman Go Lang.\n\n2. **Implementasi dan Integrasi API:**\n   - Integrasi aplikasi dengan API eksternal dan layanan pihak ketiga menggunakan Go Lang.\n\n3. **Optimisasi Kode dan Performa:**\n   - Memastikan kode yang ditulis efisien, mudah dipelihara, dan dioptimalkan untuk performa tinggi.\n\n4. **Tingkatkan Keamanan Aplikasi:**\n   - Mengimplementasikan praktik keamanan terbaik untuk melindungi aplikasi dari potensi serangan cyber.\n\n5. **Kolaborasi dengan Tim:**\n   - Bekerja sama dengan tim pengembang, desainer, dan pemangku kepentingan untuk menghasilkan solusi perangkat lunak yang berkualitas.\n\n6. **Menerapkan Standar Kualitas dan Best Practices:**\n   - Mematuhi standar pengodean, melakukan pengujian yang tepat, dokumentasi, dan mengikuti praktik pengembangan perangkat lunak terbaik.\n\n7. **Pembaruan Teknologi Terkini:**\n   - Tetap terkini dengan perkembangan terbaru dalam teknologi Go Lang dan memperbarui keterampilan sesuai kebutuhan proyek.\n\n8. **Pengelolaan Database PostgreSQL:**\n   - Merancang, mengelola, dan melakukan pemeliharaan database PostgreSQL untuk memastikan keandalan, kinerja, dan keamanan database.\n\n9. **Tuning Kinerja:**\n   - Melakukan tuning kinerja database dan query untuk memastikan kinerja optimal dan respon cepat dari sistem.\n\n10. **Keamanan Database:**\n    - Mengelola tingkat akses, mengatur kebijakan keamanan, dan melindungi data sensitif dalam database dari ancaman keamanan.\n\n11. **Pemulihan Bencana:**\n    - Mengembangkan dan mengimplementasikan strategi pemulihan bencana dan strategi backup yang tepat untuk memastikan kelangsungan bisnis dalam kejadian darurat.\n\n12. **Migrasi dan Upgrade:**\n    - Merencanakan dan melaksanakan proses migrasi data serta upgrade database PostgreSQL ke versi terbaru sesuai dengan standar yang berlaku.\n\n13. **Pemeliharaan dan Monitoring:**\n    - Mengawasi kesehatan database, memantau kinerja, dan melakukan pemeliharaan rutin untuk memastikan operasi database yang lancar.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537126/hacktiv8/career/programmer-go-lang-dajhnuqbmzp.jpg",
    "jobType": "Full-Time",
    "companyId": 93,
    "authorId": 2,
    "createdAt": "2024-08-13T08:18:47.358Z",
    "updatedAt": "2024-08-13T08:18:47.358Z"
  },
  {
    "title": "Java Developer (Springboot)",
    "description": "### Job Description\n\nWe are seeking a highly-skilled **Java Developer** to join our dynamic team. The ideal candidate will be responsible for developing high-quality software solutions and will have the following qualifications:\n\n- **Educational Background**: Bachelor's degree or higher in Computer Science, Information Technology, or a related field.\n- **Professional Experience**: A minimum of 3 years of hands-on experience in Java development, specifically with Spring Boot.\n- **Technical Skills**: Strong proficiency in object-oriented programming principles, design patterns, and software engineering best practices.\n- **API Development**: Proven experience in developing RESTful APIs and microservices leveraging Spring Boot and Spring Framework.\n- **Agile Methodologies**: Familiarity with Agile methodologies and tools such as Scrum, JIRA, and Git. Knowledge of Quarkus Framework and SQL will be an advantage.\n\nJoin us to contribute to innovative projects and enhance our software solutions!",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537127/hacktiv8/career/java-developer-%28springboot%29-zamrk7uy85g.png",
    "jobType": "Full-Time",
    "companyId": 94,
    "authorId": 9,
    "createdAt": "2024-08-13T08:18:48.269Z",
    "updatedAt": "2024-08-13T08:18:48.269Z"
  },
  {
    "title": "Java Backend Developer (Financial Service)",
    "description": "### Job Title: Software Developer/Engineer\n\n#### Job Description:\nWe are seeking an experienced Software Developer/Engineer to join our dynamic team. The ideal candidate will possess a strong foundation in software development with a proven track record of delivering high-quality solutions.\n\n#### Responsibilities:\n- Develop and maintain software applications in accordance with client requirements.\n- Collaborate with cross-functional teams to define and design new features.\n- Write clean, efficient, and maintainable code.\n- Troubleshoot, debug, and optimize existing applications.\n\n#### Qualifications:\n- Minimum 2 years of experience in a Software Developer/Engineer or similar role.\n\n#### Mandatory Skills:\n- Solid experience in Java Spring Boot.\n- Proficiency in Rest API development.\n- Strong knowledge of SQL Server.\n- Experience with PostgreSQL/MySQL.\n\n#### Additional Skills (Preferred):\n- Familiarity with Linux server (basic commands).\n- Experience with Google Kubernetes.\n- Knowledge of Docker and Jenkins.\n- Proficient in Git version control.\n- Understanding of IBM BPM.\n\nIf you are passionate about technology and eager to contribute to innovative projects, we would love to hear from you!",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537128/hacktiv8/career/java-backend-developer-%28financial-service%29-yy2b0qoxrt.png",
    "jobType": "Full-Time",
    "companyId": 95,
    "authorId": 5,
    "createdAt": "2024-08-13T08:18:49.089Z",
    "updatedAt": "2024-08-13T08:18:49.089Z"
  },
  {
    "title": "Senior IT Developer",
    "description": "**Deskripsi Pekerjaan:**\n- Membuat, membangun, dan mengembangkan program baik pada aplikasi maupun web yang sesuai dengan kebutuhan perusahaan.\n- Mengatur dan menjamin keamanan web.\n- Membuat laporan analisis dan statistik server.\n- Melakukan analisis kebutuhan pengguna sehingga perangkat yang dihasilkan sesuai dengan target user yang ditentukan.\n- Melakukan perbaikan pada kesalahan yang terjadi pada sistem/aplikasi.\n- Melakukan dokumentasi pada penyusunan program yang sedang dikerjakan atau diperbaiki sehingga bisa dilakukan tracking dengan mudah saat ditemukan kesalahan.\n- Bekerja sama dengan tim internal maupun eksternal untuk melakukan analisis kesalahan pada software yang sedang atau akan dikerjakan.\n- Melakukan maintenance sistem yang disinyalir terdapat kesalahan.\n- Melakukan pengembangan lanjutan pada sistem perangkat lunak yang akan dilakukan tindak lanjut atau updating serta developing.\n- Melakukan uji coba software yang sudah diselesaikan oleh tim untuk kemudian dianalisis lebih lanjut guna mencari kesalahannya sehingga hasil yang benar-benar aman.\n- Melakukan adaptasi hardware untuk menunjang sistem yang sedang dibangun.\n\n**Kualifikasi:**\n- Berpengalaman min 3 tahun di bidang retail.\n- Memiliki kemampuan end to end troubleshooting dan debugging.\n- Mampu bekerja di bawah tekanan.\n- Terbiasa membuat web dan aplikasi lainnya.\n- Terbiasa dengan sistem POS dan Inventory Warehouse.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537129/hacktiv8/career/senior-it-developer-dxmzqhcvgrm.jpg",
    "jobType": "Full-Time",
    "companyId": 96,
    "authorId": 1,
    "createdAt": "2024-08-13T08:18:49.817Z",
    "updatedAt": "2024-08-13T08:18:49.817Z"
  },
  {
    "title": "Developer iOS",
    "description": "**Programming Language:** Java, Kotlin, Swift, Objective-C, **Mobile Development.**  \n\n**Framework:** ReactNative, **Performance Optimization, Mobile Application Architecture.**  \n\n**Tanggung Jawab:**  \n1. Mengembangkan dan memelihara aplikasi mobile iOS untuk platform penjualan mobil bekas, dengan fokus pada performa, keamanan, dan kualitas pengalaman pengguna.  \n2. Berkolaborasi dengan tim pengembangan untuk merancang, menguji, dan mengimplementasikan fitur-fitur baru dalam aplikasi, serta melakukan perbaikan dan pembaruan sesuai kebutuhan.  \n3. Memastikan aplikasi iOS selalu terintegrasi dengan baik dengan backend dan database perusahaan, serta memastikan fungsionalitas yang konsisten dan lancar.  \n4. Memantau dan menganalisis performa aplikasi iOS, serta melakukan debugging dan perbaikan masalah yang mungkin muncul guna meningkatkan kinerja aplikasi secara keseluruhan.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537130/hacktiv8/career/developer-ios-hz3hghpkddr.jpg",
    "jobType": "Full-Time",
    "companyId": 97,
    "authorId": 6,
    "createdAt": "2024-08-13T08:18:50.628Z",
    "updatedAt": "2024-08-13T08:18:50.628Z"
  },
  {
    "title": "IT Developer (Mandarin Speaker)",
    "description": "**Bilingual English and Mandarin Developer**  \nWe are seeking a talented bilingual developer fluent in both English and Mandarin to join our dynamic team. As a key member of our development team, you will play a crucial role in enhancing and maintaining our software applications, ensuring they meet the highest standards of quality and performance.  \n\n**Job Responsibilities**  \n- Develop and enhance software applications through coding and testing.  \n- Participate in code reviews and training sessions.  \n- Deliver high-quality software by creating unit test plans and thoroughly testing code.  \n- Utilize tools, applications, and processes relevant to software development effectively.  \n- Implement solutions as described in technical documentation and adhere to coding standards.  \n- Create project documentation and coordinate resolutions for technical issues.  \n- Report to a senior developer on project progress and challenges.  \n- Understand business rules, software specifications, and designs provided by the technical lead to complete assigned tasks.  \n\n**Requirements:**  \n- A Bachelor’s degree in Computer Science, Information Technology, or Engineering (Computer/Telecommunications) is required.  \n- At least 2 years of extensive experience in object-oriented programming, specifically in JAVA/J2EE.  \n- Knowledge or relevant work experience in programming languages or technologies: Java/J2EE.  \n- Proficiency in object-oriented programming concepts.  \n- Excellent team player with the ability to operate across different cultures.  \n- Ability to quickly learn new concepts and work under pressure.  \n- Bilingual proficiency in Mandarin and English is a must.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537130/hacktiv8/career/it-developer-%28mandarin-speaker%29-v7gc4vaf2l.jpg",
    "jobType": "Full-Time",
    "companyId": 98,
    "authorId": 6,
    "createdAt": "2024-08-13T08:18:51.455Z",
    "updatedAt": "2024-08-13T08:18:51.455Z"
  },
  {
    "title": "Junior Lead Architect Blockchain Development",
    "description": "**Responsibilities**  \nWe are looking for a talented and motivated Junior Lead Architect to join our team and play a crucial role in building blockchain solutions using the Proof of Authority (PoA) consensus algorithm on AWS EC2. The ideal candidate will have strong expertise in SQL databases, Python programming, and developing Ethereum decentralized applications (DApps) with Solidity and Metamask wallet integration. Additionally, knowledge of cloud computing, networking, and security is essential.  \nResponsibilities are assigned on a project or staging basis (Non day-to-day business activities):  \n- **Blockchain Architecture and Development**  \n  - Design, develop, and deploy blockchain solutions using the PoA consensus algorithm.  \n  - Architect secure and efficient smart contracts on the Ethereum blockchain using Solidity.  \n  - Ensure robust and scalable blockchain architecture.  \n- **DApp Development**  \n  - Lead the development and maintenance of Ethereum-based decentralized applications (DApps).  \n  - Integrate user interfaces with blockchain backends using web3.js or similar libraries.  \n  - Ensure secure interactions between DApps and Metamask wallets.  \n- **SQL Database Management**  \n  - Design, implement, and manage SQL databases to support blockchain applications.  \n  - Develop and optimize SQL queries for efficient data retrieval and manipulation.  \n  - Maintain the integrity, security, and scalability of SQL databases.  \n- **Python Programming**  \n  - Develop backend services and scripts in Python to support blockchain and database operations.  \n  - Work on data processing and automation tasks using Python.  \n  - Integrate Python applications with blockchain networks and SQL databases.  \n- **AWS and Cloud Computing**  \n  - Deploy and manage blockchain applications on AWS EC2 instances.  \n  - Utilize AWS services for networking, storage, and security to support blockchain solutions.  \n  - Ensure high availability, scalability, and security of cloud-based systems.  \n- **Networking and Security**  \n  - Implement networking configurations to support distributed blockchain applications.  \n  - Apply security best practices to protect blockchain applications and cloud infrastructure.  \n  - Conduct regular security audits, vulnerability assessments, and ensure compliance with industry standards.  \n- **Leadership and Collaboration**  \n  - Provide guidance and support as needed.  \n  - Collaborate with cross-functional teams including frontend developers, UX/UI designers, and project managers.  \n  - Contribute to project planning, timeline management, and documentation.  \n  \n**Requirements**  \n- Degree in Computer Science/Information Technology or equivalent, with at least 3-5 years of relevant IT experience preferred.  \n- Certifications in blockchain technology, cloud computing, or cybersecurity.  \n- Internship or project experience in blockchain development.  \n- Contributions to open-source blockchain projects.  \n- Experience with stakeholders, vendors, end-users, and project management.  \n- Understanding of Software Development Lifecycle (SDLC) and experience through full project lifecycles.  \n- Excellent written and verbal communication skills and strong interpersonal skills.  \n- Independent, self-motivated, highly organized, and detail-oriented.  \n- Ability to multi-task and oversee multiple projects simultaneously.  \n- Flexible team player capable of working with minimal supervision.  \n- Strong analytical and problem-solving skills, with the ability to troubleshoot and diagnose technical issues.  \n- Familiarity with Object-oriented Programming (OOP) languages such as SQL, Java, C++, C#, Python, R, PHP, .NET, JavaScript, etc.  \n- Knowledge of AWS Infrastructure, CMS platforms (WordPress), Cloud Hosting, Microsoft Office 365 stack, and Backup & Disaster Recovery Methodology Framework.  \n- Familiarity with VLAN, DHCP, DNS, Routing, and Networking topology.  \n- Experience with monitoring applications through Security and Performance System Tools.  \n- Proven experience in providing functional application support, focusing on efficient issue resolution.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537131/hacktiv8/career/junior-lead-architect-blockchain-development-dbzotbpwz05.jpg",
    "jobType": "Full-Time",
    "companyId": 99,
    "authorId": 1,
    "createdAt": "2024-08-13T08:18:52.370Z",
    "updatedAt": "2024-08-13T08:18:52.370Z"
  },
  {
    "title": "Engineer",
    "description": "**Job Title:** Field Service Engineer\n\n**Requirements:**\n- Understanding of PLC systems.\n- Knowledge of communication signals and NO/NC wiring.\n- Familiarity with production systems, both upstream and downstream.\n- Experience with mechanical packaging machines.\n- In-depth understanding of vertical packaging machines.\n- Ability to read and comprehend wiring diagrams.\n- Proficient troubleshooting skills and knowledge.\n- Basic software skills and adeptness with tools and measuring instruments.\n- Willingness to travel abroad or to other cities for business trips.\n\n**Qualification:**\n- Male, maximum age of 35 years.\n- Graduated with a degree in mechanical, electrical engineering, or civil (minimum diploma).\n- Fresh graduates are welcomed.\n- Minimum of 2 years experience in a related field is an advantage.\n- Experience in a Japanese company is a plus.\n- Fluent in English (oral and written).\n- Valid driver's license and ability to drive a car.\n\n**Job Description:**\n- Visit customer sites for installation, troubleshooting, maintenance, and commissioning tasks.\n- Identify and approach potential new customers to establish service contracts.\n- Create and offer consumable parts to clients.\n- Follow up on parts quotations previously submitted to customers, and re-offer parts as needed.\n- Prepare and submit service contract quotations.\n- Provide technical support to the sales team for machine specifications and inquiries.\n\n**Benefits:**\n- Competitive basic salary.\n- Commuting allowance.\n- Housing allowance.\n- Car allowance.\n- Mobile phone facility (iPhone 12).\n- Credit telephone allowance.\n- Medical allowance.\n- BPJS Kesehatan (Health Insurance).\n- BPJS Ketenagakerjaan (Employment Insurance).\n- JSHK.\n- Performance bonuses.\n- Personal tax coverage.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537132/hacktiv8/career/engineer-3gzufixyx0d.png",
    "jobType": "Full-Time",
    "companyId": 100,
    "authorId": 8,
    "createdAt": "2024-08-13T08:18:53.022Z",
    "updatedAt": "2024-08-13T08:18:53.022Z"
  },
  {
    "title": "Engineer On Site",
    "description": "### Job Qualifications:\n- Bachelor's degree in Electrical Engineering, Telecommunication Engineering, Computer Science, Computer Engineering, or Instrument Engineering.\n- Minimum 2 years of experience in Telecommunications and IT industries.\n- Possess a persistent personality and ability to work under pressure.\n- Capable of working independently or within a team.\n- Proficient in Microsoft Office applications.\n- CCTV and ACS BOSH Certification is a plus.\n- Must maintain a healthy body and eyesight.\n- Willingness to work in elevated areas.\n\n### Job Descriptions:\n- Responsible for data management on-site.\n- Serve as the standby engineer for CCTV systems.\n- Manage ACS users, including adding and removing users.\n- Synchronize existing systems and devices with new equipment.\n- Conduct troubleshooting and repairs of CCTV and ACS systems at customer locations.\n- Generate monthly reports.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537133/hacktiv8/career/engineer-on-site-ua9il0m7c3.jpg",
    "jobType": "Full-Time",
    "companyId": 101,
    "authorId": 10,
    "createdAt": "2024-08-13T08:18:53.698Z",
    "updatedAt": "2024-08-13T08:18:53.698Z"
  },
  {
    "title": "Senior .NET Full-Stack Developer",
    "description": "### Job Description:\n\nAs a **Full-Stack Developer**, you will play a vital role in developing and maintaining cutting-edge web applications utilizing **C# .NET**, **ReactJS**, and **Google's Firebase**. You will collaborate closely with our design and development teams to create robust, scalable, and high-performance applications. This position encompasses both front-end and back-end development, ensuring seamless integration and functionality across the entire technology stack.\n\n### Key Responsibilities:\n\n- Develop and maintain web applications using **C# .NET** and **ReactJS**.\n- Design and implement database solutions leveraging **Firebase Realtime DB** and **Cloud Firestore**.\n- Collaborate with cross-functional teams to define, design, and launch new features.\n- Write clean, well-documented, and efficient code following best practices.\n- Conduct code reviews and offer constructive feedback to peers.\n- Troubleshoot, debug, and optimize applications for maximum speed and scalability.\n- Utilize **Facebook Developer** tools for social media integrations and marketing automation.\n- Manage and optimize our **Google My Business** profile and API integrations.\n- Stay current with emerging technologies and industry trends.\n\n### Requirements:\n\n- Proven experience (3+ years) as a **Full-Stack Developer** using **.NET Core** and **ReactJS**.\n- Proficient in **C# .NET**, demonstrating experience in developing web applications with this technology.\n- Strong knowledge of **ReactJS**, with solid experience in building user interfaces including component-based architecture and state management.\n- Hands-on experience with **Firebase Realtime DB** and **Cloud Firestore**, focusing on real-time data synchronization and cloud-based storage solutions.\n- Knowledge of **ElasticSearch** for implementing search functionality and analytics.\n- Capable of fulfilling both front-end and back-end development tasks effectively.\n- Familiarity with version control systems, preferably **Git**, as we utilize **Azure DevOps** for the software development life cycle.\n- Strong analytical and problem-solving skills, with keen attention to detail.\n- Excellent communication skills and teamwork capabilities, thriving in collaborative environments.\n- Professional proficiency in spoken and written **English** is essential, as you will be collaborating with an overseas team.\n\n### Preferred Qualifications:\n\n- Familiarity with **RESTful API** design and integration.\n- Experience with **ASP.NET Core Identity**.\n- Knowledge of cloud services and serverless architecture.\n- Experience with CI/CD pipelines and DevOps practices, specifically with **Azure DevOps**.\n- Experience with deploying, managing, and scaling applications on **Microsoft Azure**.\n- Familiarity with the **Facebook Developer Program**, including integration of Facebook APIs and tools.\n- Experience with managing and optimizing business profiles through **Google My Business**.\n\n### Education:\n\nBachelor’s degree in **Computer Science**, **Software Engineering**, or a related field, or equivalent work experience.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537139/hacktiv8/career/senior-.net-full-stack-developer-yb2ti4wxzcb.jpg",
    "jobType": "Full-Time",
    "companyId": 102,
    "authorId": 5,
    "createdAt": "2024-08-13T08:18:59.445Z",
    "updatedAt": "2024-08-13T08:18:59.445Z"
  },
  {
    "title": "Senior C# Developer",
    "description": "### Job Summary:\nWe are seeking a skilled Software Engineer with expertise in both **C#** and **Python** to join our dynamic development team. The ideal candidate will possess a strong background in software development, a passion for coding, and the ability to manage multiple projects simultaneously.\n\n### Key Responsibilities:\n- Develop, test, and maintain high-quality software using **C#** and **Python**.\n- Collaborate with cross-functional teams to define, design, and implement new features.\n- Debug and resolve software defects and issues.\n- Optimize and refactor existing code for enhanced performance and maintainability.\n- Participate in code reviews and provide constructive feedback to team members.\n- Contribute to the design and architecture of new software solutions.\n- Write and maintain documentation for software applications.\n- Stay updated with the latest industry trends and technologies.\n\n### Qualifications:\n- Bachelor’s degree in **Computer Science**, **Engineering**, or a related field, or equivalent practical experience.\n- Proven experience as a Software Engineer or similar role.\n- Strong proficiency in both **C#** and **Python** programming languages.\n- Experience with the **.NET** framework and related technologies.\n- Familiarity with front-end technologies (e.g., **HTML**, **CSS**, **JavaScript**) is a plus.\n- Experience with version control systems, such as **Git**.\n- Strong problem-solving skills and attention to detail.\n- Excellent communication and teamwork skills.\n- Ability to manage multiple tasks and prioritize effectively.\n\n### Preferred Skills:\n- Experience with web development frameworks such as **Django** (Python) or **ASP.NET** (C#).\n- Knowledge of cloud platforms (e.g., **AWS**, **Azure**, **GCP**).\n- Experience with database management systems (e.g., **SQL Server**, **MySQL**, **PostgreSQL**).\n- Understanding of software development methodologies (e.g., **Agile**, **Scrum**).\n\n### Benefits:\n- Competitive salary and performance-based bonuses.\n- Comprehensive health, dental, and vision insurance.\n- Flexible work hours and remote work options.\n- Professional development opportunities.\n- Collaborative and inclusive company culture.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537139/hacktiv8/career/senior-c-developer-5xiqx6g6es3.png",
    "jobType": "Full-Time",
    "companyId": 12,
    "authorId": 1,
    "createdAt": "2024-08-13T08:19:00.253Z",
    "updatedAt": "2024-08-13T08:19:00.253Z"
  },
  {
    "title": "Engineering",
    "description": "### Qualification\n- Ability to work collaboratively within a team environment.\n- Fresh graduates are encouraged to apply.\n- Minimum education level: SMA / SMK.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537140/hacktiv8/career/engineering-0teajiycnxwp.jpg",
    "jobType": "Full-Time",
    "companyId": 103,
    "authorId": 4,
    "createdAt": "2024-08-13T08:19:01.057Z",
    "updatedAt": "2024-08-13T08:19:01.057Z"
  },
  {
    "title": "Website Developer (Adobe Experience Manager)",
    "description": "Hi, We are excited to announce that we have a job opening on behalf of our client.\n\n**Job Title:** Website Developer (Adobe Experience Manager)  \n**Location:** Jakarta Selatan  \n**Job Type:** Contract (6 Month)  \n\nWe are seeking an Adobe Experience Manager (AEM) Integration Specialist to lead the integration of our existing website from a different CMS platform into AEM. This role requires a deep understanding of both front-end and back-end technologies, focusing on ensuring a smooth transition while maintaining or enhancing functionality and user experience.\n\n**Key Responsibilities:**  \n- Design and implement a comprehensive plan to migrate content, structure, and functionality from existing CMS tools to Adobe Experience Manager (AEM).  \n- Create AEM components, templates, and workflows to replicate or improve current website features.  \n- Develop responsive and user-friendly interfaces using HTML, CSS, JavaScript, jQuery, and other JS frameworks (NUXT, REACT, etc.).  \n- Ensure seamless integration of front-end components into AEM, preserving website design and user experience.  \n- Implement server-side logic in AEM, utilizing PHP, MySQL, and frameworks such as CodeIgniter and Laravel to support back-end functionalities.  \n- Configure server environments (Tomcat, Apache, Nginx) for optimal integration and performance.  \n- Ensure that the migration process and final integrated website meet web security protocols.  \n- Address security risks during the integration and post-integration phases.  \n- Use version control systems like Git to manage the integration process and maintain code integrity.  \n- Deploy and maintain AEM-based solutions in cloud environments like AWS, ensuring scalability and reliability.  \n- Collaborate with cross-functional teams, including developers, designers, IT, and stakeholders, to ensure successful integration.  \n- Communicate progress and technical details effectively to non-technical stakeholders.\n\n**Job Requirements:**  \n- Minimum 3 years of experience in using AEM.  \n- Proficiency in HTML, CSS, JavaScript, and jQuery.  \n- Strong experience with PHP, MySQL, WordPress, CodeIgniter, and Laravel.  \n- Familiarity with JS frameworks such as NUXT, REACT, etc.  \n- Knowledge of web security protocols and server configurations (Tomcat, Apache, Nginx).  \n- Proven experience in integrating CMS tools into Adobe Experience Manager (AEM).  \n- Experience with version control systems like Git and cloud services like AWS.  \n- Strong problem-solving abilities, especially in complex integration scenarios.  \n- Ability to troubleshoot technical issues and devise creative solutions.  \n- Excellent collaboration skills, with the ability to work in cross-functional teams.  \n- Effective communication skills to explain technical concepts to non-technical stakeholders.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537141/hacktiv8/career/website-developer-%28adobe-experience-manager%29-fz6t1l266wu.png",
    "jobType": "Full-Time",
    "companyId": 104,
    "authorId": 5,
    "createdAt": "2024-08-13T08:19:01.645Z",
    "updatedAt": "2024-08-13T08:19:01.645Z"
  },
  {
    "title": "Backend Engineer",
    "description": "**Job Description:**\n\n- Compile and analyze data, processes, and codes to troubleshoot issues and identify opportunities for enhancement.\n- Collaborate with front-end developers and other team members to set objectives and design cohesive code that improves the user experience.\n- Develop ideas for new programs, products, or features by keeping abreast of industry developments and trends.\n- Participate in continuous education and training to stay current on best practices, learn new programming languages, and support team members more effectively.\n- Take the lead on projects as needed.\n\n**Requirements:**\n\n- 3-5 years of relevant work experience.\n- Familiarity with web server development technologies and Git version control tools.\n- Proficient in Java with a solid foundation, including knowledge of common Java collection classes; multithreading knowledge is a plus.\n- Experience with MySQL databases and SQL, as well as familiarity with Python, Ruby on Rails, Redis, Tomcat, RabbitMQ, and other middleware technologies.\n- Knowledge of Spring, Spring Boot, MyBatis, and understanding of HTTP protocol.\n- Prior experience in internet financial business development is preferred.\n- Ability to communicate in English.\n- Strong communication and presentation skills.\n- Capable of managing multiple tasks and timelines in a fast-paced environment.\n- Willingness to work from the office in BSD, Tangerang Selatan.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537141/hacktiv8/career/backend-engineer-a4zbjtastgq.png",
    "jobType": "Full-Time",
    "companyId": 105,
    "authorId": 10,
    "createdAt": "2024-08-13T08:19:02.404Z",
    "updatedAt": "2024-08-13T08:19:02.404Z"
  },
  {
    "title": "Senior Software Engineer",
    "description": "We are seeking a skilled Software Developer with the following qualifications and experience:\n\n- Over 5 years of experience in software development utilizing Microsoft technologies including .NET, NodeJS, C#, VB6, and MS SQL.\n- Strong proficiency in Flutter and JavaScript frameworks.\n- Experience in developing microservices and API software.\n- Capable of writing SQL statements, including Queries, DML, and DDL.\n- Solid understanding of RDBMS concepts with knowledge of API integration.\n- Familiarity with version control systems, particularly Git.\n- Excellent problem-solving and debugging skills.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537144/hacktiv8/career/senior-software-engineer-1vyz0ght3er.png",
    "jobType": "Full-Time",
    "companyId": 106,
    "authorId": 1,
    "createdAt": "2024-08-13T08:19:05.146Z",
    "updatedAt": "2024-08-13T08:19:05.146Z"
  },
  {
    "title": "Java Developer (Financial Service)",
    "description": "**Job Title: Back-End Developer**\n\n**Responsibilities:**\n1. Develop back-end services (web API, scheduler) in accordance with requirements and technology standards.\n2. Deploy and test back-end services, ensuring all functionalities operate smoothly.\n3. Maintain, troubleshoot, and resolve issues related to back-end services.\n4. Monitor and ensure the availability and performance of back-end services.\n5. Write high-quality, clean, and maintainable code, along with comprehensive technical documentation.\n6. Collaborate with developers, technical leads, UI/UX designers, QA, product owners, tribe leaders, and other stakeholders to build robust applications.\n\n**Additional Expertise Required:**\n1. Strong understanding of J2EE, the Spring framework, and MVC concepts.\n2. Proficient in REST API development and familiarity with JSON.\n3. Solid knowledge of Java web application deployment and configuration; experience with Docker, Kubernetes, and Microservices architecture is highly desirable.\n4. Good grasp of database queries (preferably PL/SQL) with experience in schema design and query optimization considered a plus.\n5. Basic understanding of Agile and Scrum methodologies.\n6. Self-motivated with a proactive attitude and excellent communication skills.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537145/hacktiv8/career/java-developer-%28financial-service%29-tho1flwvfsb.jpg",
    "jobType": "Full-Time",
    "companyId": 26,
    "authorId": 10,
    "createdAt": "2024-08-13T08:19:05.996Z",
    "updatedAt": "2024-08-13T08:19:05.996Z"
  },
  {
    "title": "Full Stack Engineer",
    "description": "### Job Description\n\n- **Participate in the development of both Backend and Frontend Applications using Laravel, Yii, and CodeIgniter.**  \n- Identify and resolve bugs to ensure optimal performance and scalability.  \n- Develop and maintain the Waizly system.  \n- Collaborate effectively with the engineering team to enhance interface and functionality.  \n\n### Job Requirements\n\n- Minimum of 2 years of experience as a Full Stack Engineer.  \n- Familiarity with Git, Scrum Agile methodologies, and Design Patterns (Atomic, Clean Code).  \n- Strong expertise in Laravel, Yii, and CodeIgniter.  \n- Knowledge of message brokers (Kafka, RabbitMQ) is a plus.  \n- Ability to work collaboratively as part of a team.  \n- Excellent communication skills.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537146/hacktiv8/career/full-stack-engineer-ghdmho7zlxo.jpg",
    "jobType": "Full-Time",
    "companyId": 107,
    "authorId": 10,
    "createdAt": "2024-08-13T08:19:06.698Z",
    "updatedAt": "2024-08-13T08:19:06.698Z"
  },
  {
    "title": "Java Springboot Developer",
    "description": "### Job Description\n\n**Responsibilities:**\n- Develop and maintain web applications using Java and Spring Boot.\n- Design and implement RESTful APIs.\n- Collaborate with front-end teams to integrate applications with user interfaces.\n- Optimize applications for performance and scalability.\n- Write clean, efficient, and well-documented code.\n- Identify and fix bugs and performance issues.\n- Participate in code reviews to ensure high-quality code.\n- Understand business requirements and translate them into technical solutions.\n- Stay updated with the latest technology trends and apply them to relevant projects.\n- Provide technical guidance and mentorship to junior team members.\n- Contribute to architectural planning and system design.\n\n**Requirements:**\n- Diploma or Bachelor's degree in Computer Science, Information Technology, or a related field.\n- 3-5 years of experience in developing applications using Java and Spring Boot.\n- Strong proficiency in Java and the Spring Boot framework.\n- Deep understanding of OOP (Object-Oriented Programming) principles.\n- Experience with relational databases such as MySQL and PostgreSQL.\n- Experience using version control tools like Git.\n- Knowledge of RESTful API development.\n- Familiarity with front-end technologies like HTML, CSS, and JavaScript is a plus.\n- Experience in performance optimization and application scalability.\n- Strong analytical and problem-solving skills.\n- Effective communication skills and ability to work in a team.\n- Good time management skills and ability to meet tight deadlines.\n- Experience in leading projects or development teams is a plus.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537146/hacktiv8/career/java-springboot-developer-puji7pzivgf.jpg",
    "jobType": "Full-Time",
    "companyId": 108,
    "authorId": 7,
    "createdAt": "2024-08-13T08:19:07.356Z",
    "updatedAt": "2024-08-13T08:19:07.356Z"
  },
  {
    "title": "Internship Front End Programmer",
    "description": "**Hi Millenials People**\n\n**Let's Join Our Winning Team**\n\nKami mencari kandidat terbaik untuk mengisi posisi yang dibutuhkan oleh tim dengan tanggung jawab:\n- Membantu membuat dan mengembangkan aplikasi web yang dibutuhkan perusahaan.\n\n**Kualifikasi:**\n- Freshgraduate dipersilakan melamar.\n- Terbiasa dalam menggunakan framework **Vue JS ver.3** atau **React JS**.\n- Memahami **state management Vuex** merupakan nilai lebih.\n- Memahami **CSS & SCSS**, **Bootstrap**, dan **Git**.\n- Lokasi Magang di area perkantoran Kelapa Gading, Jakarta Utara.\n\n**Benefit:**\n- Upah bekerja.\n- Sertifikat Internship.\n- Peluang menjadi karyawan.\n- Waktu kerja Senin-Jumat.\n\nApabila Anda adalah pribadi yang kami butuhkan, silahkan apply lamaran untuk mengikuti tahap tes onlinenya segera.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537147/hacktiv8/career/internship-front-end-programmer-zl1qsm4snrh.png",
    "jobType": "Internship",
    "companyId": 66,
    "authorId": 6,
    "createdAt": "2024-08-13T08:19:08.250Z",
    "updatedAt": "2024-08-13T08:19:08.250Z"
  },
  {
    "title": "Full Stack Engineer",
    "description": "## Job Descriptions\n\n- Membangun perangkat lunak yang kuat dan dapat ditingkatkan dengan membuat fitur baru, melakukan debugging, dan mengoptimalkan aplikasi.\n- Mengembangkan dan mengusulkan produk atau fitur baru dengan memantau industri.\n- Membuat kode untuk mengembangkan aplikasi web fungsional di perangkat mobile dan desktop.\n- Implementasi keamanan dan perlindungan data.\n- Desain dan implementasi solusi penyimpanan data.\n- Bekerja sama dengan desainer, manajer produk, dan administrator sistem untuk mengidentifikasi dan membangun fitur baru.\n\n## Job Requirements\n\n- Pendidikan minimal SMK.\n- Kemampuan dan pengalaman dalam HTML, CSS, dan Javascript.\n- Kemampuan dalam menggunakan framework Javascript seperti NodeJS, React.\n- Pengetahuan dan pengalaman yang kuat dalam bahasa pemrograman sisi server.\n- Familiaritas dengan mesin database seperti MySQL, SQL Server.\n- Familiar dengan layanan hosting web seperti AWS.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537148/hacktiv8/career/full-stack-engineer-rojll6gwz5.png",
    "jobType": "Contract",
    "companyId": 109,
    "authorId": 10,
    "createdAt": "2024-08-13T08:19:08.973Z",
    "updatedAt": "2024-08-13T08:19:08.973Z"
  },
  {
    "title": "Odoo Developer",
    "description": "**Responsibilities:**\n- Custom module development for Odoo (sales, inventory, accounting, purchase, contact)\n- Maintenance of existing modules\n- Integration of Odoo with other systems using API and Odoo-RPC\n- Monitoring of the existing system\n- Providing functional support\n- Development, testing, debugging, deployment, and enhancement of modules within the allocated schedule\n- Collaborating with other division teams and their appointed third parties during system interface development\n- Offering support to other teams during system integration testing, user acceptance testing, user training, and post-go-live support\n- Contributing to our Knowledge Management by providing technical information related to our application design\n\n**Requirements:**\n- Passionate about development\n- Bachelor’s degree (S1) in Information Technology or Computer Science\n- Quick and autonomous learner, self-starter\n- Excellent analytical skills to creatively identify and solve problems\n- Proficient in Python, Flask, JavaScript, HTML/JSS/CSS\n- Good knowledge of PostgreSQL and MongoDB with the ability to write queries\n- Familiarity with the Linux operating system\n- Prior experience with GitLab collaboration tool\n- Understanding of the Odoo framework and functional modules is a significant plus",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537149/hacktiv8/career/odoo-developer-55w2ceq170u.png",
    "jobType": "Full-Time",
    "companyId": 110,
    "authorId": 3,
    "createdAt": "2024-08-13T08:19:09.659Z",
    "updatedAt": "2024-08-13T08:19:09.659Z"
  },
  {
    "title": "Teknisi ETL",
    "description": "### Job Description: Teknisi Service Center \n\n**Tanggung Jawab Utama:**  \n1. Menganalisa kerusakan yang terjadi pada unit.  \n2. Memperbaiki kerusakan unit.  \n3. Melakukan reparasi / servis mencakup membongkar, memasang, serta analisa kerusakan perangkat lunak dan lainnya.  \n4. Membuat laporan, melakukan input sistem, dan menyelesaikan pekerjaan lainnya yang diperlukan.  \n5. Melakukan kunjungan ke konsumen.  \n6. Menjalani perjalanan dinas jika dibutuhkan.  \n7. Menyusun laporan harian sesuai dengan format yang telah ditentukan.  \n8. Memiliki kemampuan logis dalam menyelesaikan masalah troubleshooting.  \n9. Memahami perangkat elektronik serta dasar permesinan, termasuk pengoperasian, penyetelan, dan teknik perbaikan.  \n10. Menganalisa kebutuhan pelayanan pada service center.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537149/hacktiv8/career/teknisi-etl-xb4merc96lh.jpg",
    "jobType": "Full-Time",
    "companyId": 111,
    "authorId": 4,
    "createdAt": "2024-08-13T08:19:10.326Z",
    "updatedAt": "2024-08-13T08:19:10.326Z"
  },
  {
    "title": "Quality Assurance Automation - Banking",
    "description": "- Usia maksimal 30 tahun\n- Pendidikan minimal S1\n- Mempunyai kemampuan logika yang baik\n- Berpengalaman dalam membuat script automasi\n- Memiliki pengalaman di QA automation (Cypress, Katalon, Cucumber) minimal 1 tahun\n- Tidak sedang melanjutkan pendidikan atau memiliki rencana kuliah/pekerjaan paruh waktu\n- Mampu dan terbiasa membuat program untuk Web dan Mobile\n- Memiliki minat dalam melakukan riset dan pembaruan terhadap teknologi otomatisasi",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537150/hacktiv8/career/quality-assurance-automation-banking-d5064cnmh6b.png",
    "jobType": "Contract",
    "companyId": 11,
    "authorId": 4,
    "createdAt": "2024-08-13T08:19:11.019Z",
    "updatedAt": "2024-08-13T08:19:11.019Z"
  },
  {
    "title": "Senior .NET Engineer with AWS Knowledge",
    "description": "**Senior .NET Engineer with AWS Knowledge**  \n\n**Job Description**  \nWe are seeking an experienced Senior .NET Engineer with strong AWS expertise to join our development team. The ideal candidate will have a robust background in C# development, containerization, and AWS services, contributing to various projects to enhance and maintain our platform.  \n\n**Key Responsibilities:**  \n- **Service Development & Integration:**  \n  - Develop and maintain services on existing and new systems based on .NET/C#.  \n  - Create toolsets for image processing and other tasks, minimizing client and server dependencies.  \n  - Implement alternative archiving solutions and manage bulk data imports.  \n- **Containerization & Workflow Management:**  \n  - Manage job queues and containerization processes for dynamic scaling.  \n  - Handle metadata workflows with integration of relational and NoSQL databases.  \n- **System Upgrades & Optimization:**  \n  - Upgrade processing systems to support multi-tenancy.  \n  - Migrate workflow components from other platforms to C# for improved performance.  \n- **Security & Integration:**  \n  - Integrate authentication solutions and re-integrate existing tools into the platform.  \n  - Offload and manage full-text index data for improved search efficiency.  \n- **AWS Infrastructure Management:**  \n  - Utilize AWS services to prepare and optimize platform infrastructure.  \n  - Implement and manage message queuing systems.  \n\n**Requirements:**  \n- **Technical Expertise:**  \n  - Extensive experience with C# and .NET development.  \n  - Proficiency in containerization and database management.  \n  - Strong understanding of AWS services and platform infrastructure.  \n  - Minimum of 3 years of experience in .NET development.  \n- **Experience & Skills:**  \n  - Proven track record with dynamic scaling and containerized environments.  \n  - Familiarity with authentication integration and data indexing.  \n  - Strong problem-solving skills and attention to detail.  \n- **Soft Skills:**  \n  - Excellent English communication skills are a must.  \n  - Strong communication and teamwork abilities.  \n  - Efficient project and task management.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537151/hacktiv8/career/senior-.net-engineer-with-aws-knowledge-9yfwxs2exij.jpg",
    "jobType": "Contract",
    "companyId": 112,
    "authorId": 8,
    "createdAt": "2024-08-13T08:19:11.601Z",
    "updatedAt": "2024-08-13T08:19:11.601Z"
  },
  {
    "title": "Full Stack Engineer",
    "description": "### Job Description\n\nWe are seeking a qualified candidate to join our dynamic team. The ideal candidate will possess knowledge and skills to excel in fast-paced environments while working with advanced technologies. Below are the qualifications and requirements for the position:\n\n#### Qualifications and Requirements:\n- Bachelor's degree in Informatics Engineering or a related field\n- Domiciled in the Jabotabek area\n- Female candidates are preferred\n- Proficient in Laravel Framework and React.JS\n- Strong expertise in Python and SQL\n- Comfort in working in a fast-paced environment\n- Familiarity with cloud platforms is an advantage\n- Willingness to be placed in Jakarta",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537151/hacktiv8/career/full-stack-engineer-2ky09mvb617.jpg",
    "jobType": "Contract",
    "companyId": 113,
    "authorId": 9,
    "createdAt": "2024-08-13T08:19:12.545Z",
    "updatedAt": "2024-08-13T08:19:12.545Z"
  },
  {
    "title": "Full Stack Developer",
    "description": "PT. SATRIA DIGITAL SEJAHTERA membuka lowongan kerja untuk mengisi posisi sebagai **Full Stack Developer** untuk **Build and Update Internal Application (Web Based)**.\n\n**Tanggung Jawab Pekerjaan:**\n- Membangun dan memperbarui aplikasi internal berbasis web.\n- Menganalisis kebutuhan dan mengimplementasikannya ke dalam coding PHP.\n- Merumuskan strategi untuk struktur aplikasi, arsitektur, pengembangan, dan implementasi.\n- Mengembangkan aplikasi menggunakan HTML dan PHP.\n- Bekerja sama dalam tim dengan alur kerja yang diterapkan pada SDLC Oriented atau manajemen proyek Agile.\n\n**Syarat Pengalaman:**\n- Minimal 1 tahun pengalaman sebagai web developer.\n\n**Keahlian:**\n- PHP\n- Pengetahuan SQL yang baik dan kemampuan analisis yang baik.\n- Pengalaman dengan framework Laravel.\n\n**Kualifikasi:**\n- Pendidikan: Gelar Sarjana di bidang IT/Ilmu Komputer atau jurusan terkait.\n- Minimal 1 tahun pengalaman kerja di bidang terkait diperlukan untuk posisi ini. Lulusan baru dipersilakan melamar.\n- Kemampuan kerja sama tim yang baik dan berorientasi pada tenggat waktu.\n- Penempatan di Tangerang Selatan, WFO.\n\n**Waktu Bekerja:**\n- 08.30 – 17.00 (Senin – Jumat)\n- 08.30 - 14.00 (Sabtu)",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537152/hacktiv8/career/full-stack-developer-eb5l97bpff5.png",
    "jobType": "Contract",
    "companyId": 114,
    "authorId": 5,
    "createdAt": "2024-08-13T08:19:13.682Z",
    "updatedAt": "2024-08-13T08:19:13.682Z"
  },
  {
    "title": "Frontend Developer (Vue Js) Intern",
    "description": "**Job Descriptions**\n- Assist in developing and implementing user interfaces for web applications using Vue.js and related front-end technologies.\n- Integrate with backend APIs to fetch and manage data.\n- Optimize application performance to deliver a fast and efficient user experience.\n- Assist in testing of Vue.js components to identify and resolve any bugs or issues.\n- Collaborate with the development team to deliver high-quality solutions.\n\n**Job Requirements**\n- Final year college student or Bachelor's degree (S1) in Computer Science, Software Engineering, or related majors.\n- Proficiency in HTML, CSS, and JavaScript (Vue.js).\n- Knowledge of RESTful APIs to efficiently fetch and manage data within Vue.js applications.\n- Familiarity with GitHub or similar tools.\n- Willingness to work onsite in Yogyakarta.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537153/hacktiv8/career/frontend-developer-%28vue-js%29-intern-0iltorpncxo5.png",
    "jobType": "Internship",
    "companyId": 115,
    "authorId": 7,
    "createdAt": "2024-08-13T08:19:14.297Z",
    "updatedAt": "2024-08-13T08:19:14.297Z"
  },
  {
    "title": "HVAC Engineer",
    "description": "### Kualifikasi:\n\n- Usia Maksimal 30 tahun;\n- Pendidikan Minimal D3 Teknik Tata Udara dan Pendingin/ Teknik Mesin atau jurusan terkait;\n- Memiliki pengalaman minimal 3 tahun;\n- Kemampuan berbahasa Inggris lebih diutamakan;\n- Kreatif dan inovatif;\n- Mampu bekerja dalam tim;\n- Menguasai AUTOCAD;\n- Menguasai Cooling Load HVAC;\n- Memiliki pengetahuan yang luas tentang sistem HVAC.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537155/hacktiv8/career/hvac-engineer-v247w3m5bhm.jpg",
    "jobType": "Full-Time",
    "companyId": 116,
    "authorId": 3,
    "createdAt": "2024-08-13T08:19:15.671Z",
    "updatedAt": "2024-08-13T08:19:15.671Z"
  },
  {
    "title": "Software Engineer (Frontend)",
    "description": "### Job Title: Frontend Developer\n\n**Key Responsibilities:**\n- Develop and maintain high-quality web and mobile applications using React JS and React Native.\n- Collaborate with cross-functional teams to define, design, and ship new features.\n- Ensure the technical feasibility of UI/UX designs.\n- Optimize applications for maximum speed and scalability.\n- Troubleshoot and debug issues to improve performance.\n- Stay updated with the latest industry trends and technologies to ensure our projects utilize the best solutions available.\n- Implement and manage content on WordPress websites.\n\n\n**Requirements:**\n- Bachelor’s degree in Computer Science, Information Technology, or a related field.\n- Proven work experience as a Frontend Developer or in a similar role.\n- Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model.\n- In-depth knowledge of React JS and React Native.\n- Experience with WordPress development, including custom themes and plugins.\n- Familiarity with modern front-end build pipelines and tools.\n- Proficient understanding of web markup, including HTML5 and CSS3.\n- Understanding of responsive design principles and cross-browser compatibility issues.\n- Experience with version control systems, such as Git.\n- Strong problem-solving skills and attention to detail.\n- Excellent communication and teamwork skills.\n\n\n**Preferred Qualifications:**\n- Familiarity with RESTful APIs and GraphQL.\n- Experience with CI/CD pipelines and deployment processes.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537155/hacktiv8/career/software-engineer-%28frontend%29-yo63zg4x039.png",
    "jobType": "Contract",
    "companyId": 56,
    "authorId": 8,
    "createdAt": "2024-08-13T08:19:16.933Z",
    "updatedAt": "2024-08-13T08:19:16.933Z"
  },
  {
    "title": "Full Stack Engineer",
    "description": "### Job Description\n\n**Position:** Business Application Developer  \n**Location:** BSD Tangerang (Full onsite)  \n**Duration:** 12 Months (Immediate Start)  \n\n#### Responsibilities:\n- Support the development of business applications using various development tools and adhere to established guidelines and conventions.\n\n#### Requirements:\n- **For Supporting Business Application Development:**  \n  - Familiar with development tools, guidelines, and conventions including but not limited to .Net, SQL Server, HTML, CSS, JavaScript, C#, and optionally MVC.\n\n- **For Core Business Application Development:**  \n  - Familiar with development tools, guidelines, and conventions including, but not limited to, ASP.NET, ASP.NET MVC, ASP.NET Core, SQL Server, JavaScript (TypeScript, Vanilla JS, jQuery), React JS/Vue JS, SharePoint, Microsoft Azure, Flutter, HTML, and CSS.\n\n- Familiarity with PWA (Progressive Web Applications) is a plus.\n- Minimum of 3 – 5 years of experience in application development.\n- Bachelor's degree in Computer Science / IT.\n- Willingness to work as part of a team.\n- Flexibility to work overtime if required.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537157/hacktiv8/career/full-stack-engineer-cjtvqqjtg84.png",
    "jobType": "Contract",
    "companyId": 11,
    "authorId": 4,
    "createdAt": "2024-08-13T08:19:17.590Z",
    "updatedAt": "2024-08-13T08:19:17.590Z"
  },
  {
    "title": "Backend Developer",
    "description": "### Job Description\n\nWe are seeking a skilled software developer to join our team. The ideal candidate should possess a strong foundation in the following areas:\n\n1. **Proficient in Java Spring Boot / Golang / PHP**\n2. **Experience with API Development**\n3. **Knowledge of Database Management and SQL**\n4. **Solid programming skills in Java**\n5. **Experience in the banking or financial services sector is a plus**\n\nIf you have a passion for software development and meet the requirements listed above, we encourage you to apply.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537157/hacktiv8/career/backend-developer-gwn4u78nb6c.png",
    "jobType": "Contract",
    "companyId": 40,
    "authorId": 6,
    "createdAt": "2024-08-13T08:19:18.378Z",
    "updatedAt": "2024-08-13T08:19:18.378Z"
  },
  {
    "title": "L2 IT Security Expert",
    "description": "We are looking for an experienced and highly skilled **L2 IT Security Expert** to join our team. In this vital role, you will be responsible for developing, implementing, and maintaining robust security measures across various operating systems, network devices, and databases within the **Permata Data Center**. You will collaborate closely with system owners and other stakeholders to ensure that all security protocols are effective and kept up-to-date.\n\n### Key Responsibilities:\n- Prepare a draft standard hardening system for all types of operating systems (OS), network devices, and databases within the Permata Data Center.\n- Develop command scripts/system hardening file programs according to established standards.\n- Test command scripts in collaboration with system owners until they are ready for implementation.\n- Update existing standard hardening documents to ensure they reflect the latest best practices.\n- Review and adjust command scripts in the Nessus application to align with parameters outlined in the standard hardening document.\n\n### Qualifications:\n- Bachelor's degree in System Information Technology or a related field.\n- Proven experience in networking and IT security, particularly in L2 IT security practices.\n- Strong knowledge of Security Orchestration, Automation, and Response (SOAR) services.\n- In-depth understanding of system hardening and security script preparation.\n- Familiarity with various operating systems, network devices, and database hardening techniques.\n- Proficiency with security tools such as Nessus.\n- Excellent analytical and problem-solving skills.\n- Strong attention to detail and the ability to work collaboratively with system owners and other stakeholders.\n- Effective communication and documentation skills.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537158/hacktiv8/career/l2-it-security-expert-w7xxvhpaq1e.png",
    "jobType": "Full-Time",
    "companyId": 75,
    "authorId": 4,
    "createdAt": "2024-08-13T08:19:19.175Z",
    "updatedAt": "2024-08-13T08:19:19.175Z"
  },
  {
    "title": "Software Engineer",
    "description": "### Job Title: Software Engineer\n\n#### Terms Required:\n1. Pendidikan minimal D3/S1 Sederajat dengan jurusan terkait (IT, Software Engineering, Informatika, dsb).\n2. Mampu bekerja secara tim dan individu.\n3. Memiliki pengalaman minimal 3 tahun dalam software engineering.\n4. Mampu bekerja dengan cepat sesuai timeline.\n5. Mampu melakukan report harian dan bulanan kepada atasan dengan baik.\n6. Memiliki kemampuan komunikasi yang baik kepada internal maupun eksternal.\n7. Memiliki keterampilan problem-solving yang baik.\n8. Mampu mentaati SOP dan menjalankan jobdesc sesuai.\n9. Cepat tanggap dan mau belajar.\n10. Memiliki etika dan kepribadian yang baik.\n11. Memiliki tanggung jawab yang tinggi terhadap pekerjaannya.\n12. Mampu menyelesaikan proyek sampai tuntas.\n13. Memiliki keingintahuan yang tinggi.\n\n#### Jobdesc Requirement:\n1. Menguasai pemrograman Golang dan PHP (menguasai pemrograman lain menjadi nilai tambah).\n2. Menguasai pemrograman dengan database SQL (MySQL/MSSQL/PostgreSQL).\n3. Membuat software program dengan bahasa pemrograman yang dapat berkomunikasi dengan instrument.\n4. Membuat perencanaan infrastruktur IT terhadap proyek yang berhubungan dengan IT network.\n5. Melakukan maintenance pada software user existing.\n6. Melakukan pengembangan software integrasi.\n7. Membuat drawing infrastruktur IT.\n8. Mengkonfigurasi perangkat-perangkat network.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537159/hacktiv8/career/software-engineer-lek9yhqnlz.png",
    "jobType": "Full-Time",
    "companyId": 117,
    "authorId": 6,
    "createdAt": "2024-08-13T08:19:19.914Z",
    "updatedAt": "2024-08-13T08:19:19.914Z"
  },
  {
    "title": "Developer React Native",
    "description": "### Job Title: React Native Developer\n\n#### Requirements:\n- Currently pursuing or recently completed a degree in Computer Science, Software Engineering, or a related field.\n- **Experience**: Minimum of 2 years in React Native development, with a strong portfolio of released applications on both Android and iOS.\n- Strong understanding of React Native and mobile app development.\n- Experience with JavaScript, HTML, and CSS.\n- Familiarity with RESTful APIs and third-party libraries.\n- Strong problem-solving skills and attention to detail.\n- Excellent communication and teamwork skills.\n- Self-motivated and a fast learner.\n\n#### Responsibilities:\n1. Collaborate with the development team to design and implement mobile applications using React Native.\n2. Develop, test, and deploy mobile app features.\n3. Ensure the performance, quality, and responsiveness of applications.\n4. Debug and resolve technical issues and bugs.\n5. Participate in code reviews and contribute to the improvement of our development processes.\n6. Optimize applications for maximum speed and scalability.\n7. Collaborate with backend developers to integrate APIs and other services.\n8. Ensure the technical feasibility of UI/UX designs.\n9. Stay up-to-date with the latest industry trends and technologies.\n\n#### Qualification Skills:\n- **React Native (MUST)**\n- **LINUX (MUST)**\n- Understanding of REST API concepts.\n- Node.js\n- Java\n- SQL / MySQL\n- Android & iOS Development",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537160/hacktiv8/career/developer-react-native-wv0vz5x21ge.png",
    "jobType": "Full-Time",
    "companyId": 118,
    "authorId": 3,
    "createdAt": "2024-08-13T08:19:20.631Z",
    "updatedAt": "2024-08-13T08:19:20.631Z"
  },
  {
    "title": "Full Stack Developer",
    "description": "**Position: Junior Python Developer**  \n  \n**Requirements:**  \n- Bachelor’s degree in IT or a related field  \n- Minimum of 1 year of experience in a junior-level position  \n- Strong proficiency in Python programming  \n- Expertise in at least one popular Python framework (such as Django, Flask, or FastAPI)  \n- Understanding of asynchronous programming, including its nuances and workarounds  \n- Ability to integrate multiple data sources and databases into a unified system  \n- Experience in developing backend services and RESTful APIs  \n- Proficient in code versioning tools, particularly Git  \n- Basic knowledge of front-end technologies like HTML5 and CSS3  \n- Experience in creating database schemas that represent and support business processes  \n- Familiarity with using Python in the banking industry is an advantage",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537161/hacktiv8/career/full-stack-developer-k22y3dk74v.png",
    "jobType": "Contract",
    "companyId": 11,
    "authorId": 8,
    "createdAt": "2024-08-13T08:19:21.814Z",
    "updatedAt": "2024-08-13T08:19:21.814Z"
  },
  {
    "title": "IT Development Manager",
    "description": "**Tanggung Jawab:**\n\n1. Mendevelop program dan aplikasi yang digunakan perusahaan.\n2. Maintain program/aplikasi yang dikembangkan.\n3. Mendevelop team programmer untuk menguasai pengembangan program/aplikasi yang ada, berkoordinasi dengan Head Programmer lainnya dan Dev Manager.\n4. Mengembangkan ide-ide digitalisasi sistem untuk mendukung perkembangan perusahaan.\n\n**Kualifikasi:**\n\n1. **Programming:**\n   - Golang, Vue Js (framework Nuxt), Progress (menjadi nilai tambah), mengerti konsep pembuatan API.\n\n2. **O/S:**\n   - LINUX, Windows 10/11, & Windows Server (memiliki Sertifikasi IOS menjadi nilai tambah).\n\n3. **Database:**\n   - My SQL, Postgres, Progress (menjadi nilai tambah).",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537162/hacktiv8/career/it-development-manager-fn03np5aimo.png",
    "jobType": "Contract",
    "companyId": 119,
    "authorId": 10,
    "createdAt": "2024-08-13T08:19:22.440Z",
    "updatedAt": "2024-08-13T08:19:22.440Z"
  },
  {
    "title": "Application Developer",
    "description": "**Deskripsi Pekerjaan**  \n• Mengembangkan aplikasi web baru sebagai produk perusahaan.  \n• Berkontribusi dalam seluruh siklus pengembangan produk, mulai dari desain hingga implementasi.  \n• Bekerja sama dengan manajer proyek dan tim pengembangan lainnya.  \n• Melakukan riset mengenai tren pengembangan terkini.  \n• Mendapatkan bonus untuk setiap proyek yang diikuti.  \n\n**Persyaratan**  \n• Minimum Diploma (D3) atau Gelar Sarjana (S1) di bidang Teknologi Informasi, Sistem Informasi, Ilmu Komputer, atau bidang terkait (fresh graduates dipersilakan melamar).  \n• Pengalaman minimal 1 tahun sebagai Pengembang Aplikasi untuk Aplikasi Web.  \n• Pengetahuan yang baik tentang PHP, MySQL, JavaScript, dan pengembangan aplikasi web di lingkungan LNMP/LAMP.  \n• Pengetahuan yang baik tentang framework MVC, diutamakan Laravel atau Code Igniter.  \n• Pengetahuan yang baik tentang pembuatan database MySQL dan optimasi kueri.  \n• Keterampilan komunikasi dalam Bahasa Inggris yang baik, baik tertulis maupun lisan.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537162/hacktiv8/career/application-developer-kobj30c70xc.jpg",
    "jobType": "Full-Time",
    "companyId": 120,
    "authorId": 2,
    "createdAt": "2024-08-13T08:19:23.058Z",
    "updatedAt": "2024-08-13T08:19:23.058Z"
  },
  {
    "title": "Full Stack Engineer",
    "description": "## Job Description\n\n**Position:** Software Engineer\n\n**Qualifications:**\n- Bachelor's Degree in a relevant field\n- Minimum of 3 years of experience as a Software Engineer\n- Proficient in designing and developing customer-facing applications\n- Possess a growth mindset\n- Demonstrate curiosity and eagerness to learn\n- Passionate about building a continuously evolving product\n- Committed to delivering high-quality applications\n- Dedicated to optimizing application performance\n- Capable of creating unit tests for every code\n- Experience with ASP.Net architecture\n- Familiarity with ASP.Net, JavaScript, HTML, Webforms, MVC, SQL Server, SSRS, and SSIS\n- Experience using DevOps in software development\n- Willing to work full-time in-office in Grogol, West Jakarta",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537163/hacktiv8/career/full-stack-engineer-n9elxgu5z8l.jpg",
    "jobType": "Full-Time",
    "companyId": 49,
    "authorId": 5,
    "createdAt": "2024-08-13T08:19:23.708Z",
    "updatedAt": "2024-08-13T08:19:23.708Z"
  },
  {
    "title": "Software Engineer Web & Mobile (Onsite Jagakarsa)",
    "description": "**Job Title: Fullstack Developer**  \n\n**Responsibilities:**  \n- Develop and maintain robust web and mobile applications, including both front-end and back-end components.  \n- Design and implement front-end user interfaces utilizing modern web technologies, specifically with React JS.  \n- Create and maintain mobile applications using React Native.  \n- Develop and integrate APIs to connect front-end interfaces with back-end services.  \n- Implement server-side logic using Golang.  \n- Collaborate with cross-functional teams to gather requirements and translate them into effective technical solutions.  \n- Participate in code reviews, testing, and debugging processes to ensure code quality and maintainability.  \n- Ensure optimal application performance, quality, and responsiveness.  \n- Implement user authentication and authorization mechanisms to secure both web and mobile applications.  \n- Stay updated on current trends and advancements in web and mobile development.  \n\n**Requirements:**  \n- Minimum of 3 years of experience in fullstack development.  \n- Proficient in Golang, React JS, and React Native.  \n- Experienced with React.js for web development and React Native for mobile development.  \n- Familiarity with MySQL, MongoDB, and Redis.  \n- Knowledge of containerization technologies, particularly Docker.  \n- Proven experience in implementing user authentication and authorization mechanisms to secure applications.  \n- Awareness of common web security threats (e.g., XSS, CSRF) and best practices for application security.  \n- Understanding of Continuous Integration and Continuous Deployment (CI/CD) pipelines.  \n\n**Placement:** Jakarta Selatan",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537163/hacktiv8/career/software-engineer-web-and-mobile-%28onsite-jagakarsa%29-8w2ya37hcx.png",
    "jobType": "Contract",
    "companyId": 121,
    "authorId": 7,
    "createdAt": "2024-08-13T08:19:24.325Z",
    "updatedAt": "2024-08-13T08:19:24.325Z"
  },
  {
    "title": "Fullstack Developer",
    "description": "Are you an experienced Full Stack Developer looking for a new challenge? We have an exciting opportunity for you to join our team as a Full Stack Developer. In this role, you will be the lead coder working alongside the project manager to plan and execute kanban tasks and sprints. You will participate in daily stand-ups and scrum meetings, coordinating with internal and external resources to ensure the smooth execution of projects.\n\nAs a responsible team leader and contributor, you will:\n- Build scalable frontend architecture, including reusable widgets and resources, following best practices for Flutter, Android, and iOS.\n- Develop scalable backend architecture along with reusable code and libraries for future use.\n- Proactively propose solutions and resolve issues.\n\nIf you're ready to elevate your skills, we want to hear from you.\n\n### Responsibilities\n- Plan and execute kanban tasks and sprints in a team setting.\n- Participate in daily stand-up meetings and scrum sessions with the team.\n- Coordinate and manage internal resources and third parties, including testers, designers, and developers, to ensure smooth project execution.\n- Conduct daily code reviews and maintain version control and CI/CD processes.\n- Ensure that projects are delivered on time and within scope.\n- Stay updated with technology trends and competitors, conducting research on technologies necessary for project execution.\n- Effectively communicate with stakeholders to clarify technical requirements.\n- Collaborate with testers to guarantee that products are production-ready.\n- Create scalable frontend architectures that include reusable widgets and resources based on best practices for Flutter/Android/iOS.\n- Design and implement scalable backend architectures and reusable codebases for future development.\n- Take initiative in proposing and resolving issues proactively.\n\n### Requirements\n- Expertise in JavaScript full stack technologies including Node.js, MongoDB, Nest.js, Flutter, HTML, and CSS.\n- Over 5 years of experience in both front-end and back-end development.\n- More than 5 years of experience with the Software Development Life Cycle (SDLC).\n- Strong understanding of business flow related to fintech or experience with integrating payment gateways.\n- Knowledge and experience with blockchain technologies is a plus.\n- A responsible team leader and collaborative team player.\n- Proficiency in spoken and written English.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537164/hacktiv8/career/fullstack-developer-qjuofcobezn.jpg",
    "jobType": "Full-Time",
    "companyId": 122,
    "authorId": 10,
    "createdAt": "2024-08-13T08:19:25.041Z",
    "updatedAt": "2024-08-13T08:19:25.041Z"
  },
  {
    "title": "Backend Developer",
    "description": "We are looking for a skilled professional to join our team with the following qualifications: \n\n- A minimum of 3 years of experience in software development. \n- Proficiency in Java Spring Boot, demonstrating strong technical capabilities. \n- Experience in handling banking projects is a plus and will be highly regarded.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537165/hacktiv8/career/backend-developer-g7hrwb2kqy.png",
    "jobType": "Full-Time",
    "companyId": 94,
    "authorId": 1,
    "createdAt": "2024-08-13T08:19:25.800Z",
    "updatedAt": "2024-08-13T08:19:25.800Z"
  },
  {
    "title": "Backend Project Developer",
    "description": "## The Company:\n\n**Tada** is a B2B2C loyalty and rewards platform designed to enhance business retention among channel partners, customers, and employees, fostering loyalty and driving growth. Established in 2012, Tada provides unified solutions that create engaging and rewarding experiences.\n\nAs an Indonesian SaaS company with a global footprint, Tada has supported over 400 local and international brands across diverse industries. Our groundbreaking loyalty solutions have earned us numerous accolades, affirming our status as a leader in the sector.\n\n## The Role: Backend Project Developer\n\n**Responsibilities:**\n- Develop and support Node.js microservice modules and shared libraries to enhance core business functions.\n- Manage, maintain, and enhance system performance.\n- Monitor, log, and establish alerts on key metrics.\n- Provide technical assistance and guidance through collaboration and pair programming.\n- Troubleshoot and resolve complex issues promptly.\n- Ensure accountability for written and reviewed code; practice test-driven development and defensive programming to deliver stable products.\n- Propose and implement optimal solutions.\n- Proactively seek assistance when facing roadblocks or issues with requirements.\n- Engage in documentation, reporting, and training.\n\n## The Candidate:\n\n**Qualifications:**\n- 2-3 years of experience as a backend developer proficient in Node.js or Golang.\n- Strong architectural and documentation skills, with experience in a true agile environment utilizing TDD and continuous integration.\n- Exceptional problem-solving and troubleshooting capabilities.\n- Solid knowledge in application development, specifically for robust and maintainable Node.js or Vue.js applications.\n- Strong foundation in Computer Science principles, focusing on object-oriented design, algorithms, data structures, and process-oriented problem-solving.\n- Effective communication skills for both technical and non-technical audiences.\n- Detail-oriented with demonstrated self-motivation and project follow-through.\n- Familiar with containerization technologies like Docker and orchestration tools like Kubernetes.\n- Knowledgeable about cloud computing platforms such as AWS, Azure, or Google Cloud Platform.\n\n## What We Offer:\n\n- **Creative Freedom:** Enjoy a high degree of autonomy and express your creativity in a supportive environment.\n- **Sabbatical Program:** Take a 15-day sabbatical leave every three years, recognizing the demands of long-term work.\n- **Growth Opportunities:** We promote your learning and development aspirations, fostering an entrepreneurial spirit in our team.\n- **Unique Work Environment:** Experience a mission-driven digital company with a start-up mentality, enriched by our presence since 2012.\n\n## Our Values:\n- Think and Act Like an Owner\n- Be Helpful\n- Be Open, Honest, and Constructive\n- Growth Mindset\n- Do What You Say You'll Do\n\nIf you are ready for the challenge, we invite you to join our team and contribute to our journey of becoming the Leading Loyalty & Rewards Platform in the region.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537166/hacktiv8/career/backend-project-developer-8uucojvopk5.jpg",
    "jobType": "Full-Time",
    "companyId": 123,
    "authorId": 7,
    "createdAt": "2024-08-13T08:19:26.432Z",
    "updatedAt": "2024-08-13T08:19:26.432Z"
  },
  {
    "title": "Web Programmer",
    "description": "### Job Description:\n\n* Develop and maintain software applications using the PHP framework.\n* Integrate cloud computing solutions into existing systems.\n* Collaborate with external data providers and utilize APIs effectively.\n* Create, integrate, and manage databases.\n* Troubleshoot and debug applications to ensure optimal functioning.\n* Research and implement new technologies and tools to enhance development processes.\n\n### Requirements:\n\n* Bachelor's Degree in Computer Science or Information Technology is required.\n* Fresh graduates are encouraged to apply.\n* Familiarity with web fundamentals including HTML, JavaScript, and CSS.\n* Proficient in PHP, Laravel, JSON, and XML.\n* Strong skills in RESTful APIs, MySQL database management, database design, and SQL queries.\n* Experience with Relational Database Management Systems (RDBMS).\n* Excellent time management and logical thinking abilities.\n* Strong problem-solving and troubleshooting skills.\n* Ability to work effectively as part of a team.\n* Positive attitude and passion for technology and development.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537166/hacktiv8/career/web-programmer-qi3jeu62n8d.png",
    "jobType": "Full-Time",
    "companyId": 124,
    "authorId": 1,
    "createdAt": "2024-08-13T08:19:27.139Z",
    "updatedAt": "2024-08-13T08:19:27.139Z"
  },
  {
    "title": "SQL Developer",
    "description": "We are seeking a skilled SQL Developer with a minimum of 2 years of experience in SQL Development. The ideal candidate will possess a profound understanding of SQL syntax, database concepts, and query optimization techniques, which are essential for efficient data retrieval and manipulation. Familiarity with Microsoft SQL Server is required to effectively navigate specific database environments.\n\nKey Responsibilities:\n- Optimize query performance using indexing strategies and database tuning methods to guarantee rapid and effective data retrieval.\n- Utilize strong analytical and problem-solving skills to identify and resolve data-related issues, ensuring data accuracy throughout processes.\n- Collaborate with cross-functional teams, demonstrating excellent written and verbal communication skills to understand business requirements and translate them into SQL queries.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537167/hacktiv8/career/sql-developer-31rhrgladbt.png",
    "jobType": "Contract",
    "companyId": 106,
    "authorId": 9,
    "createdAt": "2024-08-13T08:19:27.818Z",
    "updatedAt": "2024-08-13T08:19:27.818Z"
  },
  {
    "title": "Junior Programmer area Jakarta Utara",
    "description": "### Job Description:\n\n**Tanggung Jawab:**\n- Membuat dan menyesuaikan layout website sesuai kebutuhan.\n- Mengintegrasikan template dengan website yang sedang dikerjakan.\n- Mengembangkan script yang diperlukan dalam proses pembuatan website secara keseluruhan.\n- Mendesain banner atau gambar lain yang mendukung kinerja website.\n- Membuat desain untuk keperluan di luar website sesuai permintaan manajemen.\n\n**Catatan:**\nKandidat diharapkan memiliki pengetahuan tentang Programming (Java/PHP/Javascript), Database SQL, Web Programming, dan Desktop Programming.",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537168/hacktiv8/career/junior-programmer-area-jakarta-utara-w5ia80lk85.png",
    "jobType": "Contract",
    "companyId": 125,
    "authorId": 4,
    "createdAt": "2024-08-13T08:19:28.619Z",
    "updatedAt": "2024-08-13T08:19:28.619Z"
  },
  {
    "title": "Back-end Engineer",
    "description": "**Job Description**\n\nArvis is a SaaS Workflow Automation solution platform based in Indonesia. As an early-stage startup, we are seeking passionate individuals eager to build and explore new concepts. Come and join us!\n\n**What You Will be Doing**\n- Design and prototype new services and applications while developing maintainable, flexible, and scalable back-end frameworks.\n- Compile and analyze data, processes, and code to troubleshoot problems and identify areas for improvement.\n- Collaborate with Front-End Developers and the Head of Tech to establish goals, functional design, and cohesive code for enhanced user experience.\n- Manage deployment to development, staging, and production environments.\n- Write and maintain comprehensive technical documentation.\n\n**Who Is Our Ideal Candidate**\n- Fresh graduate or 1 year of work experience as a Back-End Developer.\n- Proficient in Web API, MongoDB, SQL, and Node.js.\n- Expertise in best practices, design patterns, architecture, data modeling, security protocols, and authentication methods.\n- Strong understanding of software engineering concepts and algorithms.\n- Solid grasp of database management and optimization techniques.\n- Experience with RESTful API design and implementation.\n- Ability to thrive in a fast-paced, collaborative environment.\n- Excellent problem-solving and communication skills.\n- Knowledge of containerization and orchestration tools (Docker, Kubernetes).\n- Curiosity to explore creative solutions and innovative approaches.\n- Familiarity with cloud services (AWS, Google Cloud, or Azure).",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537170/hacktiv8/career/back-end-engineer-amn6nrvq74a.png",
    "jobType": "Full-Time",
    "companyId": 126,
    "authorId": 6,
    "createdAt": "2024-08-13T08:19:30.685Z",
    "updatedAt": "2024-08-13T08:19:30.685Z"
  },
  {
    "title": "IT Software Developer Bootcamp Malang",
    "description": "**Be a Professional Software Engineer with Enigma Camp**\n\nSebagai penyedia IT bootcamp dan IT talent management, Enigma Camp menawarkan program pelatihan offline gratis (Enigma Camp 1.0) yang dijalankan selama kurang lebih 8 s/d 12 minggu dengan berbagai fasilitas pelengkap yaitu, tempat tinggal yang dilengkapi AC dan Wi-Fi, laptop untuk menunjang kegiatan pembelajaran, serta makan 3 (tiga) kali sehari.\n\n**Kualifikasi:**\n- Usia maksimal 30 tahun.\n- Memiliki minat atau pengetahuan dasar programming.\n- Lulusan SMA/SMK sederajat.\n\n**Benefit:**\n- Kesempatan bekerja bersama hiring partners multinasional.\n- Gaji minimal UMP Jakarta.\n- Sesi Coaching, Monitoring, dan Mentoring selama bekerja.\n- BPJS Kesehatan & Ketenagakerjaan.\n- Asuransi Kesehatan Swasta.\n\nDaftar sekarang dan dapatkan kesempatan untuk menjadi software engineer bersama kami!\n\n**Connect with us through:**\n- LinkedIn (Enigma Camp)\n- Instagram (@enigmacamp)\n- Twitter (@enigmacamp).",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537171/hacktiv8/career/it-software-developer-bootcamp-malang-x5za81zhug.jpg",
    "jobType": "Full-Time",
    "companyId": 127,
    "authorId": 3,
    "createdAt": "2024-08-13T08:19:31.485Z",
    "updatedAt": "2024-08-13T08:19:31.485Z"
  },
  {
    "title": "Corporate Sales",
    "description": "### Job Descriptions\n\n- **Memajukan hubungan dengan klien dan kemitraan korporat**\n- **Mengelola beberapa akun, mengembangkan dan mempertahankan klien**\n- **Menjadi kontak yang dipercaya untuk diskusi bisnis**\n- **Memperkuat target bisnis melalui pencapaian tujuan klien dan perusahaan**\n- **Menghasilkan penjualan untuk akun klien**\n- **Mengidentifikasi peluang untuk mengembangkan hubungan bisnis dengan klien yang sudah ada**\n- **Membangun hubungan dengan klien baru**\n\n### Job Requirements\n\n- **Minimal Pendidikan D3**\n- **Pengalaman minimal 1 tahun di bidang marketing**\n- **Familiar dengan bidang IT Training / Corporate Training lebih diutamakan**\n- **Pengalaman dalam penjualan B2B**\n- **Memiliki kemampuan komunikasi yang baik dan kemampuan pemasaran**\n- **Mampu bekerja di bawah tekanan, berorientasi pada target**\n- **Memiliki database sendiri**",
    "imgUrl": "https://res.cloudinary.com/dpjqm8kkk/image/upload/v1723537171/hacktiv8/career/corporate-sales-t14jz6i8wdg.png",
    "jobType": "Full-Time",
    "companyId": 128,
    "authorId": 8,
    "createdAt": "2024-08-13T08:19:32.202Z",
    "updatedAt": "2024-08-13T08:19:32.202Z"
  }
]